{
  "TACM-T1": {
    "id": "TACM-T1",
    "tier": 1,
    "label": "Opportunistic",
    "description": "Uses publicly available exploit code, commodity malware (cracked Cobalt Strike, Mimikatz), mass phishing, RDP brute force. No target selection — attacks whoever is vulnerable. Minimal evasion.",
    "stixSophistication": "minimal",
    "stixResourceLevel": [
      "individual",
      "club"
    ],
    "stixMotivations": [
      "personal-gain",
      "notoriety"
    ],
    "stixActorTypes": [
      "criminal",
      "hacker"
    ],
    "nist830Capability": "Low",
    "nist830Intent": "Variable",
    "nist830Targeting": "Very Low",
    "tradecraftIndicators": [
      "Indiscriminate target selection — scans for known vulnerabilities, exposed RDP, weak credentials",
      "Mass phishing, exploit public-facing applications (CVE < 30 days old), brute force",
      "Commodity tooling — cracked Cobalt Strike, Mimikatz, PowerShell Empire, off-the-shelf ransomware",
      "Minimal evasion — no anti-forensics, standard encodings, detectable by signature-based tools",
      "Limited lateral movement — stolen credentials, RDP, SMB with known tools",
      "Basic persistence — scheduled tasks, registry run keys, known autostart locations"
    ],
    "typicalDwellTime": "Hours to days",
    "toolingProfile": "Public tools, cracked commercial tools, commodity malware kits",
    "exampleActorTypes": [
      "Script kiddies",
      "Ransomware affiliates",
      "Opportunistic criminals"
    ],
    "cumulativeFrom": [],
    "techniqueDelta": 99,
    "techniqueCumulative": 99
  },
  "TACM-T2": {
    "id": "TACM-T2",
    "tier": 2,
    "label": "Targeted Criminal",
    "description": "Targeted spear-phishing with reconnaissance, credential harvesting, purchased access from initial access brokers, lateral movement with stolen credentials, ransomware deployment with data exfiltration. Invests effort in specific high-value targets.",
    "stixSophistication": "intermediate",
    "stixResourceLevel": [
      "team",
      "organization"
    ],
    "stixMotivations": [
      "personal-gain",
      "organizational-gain"
    ],
    "stixActorTypes": [
      "crime-syndicate",
      "criminal"
    ],
    "nist830Capability": "Moderate",
    "nist830Intent": "High",
    "nist830Targeting": "Moderate",
    "tradecraftIndicators": [
      "Selective target selection — researches targets, purchases access from initial access brokers, industry-specific",
      "Targeted spear-phishing with social engineering, watering holes, valid accounts from credential dumps",
      "Modified tooling — customised phishing kits, commodity tools with modified configurations, purchased malware",
      "Moderate evasion — obfuscation of scripts, timestomping, attempts to disable endpoint protection",
      "Active lateral movement — credential harvesting, pass-the-hash, RDP pivoting, domain trust abuse",
      "Moderate persistence — multiple persistence mechanisms, service creation, DLL search order hijacking"
    ],
    "typicalDwellTime": "Days to weeks",
    "toolingProfile": "Modified commodity tools, customised phishing kits, purchased malware and access",
    "exampleActorTypes": [
      "Organised cybercrime groups",
      "Ransomware operators (Conti, LockBit, BlackCat)",
      "FIN-series groups"
    ],
    "cumulativeFrom": [
      "TACM-T1"
    ],
    "techniqueDelta": 202,
    "techniqueCumulative": 301
  },
  "TACM-T3": {
    "id": "TACM-T3",
    "tier": 3,
    "label": "Organised / State-Proxy",
    "description": "Custom tooling, living-off-the-land binaries (LOLBins), supply chain compromise via third parties, active counter-forensics (log clearing, timestomping, indicator removal), deep persistence mechanisms. Adapts TTPs when detected.",
    "stixSophistication": "advanced",
    "stixResourceLevel": [
      "organization"
    ],
    "stixMotivations": [
      "organizational-gain",
      "dominance",
      "ideology"
    ],
    "stixActorTypes": [
      "crime-syndicate",
      "nation-state",
      "spy"
    ],
    "nist830Capability": "High",
    "nist830Intent": "High",
    "nist830Targeting": "High",
    "tradecraftIndicators": [
      "Deliberate target selection — specific organisations or sectors, intelligence-driven targeting",
      "Supply chain via trusted third parties, trusted relationship abuse, zero-day in perimeter devices",
      "Custom tooling — bespoke implants, living-off-the-land binaries (LOLBins), memory-only payloads",
      "Active evasion — counter-forensics (log clearing, timestomping, indicator removal), process injection, AMSI bypass",
      "Sophisticated lateral movement — Kerberoasting, golden/silver tickets, WMI/WinRM, DCSync, trust boundary crossing",
      "Deep persistence — bootkit/rootkit, firmware implant, scheduled task via COM objects, WMI event subscription"
    ],
    "typicalDwellTime": "Weeks to months",
    "toolingProfile": "Bespoke implants, living-off-the-land, memory-only payloads, custom C2",
    "exampleActorTypes": [
      "State-proxy groups (Sandworm, Lazarus)",
      "Advanced cybercrime (FIN7, FIN11)",
      "PSOA/surveillance vendors"
    ],
    "cumulativeFrom": [
      "TACM-T1",
      "TACM-T2"
    ],
    "techniqueDelta": 147,
    "techniqueCumulative": 448
  },
  "TACM-T4": {
    "id": "TACM-T4",
    "tier": 4,
    "label": "State-Directed",
    "description": "Zero-day exploitation, firmware/hardware implants, covert C2 over legitimate channels, long-term persistent access (months to years), operational security discipline, influence operations. Willing to burn expensive capabilities for strategic objectives.",
    "stixSophistication": "expert",
    "stixResourceLevel": [
      "government"
    ],
    "stixMotivations": [
      "dominance",
      "ideology",
      "coercion"
    ],
    "stixActorTypes": [
      "nation-state",
      "spy"
    ],
    "nist830Capability": "Very High",
    "nist830Intent": "Very High",
    "nist830Targeting": "Very High",
    "tradecraftIndicators": [
      "Strategic target selection — national security, CNI, defence industrial base, diplomatic targets",
      "Zero-day exploitation, hardware/firmware implants, insider recruitment, signals intelligence",
      "Bespoke tooling — purpose-built for specific targets, modular C2 frameworks, covert channels over legitimate traffic",
      "Comprehensive evasion — encryption of implant communications, steganography, traffic blending, timestomped forensic artifacts, operational security discipline",
      "Patient lateral movement — low-and-slow, scheduled during business hours to blend, careful domain enumeration",
      "Long-term persistence — firmware-level, BIOS/UEFI, virtualisation-layer, designed to survive reimaging"
    ],
    "typicalDwellTime": "Months to years",
    "toolingProfile": "Purpose-built for specific targets, modular C2, covert channels, zero-day capabilities",
    "exampleActorTypes": [
      "APT29 (SVR)",
      "APT28 (GRU)",
      "Equation Group (NSA/TAO)",
      "Unit 8200 operations"
    ],
    "cumulativeFrom": [
      "TACM-T1",
      "TACM-T2",
      "TACM-T3"
    ],
    "techniqueDelta": 20,
    "techniqueCumulative": 468
  },
  "TACM-T5": {
    "id": "TACM-T5",
    "tier": 5,
    "label": "Strategic",
    "description": "Supply chain subversion at source (SolarWinds-class), standards manipulation, pre-positioning in critical infrastructure, cross-domain operations (cyber + HUMINT + SIGINT). Only relevant for national security, CNI, and intelligence targets.",
    "stixSophistication": "strategic",
    "stixResourceLevel": [
      "government"
    ],
    "stixMotivations": [
      "dominance",
      "coercion"
    ],
    "stixActorTypes": [
      "nation-state"
    ],
    "nist830Capability": "Very High",
    "nist830Intent": "Very High",
    "nist830Targeting": "Very High",
    "tradecraftIndicators": [
      "Global/systemic target selection — supply chains, infrastructure providers, protocol implementations, standards",
      "Supply chain subversion at source, pre-positioned access, HUMINT-enabled cyber operations",
      "State-of-the-art tooling — capabilities unknown until deployed, typically burned after single use",
      "Operational evasion — entire operations designed to be unattributable, multi-year planning cycles",
      "Pre-positioned lateral movement — access established years before operational use",
      "Infrastructure-level persistence — embedded in vendor software (SolarWinds), hardware supply chain, firmware"
    ],
    "typicalDwellTime": "Years (pre-positioning phase)",
    "toolingProfile": "State-of-the-art, single-use, unattributable, often burned after deployment",
    "exampleOperations": [
      "SolarWinds (SVR)",
      "Stuxnet (US/IL)",
      "Volt Typhoon (PRC pre-positioning in US CNI)"
    ],
    "cumulativeFrom": [
      "TACM-T1",
      "TACM-T2",
      "TACM-T3",
      "TACM-T4"
    ],
    "techniqueDelta": 1,
    "techniqueCumulative": 469
  }
}