{
  "TPE-NET-01": {
    "id": "TPE-NET-01",
    "name": "TCP/IP",
    "layer": "L3-4",
    "category": "transport",
    "category_name": "Network Transport",
    "description": "Transmission Control Protocol / Internet Protocol — the foundational transport and network layer protocol suite. TCP provides reliable, ordered, connection-oriented byte streams over IP. Attackers abuse raw TCP/IP for non-application-layer command and control, data exfiltration via custom protocols, and covert channels that bypass application-layer inspection. Nearly all higher-layer protocols depend on TCP/IP.",
    "techniques": ["T1095"],
    "secureAlternative": null,
    "controlRefs": ["SC-07", "SC-08", "SI-04", "AC-04"]
  },
  "TPE-NET-02": {
    "id": "TPE-NET-02",
    "name": "UDP",
    "layer": "L4",
    "category": "transport",
    "category_name": "Network Transport",
    "description": "User Datagram Protocol — connectionless transport protocol providing low-latency, best-effort delivery without handshake or flow control. Used by DNS, NTP, SNMP, DHCP, and real-time media. Attackers exploit UDP's stateless nature for reflection/amplification DDoS attacks, IP spoofing (no handshake to validate source), and covert channels. The lack of connection state makes UDP traffic harder to filter effectively.",
    "techniques": ["T1095"],
    "secureAlternative": null,
    "controlRefs": ["SC-07", "SC-05", "SI-04"]
  },
  "TPE-NET-03": {
    "id": "TPE-NET-03",
    "name": "ICMP",
    "layer": "L3",
    "category": "transport",
    "category_name": "Network Transport",
    "description": "Internet Control Message Protocol — diagnostic and error-reporting protocol used by ping, traceroute, and path MTU discovery. Attackers abuse ICMP for network reconnaissance (host discovery, topology mapping), covert channels (ICMP tunnelling), and evasion of stateful firewalls. ICMP type/code filtering is essential at network boundaries.",
    "techniques": [],
    "secureAlternative": null,
    "controlRefs": ["SC-07", "SI-04", "CM-07"]
  },
  "TPE-NET-04": {
    "id": "TPE-NET-04",
    "name": "IPsec",
    "layer": "L3",
    "category": "transport",
    "category_name": "Network Transport",
    "description": "Internet Protocol Security — suite of protocols providing authentication (AH), encryption (ESP), and key exchange (IKE) at the network layer. Provides confidentiality and integrity for IP traffic without application modification. Misconfiguration risks include weak cipher selection, pre-shared key exposure, IKE aggressive mode leaking identities, and failure to enforce perfect forward secrecy.",
    "techniques": [],
    "secureAlternative": null,
    "controlRefs": ["SC-08", "SC-12", "SC-13", "IA-05"]
  },
  "TPE-DNS-01": {
    "id": "TPE-DNS-01",
    "name": "DNS",
    "layer": "L7",
    "category": "resolution",
    "category_name": "Name Resolution",
    "description": "Domain Name System — hierarchical distributed naming system resolving domain names to IP addresses. Attackers abuse DNS for command and control (DNS tunnelling), dynamic resolution of C2 infrastructure, domain generation algorithms, and cache poisoning. DNS is frequently allowed through firewalls, making it an attractive exfiltration and C2 channel.",
    "techniques": ["T1071.004", "T1568", "T1568.002"],
    "secureAlternative": null,
    "controlRefs": ["SC-07", "SC-20", "SC-21", "SC-22", "SI-04"]
  },
  "TPE-DNS-02": {
    "id": "TPE-DNS-02",
    "name": "mDNS",
    "layer": "L7",
    "category": "resolution",
    "category_name": "Name Resolution",
    "description": "Multicast DNS — zero-configuration name resolution protocol using multicast UDP on port 5353. Intended for small networks without dedicated DNS infrastructure. Attackers exploit mDNS for name resolution poisoning on local networks, enabling adversary-in-the-middle attacks and credential interception. Should be disabled on enterprise networks where centralised DNS is available.",
    "techniques": ["T1557.001"],
    "secureAlternative": "TPE-DNS-01",
    "controlRefs": ["SC-07", "CM-07", "SI-04"]
  },
  "TPE-DNS-03": {
    "id": "TPE-DNS-03",
    "name": "LLMNR/NBT-NS",
    "layer": "L7",
    "category": "resolution",
    "category_name": "Name Resolution",
    "description": "Link-Local Multicast Name Resolution and NetBIOS Name Service — legacy Windows name resolution fallback protocols. When DNS resolution fails, Windows falls back to LLMNR (UDP 5355) then NBT-NS (UDP 137). Attackers poison these responses to redirect authentication attempts to attacker-controlled hosts, capturing NTLMv2 hashes for offline cracking or relay attacks. Disabling both is a critical hardening step.",
    "techniques": ["T1557.001"],
    "secureAlternative": "TPE-DNS-01",
    "controlRefs": ["CM-07", "SC-07", "SI-04", "IA-05"]
  },
  "TPE-AUTH-01": {
    "id": "TPE-AUTH-01",
    "name": "Kerberos",
    "layer": "L7",
    "category": "authentication",
    "category_name": "Authentication",
    "description": "Kerberos v5 — ticket-based authentication protocol using symmetric key cryptography and a trusted third party (KDC). Default authentication protocol for Active Directory domains. Attackers target Kerberos for ticket theft (Golden/Silver Ticket attacks), Kerberoasting (requesting service tickets to crack offline), AS-REP roasting, delegation abuse, and pass-the-ticket attacks.",
    "techniques": ["T1558", "T1558.001", "T1558.002", "T1558.003", "T1558.004", "T1550.001"],
    "secureAlternative": null,
    "controlRefs": ["IA-02", "IA-05", "AC-02", "SI-04", "SC-23"]
  },
  "TPE-AUTH-02": {
    "id": "TPE-AUTH-02",
    "name": "NTLM",
    "layer": "L7",
    "category": "authentication",
    "category_name": "Authentication",
    "description": "NT LAN Manager — challenge-response authentication protocol. Legacy protocol still prevalent in Windows environments due to backwards compatibility. Attackers exploit NTLM for pass-the-hash attacks (authenticating with stolen hash without knowing the password), NTLM relay attacks (forwarding authentication to another service), and offline hash cracking. Microsoft recommends migration to Kerberos.",
    "techniques": ["T1557.001", "T1550.002"],
    "secureAlternative": "TPE-AUTH-01",
    "controlRefs": ["IA-02", "IA-05", "SC-23", "CM-07", "SI-04"]
  },
  "TPE-AUTH-03": {
    "id": "TPE-AUTH-03",
    "name": "LDAP/LDAPS",
    "layer": "L7",
    "category": "authentication",
    "category_name": "Authentication",
    "description": "Lightweight Directory Access Protocol — directory service protocol for querying and modifying directory services (primarily Active Directory). LDAPS adds TLS encryption. Attackers query LDAP for domain reconnaissance (enumerating users, groups, OUs, GPOs, trusts), identifying privileged accounts, and mapping attack paths. Unencrypted LDAP exposes credentials in transit.",
    "techniques": ["T1087.002", "T1087.001", "T1087.004"],
    "secureAlternative": null,
    "controlRefs": ["AC-06", "AU-02", "SC-08", "IA-05", "AC-02"]
  },
  "TPE-AUTH-04": {
    "id": "TPE-AUTH-04",
    "name": "RADIUS/TACACS+",
    "layer": "L7",
    "category": "authentication",
    "category_name": "Authentication",
    "description": "Remote Authentication Dial-In User Service / Terminal Access Controller Access-Control System Plus — AAA (Authentication, Authorisation, Accounting) protocols for network device access control. RADIUS encrypts only passwords; TACACS+ encrypts the full payload. Attackers target shared secrets, intercept RADIUS traffic for credential extraction, and exploit AAA misconfigurations for network device access.",
    "techniques": [],
    "secureAlternative": null,
    "controlRefs": ["IA-02", "IA-05", "AC-02", "AC-17", "SC-08"]
  },
  "TPE-AUTH-05": {
    "id": "TPE-AUTH-05",
    "name": "SAML",
    "layer": "L7",
    "category": "authentication",
    "category_name": "Authentication",
    "description": "Security Assertion Markup Language — XML-based federation protocol for single sign-on between identity providers and service providers. Attackers forge SAML tokens (Golden SAML attacks) by compromising the IdP signing certificate, enabling persistent access to all federated services without touching individual service credentials. Notably used in the SolarWinds/SUNBURST campaign.",
    "techniques": ["T1606.002"],
    "secureAlternative": null,
    "controlRefs": ["IA-02", "SC-12", "SC-13", "IA-08", "SI-04"]
  },
  "TPE-AUTH-06": {
    "id": "TPE-AUTH-06",
    "name": "OAuth 2.0/OIDC",
    "layer": "L7",
    "category": "authentication",
    "category_name": "Authentication",
    "description": "OAuth 2.0 / OpenID Connect — authorisation and authentication framework for delegated access and federated identity. OAuth 2.0 provides scoped access tokens; OIDC adds an identity layer with ID tokens. Attackers steal application access tokens via consent phishing, redirect URI manipulation, authorisation code interception, and device code flow abuse.",
    "techniques": ["T1528"],
    "secureAlternative": null,
    "controlRefs": ["IA-02", "IA-08", "AC-03", "SC-08", "SI-04"]
  },
  "TPE-FILE-01": {
    "id": "TPE-FILE-01",
    "name": "SMB/CIFS",
    "layer": "L7",
    "category": "file_sharing",
    "category_name": "File & Resource Sharing",
    "description": "Server Message Block / Common Internet File System — network file sharing protocol for Windows environments. Provides file, printer, and named pipe sharing. Attackers abuse SMB for lateral movement via admin shares (C$, ADMIN$), lateral tool transfer, credential relay attacks, remote service execution, and EternalBlue-class exploits. SMBv1 is critically vulnerable and should be disabled.",
    "techniques": ["T1021.002", "T1570", "T1080"],
    "secureAlternative": null,
    "controlRefs": ["SC-07", "CM-07", "AC-03", "AC-17", "SI-04"]
  },
  "TPE-FILE-02": {
    "id": "TPE-FILE-02",
    "name": "NFS",
    "layer": "L7",
    "category": "file_sharing",
    "category_name": "File & Resource Sharing",
    "description": "Network File System — distributed file system protocol primarily used in Unix/Linux environments. NFSv3 relies on IP-based trust (no user authentication); NFSv4 adds Kerberos support. Attackers exploit NFS for unauthorised data access via misconfigured exports, UID/GID spoofing on NFSv3, and lateral movement by mounting remote shares.",
    "techniques": [],
    "secureAlternative": null,
    "controlRefs": ["AC-03", "AC-06", "SC-08", "CM-06"]
  },
  "TPE-FILE-03": {
    "id": "TPE-FILE-03",
    "name": "FTP/SFTP",
    "layer": "L7",
    "category": "file_sharing",
    "category_name": "File & Resource Sharing",
    "description": "File Transfer Protocol / SSH File Transfer Protocol — file transfer protocols. FTP transmits credentials and data in cleartext; SFTP tunnels file operations over SSH with full encryption. Attackers exploit FTP for credential interception, anonymous access abuse, and as a C2/exfiltration channel. Organisations should migrate from FTP to SFTP or SCP for all file transfers.",
    "techniques": ["T1071.002"],
    "secureAlternative": null,
    "controlRefs": ["SC-08", "AC-17", "CM-07", "AU-02"]
  },
  "TPE-WEB-01": {
    "id": "TPE-WEB-01",
    "name": "HTTP/HTTPS",
    "layer": "L7",
    "category": "web",
    "category_name": "Web & API",
    "description": "Hypertext Transfer Protocol / HTTP Secure — the foundation of web communication. HTTPS adds TLS encryption. The most common protocol for application delivery and the most targeted attack surface. Attackers exploit web applications for initial access (SQLi, XSS, SSRF, deserialization), use HTTPS for C2 communications that blend with legitimate traffic, and abuse web services for data exfiltration.",
    "techniques": ["T1071.001", "T1190", "T1059.007"],
    "secureAlternative": null,
    "controlRefs": ["SC-08", "SC-07", "SI-10", "SI-04", "AC-03"]
  },
  "TPE-WEB-02": {
    "id": "TPE-WEB-02",
    "name": "WebSocket",
    "layer": "L7",
    "category": "web",
    "category_name": "Web & API",
    "description": "WebSocket protocol (RFC 6455) — full-duplex communication channel over a single TCP connection, initiated via HTTP upgrade. Used for real-time applications (chat, streaming, notifications). Attackers exploit WebSocket for C2 tunnelling through web proxies, cross-site WebSocket hijacking, and persistent connections that evade request-based security controls.",
    "techniques": ["T1071.001"],
    "secureAlternative": null,
    "controlRefs": ["SC-07", "SC-08", "SI-04", "AC-04"]
  },
  "TPE-WEB-03": {
    "id": "TPE-WEB-03",
    "name": "REST/GraphQL API",
    "layer": "L7",
    "category": "web",
    "category_name": "Web & API",
    "description": "RESTful and GraphQL application programming interfaces — structured interfaces for programmatic service interaction over HTTP. Attackers exploit APIs for broken object-level authorisation (BOLA/IDOR), injection attacks, excessive data exposure, mass assignment, and API key theft. GraphQL's introspection feature can expose the entire schema if not disabled in production.",
    "techniques": ["T1106", "T1190"],
    "secureAlternative": null,
    "controlRefs": ["AC-03", "AC-04", "SC-08", "SI-10", "IA-08"]
  },
  "TPE-WEB-04": {
    "id": "TPE-WEB-04",
    "name": "gRPC",
    "layer": "L7",
    "category": "web",
    "category_name": "Web & API",
    "description": "gRPC Remote Procedure Call — high-performance RPC framework using HTTP/2 and Protocol Buffers binary serialisation. Used heavily in microservices and cloud-native architectures. Binary serialisation makes traffic harder to inspect with traditional web application firewalls. Attackers exploit gRPC for service-to-service impersonation, message tampering, and bypassing WAF inspection that expects JSON/XML.",
    "techniques": ["T1106"],
    "secureAlternative": null,
    "controlRefs": ["SC-08", "AC-03", "IA-08", "SI-04"]
  },
  "TPE-REM-01": {
    "id": "TPE-REM-01",
    "name": "SSH",
    "layer": "L7",
    "category": "remote_access",
    "category_name": "Remote Access",
    "description": "Secure Shell — encrypted remote shell, file transfer, and port forwarding protocol. Provides strong authentication (keys or passwords over encrypted channel) and encrypted sessions. Attackers abuse SSH for persistent access via authorised key injection, lateral movement to Linux/Unix systems, port forwarding to tunnel through network boundaries, and brute-force attacks against password authentication.",
    "techniques": ["T1021.004", "T1098.004"],
    "secureAlternative": null,
    "controlRefs": ["AC-17", "IA-02", "IA-05", "SC-08", "AU-02"]
  },
  "TPE-REM-02": {
    "id": "TPE-REM-02",
    "name": "RDP",
    "layer": "L7",
    "category": "remote_access",
    "category_name": "Remote Access",
    "description": "Remote Desktop Protocol — Microsoft proprietary protocol for graphical remote desktop access. Operates on TCP 3389 by default. One of the most commonly exploited initial access and lateral movement vectors. Attackers brute-force RDP credentials, exploit BlueKeep-class vulnerabilities, use stolen credentials for lateral movement, and deploy ransomware via RDP-accessible systems.",
    "techniques": ["T1021.001"],
    "secureAlternative": null,
    "controlRefs": ["AC-17", "IA-02", "SC-07", "SC-08", "SI-04"]
  },
  "TPE-REM-03": {
    "id": "TPE-REM-03",
    "name": "VNC",
    "layer": "L7",
    "category": "remote_access",
    "category_name": "Remote Access",
    "description": "Virtual Network Computing — cross-platform remote desktop protocol using the RFB (Remote Framebuffer) protocol. Many VNC implementations lack encryption by default, transmitting screen data and keystrokes in cleartext. Attackers exploit VNC for persistent graphical access, credential interception on unencrypted sessions, and lateral movement. Should be tunnelled over SSH or VPN when used.",
    "techniques": ["T1021.005"],
    "secureAlternative": "TPE-REM-01",
    "controlRefs": ["AC-17", "SC-08", "IA-02", "CM-07"]
  },
  "TPE-REM-04": {
    "id": "TPE-REM-04",
    "name": "WinRM/WMI",
    "layer": "L7",
    "category": "remote_access",
    "category_name": "Remote Access",
    "description": "Windows Remote Management / Windows Management Instrumentation — Microsoft remote management protocols. WinRM implements the WS-Management protocol for remote PowerShell and management tasks. WMI provides a programmatic interface for system management. Attackers abuse WinRM/WMI for fileless lateral movement, remote command execution, persistence via WMI event subscriptions, and living-off-the-land techniques.",
    "techniques": ["T1021.006"],
    "secureAlternative": null,
    "controlRefs": ["AC-17", "AC-06", "CM-07", "AU-02", "SI-04"]
  },
  "TPE-MSG-01": {
    "id": "TPE-MSG-01",
    "name": "SMTP",
    "layer": "L7",
    "category": "messaging",
    "category_name": "Email & Messaging",
    "description": "Simple Mail Transfer Protocol — email transmission protocol. Handles message routing between mail servers (port 25) and mail submission from clients (port 587). Attackers abuse email as the primary initial access vector — phishing with attachments, links, and HTML smuggling. Email is also used for data exfiltration, business email compromise, and as a C2 channel. DMARC, DKIM, and SPF provide sender authentication.",
    "techniques": ["T1566", "T1566.001", "T1566.002", "T1566.003", "T1114"],
    "secureAlternative": null,
    "controlRefs": ["SC-07", "SC-08", "SI-03", "SI-08", "AT-02"]
  },
  "TPE-MSG-02": {
    "id": "TPE-MSG-02",
    "name": "IMAP/POP3",
    "layer": "L7",
    "category": "messaging",
    "category_name": "Email & Messaging",
    "description": "Internet Message Access Protocol / Post Office Protocol v3 — email retrieval protocols. IMAP provides server-side mailbox management; POP3 downloads messages locally. Attackers target email retrieval for collection of sensitive communications, credential harvesting from stored emails, and persistent access to mailboxes via compromised credentials or application passwords.",
    "techniques": ["T1114.002", "T1114.001"],
    "secureAlternative": null,
    "controlRefs": ["SC-08", "IA-02", "IA-05", "AC-03", "AU-02"]
  },
  "TPE-DB-01": {
    "id": "TPE-DB-01",
    "name": "SQL (TDS/MySQL/PostgreSQL)",
    "layer": "L7",
    "category": "database",
    "category_name": "Database",
    "description": "SQL database wire protocols — TDS (SQL Server), MySQL protocol, and PostgreSQL protocol. These transport SQL queries and result sets between applications and relational databases. Attackers exploit SQL injection to bypass authentication, extract data, execute OS commands, and escalate privileges. Direct database access via exposed ports enables data theft from information repositories.",
    "techniques": ["T1190", "T1213"],
    "secureAlternative": null,
    "controlRefs": ["SI-10", "AC-03", "AC-06", "SC-08", "AU-02"]
  },
  "TPE-DB-02": {
    "id": "TPE-DB-02",
    "name": "NoSQL (MongoDB/Redis)",
    "layer": "L7",
    "category": "database",
    "category_name": "Database",
    "description": "NoSQL database protocols — MongoDB wire protocol and Redis RESP (REdis Serialization Protocol). NoSQL databases frequently default to no authentication and bind to all interfaces. Attackers exploit unauthenticated access for data theft, inject NoSQL operators for query manipulation, and abuse Redis EVAL for arbitrary code execution on the database server.",
    "techniques": ["T1190"],
    "secureAlternative": null,
    "controlRefs": ["AC-03", "IA-02", "CM-06", "SC-08", "SC-07"]
  },
  "TPE-INF-01": {
    "id": "TPE-INF-01",
    "name": "SNMP",
    "layer": "L7",
    "category": "infrastructure",
    "category_name": "Infrastructure",
    "description": "Simple Network Management Protocol — network device monitoring and configuration protocol. SNMPv1/v2c use community strings (effectively cleartext passwords); SNMPv3 adds authentication and encryption. Attackers exploit SNMP to extract device configurations (containing credentials, ACLs, routing tables), enumerate network topology, and modify device configurations. Default community strings ('public', 'private') remain widespread.",
    "techniques": ["T1602", "T1602.001", "T1602.002"],
    "secureAlternative": null,
    "controlRefs": ["CM-06", "IA-02", "SC-08", "AC-06", "AU-02"]
  },
  "TPE-INF-02": {
    "id": "TPE-INF-02",
    "name": "Syslog",
    "layer": "L7",
    "category": "infrastructure",
    "category_name": "Infrastructure",
    "description": "Syslog protocol (RFC 5424) — standard for message logging over UDP (514), TCP (601/6514). Traditional syslog over UDP is unencrypted, unauthenticated, and unreliable. Attackers exploit syslog for log injection (inserting false entries), log tampering during intrusions, and intercepting logs containing sensitive information. Syslog over TLS (RFC 5425) and reliable delivery should be enforced.",
    "techniques": [],
    "secureAlternative": null,
    "controlRefs": ["AU-02", "AU-03", "AU-04", "SC-08", "SI-04"]
  },
  "TPE-INF-03": {
    "id": "TPE-INF-03",
    "name": "NTP",
    "layer": "L7",
    "category": "infrastructure",
    "category_name": "Infrastructure",
    "description": "Network Time Protocol — time synchronisation protocol using UDP port 123. Accurate time is critical for log correlation, certificate validation, Kerberos authentication, and forensic timelines. Attackers exploit NTP for amplification DDoS attacks and time manipulation to invalidate security tokens, disrupt Kerberos (5-minute tolerance), and corrupt forensic evidence timelines.",
    "techniques": [],
    "secureAlternative": null,
    "controlRefs": ["AU-08", "SC-07", "CM-06"]
  },
  "TPE-CLD-01": {
    "id": "TPE-CLD-01",
    "name": "Cloud Provider API",
    "layer": "L7",
    "category": "cloud",
    "category_name": "Cloud & Container",
    "description": "Cloud provider management APIs (AWS API, Azure Resource Manager, GCP API) — RESTful interfaces for provisioning, configuring, and managing cloud infrastructure. All cloud operations flow through these APIs. Attackers compromise cloud credentials to create resources (cryptomining), modify security groups, exfiltrate data, create persistence (IAM users/roles), and enumerate cloud infrastructure for lateral movement.",
    "techniques": ["T1078.004", "T1580"],
    "secureAlternative": null,
    "controlRefs": ["AC-02", "AC-03", "AC-06", "IA-02", "IA-05", "AU-02", "SC-08"]
  },
  "TPE-CLD-02": {
    "id": "TPE-CLD-02",
    "name": "Kubernetes API",
    "layer": "L7",
    "category": "cloud",
    "category_name": "Cloud & Container",
    "description": "Kubernetes API Server — the control plane endpoint for managing containerised workloads. All cluster operations (pod scheduling, RBAC, secrets, networking) flow through the API server on port 6443. Attackers exploit exposed or misconfigured API servers for container escape, deploying malicious containers, accessing secrets, and pivoting to the underlying node infrastructure.",
    "techniques": ["T1609", "T1610"],
    "secureAlternative": null,
    "controlRefs": ["AC-03", "AC-06", "CM-06", "IA-02", "SC-07", "AU-02"]
  },
  "TPE-CLD-03": {
    "id": "TPE-CLD-03",
    "name": "Docker API",
    "layer": "L7",
    "category": "cloud",
    "category_name": "Cloud & Container",
    "description": "Docker Engine API — RESTful interface for managing Docker containers, images, networks, and volumes. The Docker socket (/var/run/docker.sock) provides root-equivalent access to the host. Attackers exploit exposed Docker APIs for container escape to host, deploying cryptomining containers, mounting host filesystems, and using privileged containers for full host compromise.",
    "techniques": ["T1610"],
    "secureAlternative": null,
    "controlRefs": ["AC-03", "CM-06", "CM-07", "SC-07", "AC-06"]
  },
  "TPE-ICS-01": {
    "id": "TPE-ICS-01",
    "name": "Modbus",
    "layer": "L7",
    "category": "industrial",
    "category_name": "Industrial",
    "description": "Modbus — serial communication protocol for industrial control systems, originally by Modicon (1979). Modbus TCP extends it over Ethernet. The protocol has no authentication, no encryption, and no integrity checking — any device on the network can read/write registers. Attackers exploit Modbus for manipulating physical processes, reading sensor values for reconnaissance, and disrupting industrial operations.",
    "techniques": [],
    "secureAlternative": null,
    "controlRefs": ["SC-07", "AC-04", "SI-04", "AC-03"]
  },
  "TPE-ICS-02": {
    "id": "TPE-ICS-02",
    "name": "OPC UA",
    "layer": "L7",
    "category": "industrial",
    "category_name": "Industrial",
    "description": "OPC Unified Architecture — platform-independent service-oriented architecture for industrial data exchange. Successor to OPC Classic (DCOM-based). OPC UA includes built-in security with certificate-based authentication, encryption, and signing. However, misconfigured deployments with security disabled, self-signed certificates, or anonymous access remain common attack targets in OT environments.",
    "techniques": [],
    "secureAlternative": null,
    "controlRefs": ["SC-08", "IA-02", "SC-12", "CM-06"]
  },
  "TPE-ICS-03": {
    "id": "TPE-ICS-03",
    "name": "BACnet",
    "layer": "L7",
    "category": "industrial",
    "category_name": "Industrial",
    "description": "Building Automation and Control Networks — communication protocol for building management systems (HVAC, lighting, access control, fire detection). BACnet/IP operates over UDP port 47808. Like Modbus, BACnet was designed without security — no authentication, no encryption. Attackers exploit BACnet for building system manipulation, physical access control bypass, and as a pivot point into corporate networks via converged IT/OT infrastructure.",
    "techniques": [],
    "secureAlternative": null,
    "controlRefs": ["SC-07", "AC-04", "SI-04", "CM-07"]
  }
}
