{
  "version": "NIST 800-53 Rev 4",
  "source": "opensecurityarchitecture.org",
  "families": {
    "IA": {
      "name": "Identification and Authentication",
      "controls": [
        "IA-02",
        "IA-01",
        "IA-03",
        "IA-04",
        "IA-05",
        "IA-06",
        "IA-07"
      ]
    },
    "AC": {
      "name": "Access Control",
      "controls": [
        "AC-01",
        "AC-02",
        "AC-03",
        "AC-04",
        "AC-05",
        "AC-06",
        "AC-07",
        "AC-08",
        "AC-09",
        "AC-10",
        "AC-11",
        "AC-12",
        "AC-13",
        "AC-14",
        "AC-15",
        "AC-16",
        "AC-17",
        "AC-18",
        "AC-19",
        "AC-20"
      ]
    },
    "AU": {
      "name": "Audit and Accountability",
      "controls": [
        "AU-01",
        "AU-02",
        "AU-03",
        "AU-04",
        "AU-05",
        "AU-06",
        "AU-07",
        "AU-08",
        "AU-09",
        "AU-10",
        "AU-11"
      ]
    },
    "SI": {
      "name": "System and Information Integrity",
      "controls": [
        "SI-01",
        "SI-02",
        "SI-03",
        "SI-04",
        "SI-05",
        "SI-06",
        "SI-07",
        "SI-08",
        "SI-09",
        "SI-10",
        "SI-11",
        "SI-12"
      ]
    },
    "SA": {
      "name": "System and Services Acquisition",
      "controls": [
        "SA-01",
        "SA-02",
        "SA-03",
        "SA-04",
        "SA-05",
        "SA-06",
        "SA-07",
        "SA-08",
        "SA-09",
        "SA-10",
        "SA-11"
      ]
    },
    "SC": {
      "name": "System and Communications Protection",
      "controls": [
        "SC-01",
        "SC-02",
        "SC-03",
        "SC-04",
        "SC-05",
        "SC-06",
        "SC-07",
        "SC-08",
        "SC-09",
        "SC-10",
        "SC-11",
        "SC-12",
        "SC-13",
        "SC-14",
        "SC-15",
        "SC-16",
        "SC-17",
        "SC-18",
        "SC-19",
        "SC-20",
        "SC-21",
        "SC-22",
        "SC-23"
      ]
    },
    "RA": {
      "name": "Risk Assessment",
      "controls": [
        "RA-01",
        "RA-02",
        "RA-03",
        "RA-04",
        "RA-05"
      ]
    },
    "PL": {
      "name": "Planning",
      "controls": [
        "PL-01",
        "PL-02",
        "PL-03",
        "PL-04",
        "PL-05",
        "PL-06"
      ]
    },
    "PE": {
      "name": "Physical and Environmental Protection",
      "controls": [
        "PE-01",
        "PE-02",
        "PE-03",
        "PE-04",
        "PE-05",
        "PE-06",
        "PE-07",
        "PE-08",
        "PE-09",
        "PE-10",
        "PE-11",
        "PE-12",
        "PE-13",
        "PE-14",
        "PE-15",
        "PE-16",
        "PE-17",
        "PE-18",
        "PE-19"
      ]
    },
    "PS": {
      "name": "Personnel Security",
      "controls": [
        "PS-01",
        "PS-02",
        "PS-03",
        "PS-04",
        "PS-05",
        "PS-06",
        "PS-07",
        "PS-08"
      ]
    },
    "MP": {
      "name": "Media Protection",
      "controls": [
        "MP-01",
        "MP-02",
        "MP-03",
        "MP-04",
        "MP-05",
        "MP-06"
      ]
    },
    "MA": {
      "name": "Maintenance",
      "controls": [
        "MA-01",
        "MA-02",
        "MA-03",
        "MA-04",
        "MA-05",
        "MA-06"
      ]
    },
    "IR": {
      "name": "Incident Response",
      "controls": [
        "IR-01",
        "IR-02",
        "IR-03",
        "IR-04",
        "IR-05",
        "IR-06",
        "IR-07"
      ]
    },
    "CP": {
      "name": "Contingency Planning",
      "controls": [
        "CP-01",
        "CP-02",
        "CP-03",
        "CP-04",
        "CP-05",
        "CP-06",
        "CP-07",
        "CP-08",
        "CP-09",
        "CP-10"
      ]
    },
    "CM": {
      "name": "Configuration Management",
      "controls": [
        "CM-01",
        "CM-02",
        "CM-03",
        "CM-04",
        "CM-05",
        "CM-06",
        "CM-07",
        "CM-08"
      ]
    },
    "CA": {
      "name": "Security Assessment and Authorization",
      "controls": [
        "CA-01",
        "CA-02",
        "CA-03",
        "CA-04",
        "CA-05",
        "CA-06",
        "CA-07"
      ]
    },
    "AT": {
      "name": "Awareness and Training",
      "controls": [
        "AT-01",
        "AT-02",
        "AT-03",
        "AT-04",
        "AT-05"
      ]
    }
  },
  "controls": [
    {
      "id": "IA-02",
      "name": "User Identification And Authentication",
      "family": "IA",
      "family_name": "Identification and Authentication",
      "control_class": "Technical",
      "description": "The information system uniquely identifies and authenticates users (or processes acting on behalf of users).\\n",
      "supplemental_guidance": "Users are uniquely identified and authenticated for all accesses other than those accesses explicitly identified and documented by the organization in accordance security control AC-14. Authentication of user identities is accomplished through the use of passwords, tokens, biometrics, or in the case of multifactor authentication, some combination thereof. NIST Special Publication 800-63 provides guidance on remote electronic authentication including strength of authentication mechanisms. For purposes of this control, the guidance provided in Special Publication 800-63 is applied to both local and remote access to information systems. Remote access is any access to an organizational information system by a user (or an information system) communicating through an external, non-organization-controlled network (e.g., the Internet). Local access is any access to an organizational information system by a user (or an information system) communicating through an internal organization-controlled network (e.g., local area network) or directly to a device without the use of a network. Unless a more stringent control enhancement is specified, authentication for both local and remote information system access is NIST Special Publication 800-63 level 1 compliant. FIPS 201 and Special Publications 800-73, 800-76, and 800-78 specify a personal identity verification (PIV) credential for use in the unique identification and authentication of federal employees and contractors. In addition to identifying and authenticating users at the information system level (i.e., at system logon), identification and authentication mechanisms are employed at the application level, when necessary, to provide increased information security for the organization. In accordance with OMB policy and E-Authentication E-Government initiative, authentication of public users accessing federal information systems may also be required to protect nonpublic or privacy-related information. The e-authentication risk assessment conducted in accordance with OMB Memorandum 04-04 is used in determining the NIST Special Publication 800-63 compliance requirements for such accesses with regard to the IA-2 control and its enhancements. Scalability, practicality, and security issues are simultaneously considered in balancing the need to ensure ease of use for public access to such information and information systems with the need to protect organizational operations, organizational assets, and individuals. Related security controls: AC-14, AC-17.\\n",
      "enhancements": "\\n",
      "baseline_low": true,
      "baseline_moderate": true,
      "baseline_high": true,
      "iso17799": [
        "11.2.3",
        "11.4.2",
        "11.5.2"
      ],
      "cobit41": [
        "AI2.4",
        "DS5.3"
      ],
      "pci_dss_v2": [
        "8.1",
        "8.2"
      ],
      "joomla_id": 22
    },
    {
      "id": "AC-01",
      "name": "Access Control Policies and Procedures",
      "family": "AC",
      "family_name": "Access Control",
      "control_class": "Technical",
      "description": "The organization develops, disseminates, and periodically reviews/updates: (i) a formal, documented, access control policy that addresses purpose, scope, roles, responsibilities, management commitment, coordination among organizational entities, and compliance; and (ii) formal, documented procedures to facilitate the implementation of the access control policy and associated access controls.\\n",
      "supplemental_guidance": "The access control policy and procedures are consistent with applicable laws, Executive Orders, directives, policies, regulations, standards, and guidance. The access control policy can be included as part of the general information security policy for the organization. Access control procedures can be developed for the security program in general, and for a particular information system, when required. NIST Special Publication 800-12 provides guidance on security policies and procedures.\\n",
      "enhancements": "(0) None.\\n",
      "baseline_low": true,
      "baseline_moderate": true,
      "baseline_high": true,
      "iso17799": [
        "11.1.1",
        "11.4.1",
        "15.1.1"
      ],
      "cobit41": [
        "DS11.6",
        "PC5"
      ],
      "pci_dss_v2": [
        "12.3.2",
        "7.1",
        "12.5.1"
      ],
      "joomla_id": 23
    },
    {
      "id": "AC-02",
      "name": "Account Management",
      "family": "AC",
      "family_name": "Access Control",
      "control_class": "Technical",
      "description": "The organization manages information system accounts, including establishing, activating, modifying, reviewing, disabling, and removing accounts. The organization reviews information system accounts [Assignment: organization-defined frequency, at least annually].\\n",
      "supplemental_guidance": "Account management includes the identification of account types (i.e., individual, group, and system), establishment of conditions for group membership, and assignment of associated authorizations. The organization identifies authorized users of the information system and specifies access rights/privileges. The organization grants access to the information system based on: (i) a valid need-to-know/need-to-share that is determined by assigned official duties and satisfying all personnel security criteria; and (ii) intended system usage. The organization requires proper identification for requests to establish information system accounts and approves all such requests. The organization specifically authorizes and monitors the use of guest/anonymous accounts and removes, disables, or otherwise secures unnecessary accounts. Account managers are notified when information system users are terminated or transferred and associated accounts are removed, disabled, or otherwise secured. Account managers are also notified when users information system usage or need-to-know/need-to-share changes.\\n",
      "enhancements": "\\n",
      "baseline_low": true,
      "baseline_moderate": true,
      "baseline_high": true,
      "iso17799": [
        "6.2.2",
        "6.2.3",
        "8.3.3",
        "11.2.1",
        "11.2.2",
        "11.2.4",
        "11.7.2"
      ],
      "cobit41": [
        "DS5.4"
      ],
      "pci_dss_v2": [
        "7.1.3"
      ],
      "joomla_id": 24
    },
    {
      "id": "AC-03",
      "name": "Access Enforcement",
      "family": "AC",
      "family_name": "Access Control",
      "control_class": "Technical",
      "description": "The information system enforces assigned authorizations for controlling access to the system in accordance with applicable policy.\\n",
      "supplemental_guidance": "Access control policies (e.g., identity-based policies, role-based policies, rule-based policies) and associated access enforcement mechanisms (e.g., access control lists, access control matrices, cryptography) are employed by organizations to control access between users (or processes acting on behalf of users) and objects (e.g., devices, files, records, processes, programs, domains) in the information system. In addition to controlling access at the information system level, access enforcement mechanisms are employed at the application level, when necessary, to provide increased information security for the organization. Consideration is given to the implementation of a controlled, audited, and manual override of automated mechanisms in the event of emergencies or other serious events. If encryption of stored information is employed as an access enforcement mechanism, the cryptography used is FIPS 140-2 (as amended) compliant. Related security control: SC-13.\\n",
      "enhancements": "\\n",
      "baseline_low": true,
      "baseline_moderate": true,
      "baseline_high": true,
      "iso17799": [
        "11.2.4",
        "11.4.5"
      ],
      "cobit41": [
        "PO2.3",
        "AI2.4",
        "DS11.6"
      ],
      "pci_dss_v2": [
        "7.1.4"
      ],
      "joomla_id": 25
    },
    {
      "id": "AC-04",
      "name": "Information Flow Enforcement",
      "family": "AC",
      "family_name": "Access Control",
      "control_class": "Technical",
      "description": "The information system enforces assigned authorizations for controlling the flow of information within the system and between interconnected systems in accordance with applicable policy.\\n",
      "supplemental_guidance": "Information flow control regulates where information is allowed to travel within an information system and between information systems (as opposed to who is allowed to access the information) and without explicit regard to subsequent accesses to that information. A few, of many, generalized examples of possible restrictions that are better expressed as flow control than access control are: keeping export controlled information from being transmitted in the clear to the Internet, blocking outside traffic that claims to be from within the organization, and not passing any web requests to the Internet that are not from the internal web proxy. Information flow control policies and enforcement mechanisms are commonly employed by organizations to control the flow of information between designated sources and destinations (e.g., networks, individuals, devices) within information systems and between interconnected systems. Flow control is based on the characteristics of the information and/or the information path. Specific examples of flow control enforcement can be found in boundary protection devices (e.g., proxies, gateways, guards, encrypted tunnels, firewalls, and routers) that employ rule sets or establish configuration settings that restrict information system services or provide a packet filtering capability. Related security control: SC-7.\\n",
      "enhancements": "\\n",
      "baseline_low": true,
      "baseline_moderate": true,
      "baseline_high": true,
      "iso17799": [
        "10.6.2",
        "11.4.5",
        "11.4.6",
        "11.4.7"
      ],
      "cobit41": [
        "DS5.10"
      ],
      "pci_dss_v2": [
        "4.1"
      ],
      "joomla_id": 26
    },
    {
      "id": "AC-05",
      "name": "Separation Of Duties",
      "family": "AC",
      "family_name": "Access Control",
      "control_class": "Technical",
      "description": "The information system enforces separation of duties through assigned access authorizations.\\n",
      "supplemental_guidance": "The organization establishes appropriate divisions of responsibility and separates duties as needed to eliminate conflicts of interest in the responsibilities and duties of individuals. There is access control software on the information system that prevents users from having all of the necessary authority or information access to perform fraudulent activity without collusion. Examples of separation of duties include: (i) mission functions and distinct information system support functions are divided among different individuals/roles; (ii) different individuals perform information system support functions (e.g., system management, systems programming, quality assurance/testing, configuration management, and network security); and (iii) security personnel who administer access control functions do not administer audit functions.\\n",
      "enhancements": "(0) None.\\n",
      "baseline_low": true,
      "baseline_moderate": true,
      "baseline_high": true,
      "iso17799": [
        "10.1.3",
        "10.6.1",
        "10.10.1"
      ],
      "cobit41": [
        "PO4.11"
      ],
      "pci_dss_v2": [
        "7.1.2"
      ],
      "joomla_id": 27
    },
    {
      "id": "AC-06",
      "name": "Least Privilege",
      "family": "AC",
      "family_name": "Access Control",
      "control_class": "Technical",
      "description": "The information system enforces the most restrictive set of rights/privileges or accesses needed by users (or processes acting on behalf of users) for the performance of specified tasks.\\n",
      "supplemental_guidance": "The organization employs the concept of least privilege for specific duties and information systems (including specific ports, protocols, and services) in accordance with risk assessments as necessary to adequately mitigate risk to organizational operations, organizational assets, and individuals.\\n",
      "enhancements": "(0) None.\\n",
      "baseline_low": true,
      "baseline_moderate": true,
      "baseline_high": true,
      "iso17799": [
        "11.2.2"
      ],
      "cobit41": [
        "PO4.11"
      ],
      "pci_dss_v2": [
        "7.1.1"
      ],
      "joomla_id": 28
    },
    {
      "id": "AC-07",
      "name": "Unsuccessful Login Attempts",
      "family": "AC",
      "family_name": "Access Control",
      "control_class": "Technical",
      "description": "The information system enforces a limit of [Assignment: organization-defined number] consecutive invalid access attempts by a user during a [Assignment: organization-defined time period] time period. The information system automatically [Selection: locks the account/node for an [Assignment: organization-defined time period], delays next login prompt according to [Assignment: organization-defined delay algorithm.]] when the maximum number of unsuccessful attempts is exceeded.\\n",
      "supplemental_guidance": "Due to the potential for denial of service, automatic lockouts initiated by the information system are usually temporary and automatically release after a predetermined time period established by the organization.\\n",
      "enhancements": "(1) The information system automatically locks the account/node until released by an administrator when the maximum number of unsuccessful attempts is exceeded.\\n",
      "baseline_low": true,
      "baseline_moderate": true,
      "baseline_high": true,
      "iso17799": [
        "11.5.1"
      ],
      "cobit41": [
        "None."
      ],
      "pci_dss_v2": [
        "8.5.13"
      ],
      "joomla_id": 29
    },
    {
      "id": "AC-08",
      "name": "System Use Notification",
      "family": "AC",
      "family_name": "Access Control",
      "control_class": "Technical",
      "description": "The information system displays an approved, system use notification message before granting system access informing potential users: (i) that the user is accessing a U.S. Government information system; (ii) that system usage may be monitored, recorded, and subject to audit; (iii) that unauthorized use of the system is prohibited and subject to criminal and civil penalties; and (iv) that use of the system indicates consent to monitoring and recording. The system use notification message provides appropriate privacy and security notices (based on associated privacy and security policies or summaries) and remains on the screen until the user takes explicit actions to log on to the information system.\\n",
      "supplemental_guidance": "Privacy and security policies are consistent with applicable laws, Executive Orders, directives, policies, regulations, standards, and guidance. System use notification messages can be implemented in the form of warning banners displayed when individuals log in to the information system. For publicly accessible systems: (i) the system use information is available and when appropriate, is displayed before granting access; (ii) any references to monitoring, recording, or auditing are in keeping with privacy accommodations for such systems that generally prohibit those activities; and (iii) the notice given to public users of the information system includes a description of the authorized uses of the system.\\n",
      "enhancements": "(0) None.\\n",
      "baseline_low": true,
      "baseline_moderate": true,
      "baseline_high": true,
      "iso17799": [
        "11.5.1",
        "15.1.5"
      ],
      "cobit41": [
        "None."
      ],
      "pci_dss_v2": [
        "8.5.7"
      ],
      "joomla_id": 30
    },
    {
      "id": "AC-09",
      "name": "Previous Logon Notification",
      "family": "AC",
      "family_name": "Access Control",
      "control_class": "Technical",
      "description": "The information system notifies the user, upon successful logon, of the date and time of the last logon, and the number of unsuccessful logon attempts since the last successful logon.\\n",
      "supplemental_guidance": "None.\\n",
      "enhancements": "(0) None.\\n",
      "baseline_low": true,
      "baseline_moderate": true,
      "baseline_high": true,
      "iso17799": [
        "11.5.1"
      ],
      "cobit41": [
        "None."
      ],
      "pci_dss_v2": [
        "None."
      ],
      "joomla_id": 31
    },
    {
      "id": "AC-10",
      "name": "Concurrent Session Control",
      "family": "AC",
      "family_name": "Access Control",
      "control_class": "Technical",
      "description": "The information system limits the number of concurrent sessions for any user to [Assignment: organization-defined number of sessions].\\n",
      "supplemental_guidance": "None.\\n",
      "enhancements": "(0) None.\\n",
      "baseline_low": true,
      "baseline_moderate": true,
      "baseline_high": true,
      "iso17799": [
        "None."
      ],
      "cobit41": [
        "AC6"
      ],
      "pci_dss_v2": [
        "None."
      ],
      "joomla_id": 32
    },
    {
      "id": "AC-11",
      "name": "Session Lock",
      "family": "AC",
      "family_name": "Access Control",
      "control_class": "Technical",
      "description": "The information system prevents further access to the system by initiating a session lock after [Assignment: organization-defined time period] of inactivity, and the session lock remains in effect until the user reestablishes access using appropriate identification and authentication procedures.\\n",
      "supplemental_guidance": "Users can directly initiate session lock mechanisms. A session lock is not a substitute for logging out of the information system. Organization-defined time periods of inactivity comply with federal policy; for example, in accordance with OMB Memorandum 06-16, the organization-defined time period is no greater than thirty minutes for remote access and portable devices.\\n",
      "enhancements": "(0) None.\\n",
      "baseline_low": true,
      "baseline_moderate": true,
      "baseline_high": true,
      "iso17799": [
        "11.3.2"
      ],
      "cobit41": [
        "None."
      ],
      "pci_dss_v2": [
        "8.5.14"
      ],
      "joomla_id": 33
    },
    {
      "id": "AC-12",
      "name": "Session Termination",
      "family": "AC",
      "family_name": "Access Control",
      "control_class": "Technical",
      "description": "The information system automatically terminates a remote session after [Assignment: organization-defined time period] of inactivity.\\n",
      "supplemental_guidance": "A remote session is initiated whenever an organizational information system is accessed by a user (or an information system) communicating through an external, non- organization-controlled network (e.g., the Internet).\\n",
      "enhancements": "(1) Automatic session termination applies to local and remote sessions.\\n",
      "baseline_low": true,
      "baseline_moderate": true,
      "baseline_high": true,
      "iso17799": [
        "11.3.2",
        "11.5.5"
      ],
      "cobit41": [
        "None."
      ],
      "pci_dss_v2": [
        "8.5.15"
      ],
      "joomla_id": 34
    },
    {
      "id": "AC-13",
      "name": "Supervision And Review -- Access Control ",
      "family": "AC",
      "family_name": "Access Control",
      "control_class": "Technical",
      "description": "The organization supervises and reviews the activities of users with respect to the enforcement and usage of information system access controls.\\n",
      "supplemental_guidance": "The organization reviews audit records (e.g., user activity logs) for inappropriate activities in accordance with organizational procedures. The organization investigates any unusual information system-related activities and periodically reviews changes to access authorizations. The organization reviews more frequently the activities of users with significant information system roles and responsibilities. The extent of the audit record reviews is based on the FIPS 199 impact level of the information system. For example, for low-impact systems, it is not intended that security logs be reviewed frequently for every workstation, but rather at central points such as a web proxy or email servers and when specific circumstances warrant review of other audit records. NIST Special Publication 800-92 provides guidance on computer security log management.\\n",
      "enhancements": "(1) The organization employs automated mechanisms to facilitate the review of user activities.\\n",
      "baseline_low": true,
      "baseline_moderate": true,
      "baseline_high": true,
      "iso17799": [
        "10.10.2",
        "11.2.4"
      ],
      "cobit41": [
        "PO4.10"
      ],
      "pci_dss_v2": [
        "8.5.1"
      ],
      "joomla_id": 35
    },
    {
      "id": "AU-01",
      "name": "Audit And Accountability Policy And Procedures",
      "family": "AU",
      "family_name": "Audit and Accountability",
      "control_class": "Technical",
      "description": "The organization develops, disseminates, and periodically reviews/updates: (i) a formal, documented, audit and accountability policy that addresses purpose, scope, roles, responsibilities, management commitment, coordination among organizational entities, and compliance; and (ii) formal, documented procedures to facilitate the implementation of the audit and accountability policy and associated audit and accountability controls.\\n",
      "supplemental_guidance": "The audit and accountability policy and procedures are consistent with applicable laws, Executive Orders, directives, policies, regulations, standards, and guidance. The audit and accountability policy can be included as part of the general information security policy for the organization. Audit and accountability procedures can be developed for the security program in general, and for a particular information system, when required. NIST Special Publication 800-12 provides guidance on security policies and procedures.\\n",
      "enhancements": "(0) None.\\n",
      "baseline_low": true,
      "baseline_moderate": true,
      "baseline_high": true,
      "iso17799": [
        "10.10",
        "15.1.1"
      ],
      "cobit41": [
        "PC2",
        "PC5"
      ],
      "pci_dss_v2": [
        "10.1",
        "12.5.1"
      ],
      "joomla_id": 36
    },
    {
      "id": "AU-02",
      "name": "Auditable Events",
      "family": "AU",
      "family_name": "Audit and Accountability",
      "control_class": "Technical",
      "description": "The information system generates audit records for the following events: [Assignment: organization-defined auditable events].\\n",
      "supplemental_guidance": "The purpose of this control is to identify important events which need to be audited as significant and relevant to the security of the information system. The organization specifies which information system components carry out auditing activities. Auditing activity can affect information system performance. Therefore, the organization decides, based upon a risk assessment, which events require auditing on a continuous basis and which events require auditing in response to specific situations. Audit records can be generated at various levels of abstraction, including at the packet level as information traverses the network. Selecting the right level of abstraction for audit record generation is a critical aspect of an audit capability and can facilitate the identification of root causes to problems. Additionally, the security audit function is coordinated with the network health and status monitoring function to enhance the mutual support between the two functions by the selection of information to be recorded by each function. The checklists and configuration guides at http://csrc.nist.gov/pcig/cig.html provide recommended lists of auditable events. The organization defines auditable events that are adequate to support after- the-fact investigations of security incidents. NIST Special Publication 800-92 provides guidance on computer security log management.\\n",
      "enhancements": "\\n",
      "baseline_low": true,
      "baseline_moderate": true,
      "baseline_high": true,
      "iso17799": [
        "10.10.1"
      ],
      "cobit41": [
        "AI2.3"
      ],
      "pci_dss_v2": [
        "10.2"
      ],
      "joomla_id": 37
    },
    {
      "id": "AC-14",
      "name": "Permitted Actions Without Identification Or Authentication",
      "family": "AC",
      "family_name": "Access Control",
      "control_class": "Technical",
      "description": "The organization identifies and documents specific user actions that can be performed on the information system without identification or authentication.\\n",
      "supplemental_guidance": "The organization allows limited user activity without identification and authentication for public websites or other publicly available information systems (e.g., individuals accessing a federal information system at http://www.firstgov.gov). Related security control: IA-2.\\n",
      "enhancements": "(1) The organization permits actions to be performed without identification and authentication only to the extent necessary to accomplish mission objectives.\\n",
      "baseline_low": true,
      "baseline_moderate": true,
      "baseline_high": true,
      "iso17799": [
        "None."
      ],
      "cobit41": [
        "None."
      ],
      "pci_dss_v2": [
        "None."
      ],
      "joomla_id": 38
    },
    {
      "id": "SI-01",
      "name": "System And Information Integrity Policy And Procedures",
      "family": "SI",
      "family_name": "System and Information Integrity",
      "control_class": "Operational",
      "description": "The organization develops, disseminates, and periodically reviews/updates: (i) a formal, documented, system and information integrity policy that addresses purpose, scope, roles, responsibilities, management commitment, coordination among organizational entities, and compliance; and (ii) formal, documented procedures to facilitate the implementation of the system and information integrity policy and associated system and information integrity controls.\\n",
      "supplemental_guidance": "The system and information integrity policy and procedures are consistent with applicable laws, Executive Orders, directives, policies, regulations, standards, and guidance. The system and information integrity policy can be included as part of the general information security policy for the organization. System and information integrity procedures can be developed for the security program in general, and for a particular information system, when required. NIST Special Publication 800-12 provides guidance on security policies and procedures.\\n",
      "enhancements": "(0) None.\\n",
      "baseline_low": true,
      "baseline_moderate": true,
      "baseline_high": true,
      "iso17799": [
        "15.1.1"
      ],
      "cobit41": [
        "PO2.4",
        "PC5"
      ],
      "pci_dss_v2": [
        "12.5.1"
      ],
      "joomla_id": 39
    },
    {
      "id": "SI-02",
      "name": "Flaw Remediation",
      "family": "SI",
      "family_name": "System and Information Integrity",
      "control_class": "Operational",
      "description": "The organization identifies, reports, and corrects information system flaws.\\n",
      "supplemental_guidance": "The organization identifies information systems containing software affected by recently announced software flaws (and potential vulnerabilities resulting from those flaws). The organization (or the software developer/vendor in the case of software developed and maintained by a vendor/contractor) promptly installs newly released security relevant patches, service packs, and hot fixes, and tests patches, service packs, and hot fixes for effectiveness and potential side effects on the organizationâ€™s information systems before installation. Flaws discovered during security assessments, continuous monitoring, incident response activities, or information system error handling are also addressed expeditiously. Flaw remediation is incorporated into configuration management as an emergency change. NIST Special Publication 800-40, provides guidance on security patch installation and patch management. Related security controls: CA-2, CA-4, CA-7, CM-3, IR-4, SI-11.\\n",
      "enhancements": "\\n",
      "baseline_low": true,
      "baseline_moderate": true,
      "baseline_high": true,
      "iso17799": [
        "10.10.5",
        "12.4.1",
        "12.5.1",
        "12.5.2",
        "12.6.1"
      ],
      "cobit41": [
        "None."
      ],
      "pci_dss_v2": [
        "6.1",
        "6.2",
        "11.2",
        "11.3"
      ],
      "joomla_id": 40
    },
    {
      "id": "SI-03",
      "name": "Malicious Code Protection",
      "family": "SI",
      "family_name": "System and Information Integrity",
      "control_class": "Operational",
      "description": "The information system implements malicious code protection.\\n",
      "supplemental_guidance": "The organization employs malicious code protection mechanisms at critical information system entry and exit points (e.g., firewalls, electronic mail servers, web servers, proxy servers, remote-access servers) and at workstations, servers, or mobile computing devices on the network. The organization uses the malicious code protection mechanisms to detect and eradicate malicious code (e.g., viruses, worms, Trojan horses, spyware) transported: (i) by electronic mail, electronic mail attachments, Internet accesses, removable media (e.g., USB devices, diskettes or compact disks), or other common means; or (ii) by exploiting information system vulnerabilities. The organization updates malicious code protection mechanisms (including the latest virus definitions) whenever new releases are available in accordance with organizational configuration management policy and procedures. The organization considers using malicious code protection software products from multiple vendors (e.g., using one vendor for boundary devices and servers and another vendor for workstations). The organization also considers the receipt of false positives during malicious code detection and eradication and the resulting potential impact on the availability of the information system. NIST Special Publication 800-83 provides guidance on implementing malicious code protection.\\n",
      "enhancements": "\\n",
      "baseline_low": true,
      "baseline_moderate": true,
      "baseline_high": true,
      "iso17799": [
        "10.4.1"
      ],
      "cobit41": [
        "DS5.9"
      ],
      "pci_dss_v2": [
        "5.1",
        "5.1.1",
        "5.2"
      ],
      "joomla_id": 41
    },
    {
      "id": "SI-04",
      "name": "Information System Monitoring Tools And Techniques",
      "family": "SI",
      "family_name": "System and Information Integrity",
      "control_class": "Operational",
      "description": "The organization employs tools and techniques to monitor events on the information system, detect attacks, and provide identification of unauthorized use of the system.\\n",
      "supplemental_guidance": "Information system monitoring capability is achieved through a variety of tools and techniques (e.g., intrusion detection systems, intrusion prevention systems, malicious code protection software, audit record monitoring software, network monitoring software). Monitoring devices are strategically deployed within the information system (e.g., at selected perimeter locations, near server farms supporting critical applications) to collect essential information. Monitoring devices are also deployed at ad hoc locations within the system to track specific transactions. Additionally, these devices are used to track the impact of security changes to the information system. The granularity of the information collected is determined by the organization based upon its monitoring objectives and the capability of the information system to support such activities. Organizations consult appropriate legal counsel with regard to all information system monitoring activities. Organizations heighten the level of information system monitoring activity whenever there is an indication of increased risk to organizational operations, organizational assets, or individuals based on law enforcement information, intelligence information, or other credible sources of information. NIST Special Publication 800-61 provides guidance on detecting attacks through various types of security technologies. NIST Special Publication 800-83 provides guidance on detecting malware-based attacks through malicious code protection software. NIST Special Publication 800-92 provides guidance on monitoring and analyzing computer security event logs. NIST Special Publication 800-94 provides guidance on intrusion detection and prevention. Related security control: AC-8.\\n",
      "enhancements": "\\n",
      "baseline_low": true,
      "baseline_moderate": true,
      "baseline_high": true,
      "iso17799": [
        "10.6.2",
        "10.10.1",
        "10.10.2",
        "10.10.4"
      ],
      "cobit41": [
        "PO2.4",
        "DS5.5",
        "DS5.10"
      ],
      "pci_dss_v2": [
        "11.4",
        "11.5",
        "10.5.5",
        "11.1"
      ],
      "joomla_id": 42
    },
    {
      "id": "SI-05",
      "name": "Security Alerts And Advisories",
      "family": "SI",
      "family_name": "System and Information Integrity",
      "control_class": "Operational",
      "description": "The organization receives information system security alerts/advisories on a regular basis, issues alerts/advisories to appropriate personnel, and takes appropriate actions in response.\\n",
      "supplemental_guidance": "The organization documents the types of actions to be taken in response to security alerts/advisories. The organization also maintains contact with special interest groups (e.g., information security forums) that: (i) facilitate sharing of security-related information (e.g., threats, vulnerabilities, and latest security technologies); (ii) provide access to advice from security professionals; and (iii) improve knowledge of security best practices. NIST Special Publication 800-40 provides guidance on monitoring and distributing security alerts and advisories.\\n",
      "enhancements": "(1) The organization employs automated mechanisms to make security alert and advisory information available throughout the organization as needed.\\n",
      "baseline_low": true,
      "baseline_moderate": true,
      "baseline_high": true,
      "iso17799": [
        "6.1.7",
        "10.4.1"
      ],
      "cobit41": [
        "None."
      ],
      "pci_dss_v2": [
        "12.9.6"
      ],
      "joomla_id": 43
    },
    {
      "id": "SI-06",
      "name": "Security Functionality Verification",
      "family": "SI",
      "family_name": "System and Information Integrity",
      "control_class": "Operational",
      "description": "The information system verifies the correct operation of security functions [Selection (one or more): upon system startup and restart, upon command by user with appropriate privilege, periodically every [Assignment: organization-defined time-period]] and [Selection (one or more): notifies system administrator, shuts the system down, restarts the system] when anomalies are discovered.\\n",
      "supplemental_guidance": "The need to verify security functionality applies to all security functions. For those security functions that are not able to execute automated self-tests, the organization either implements compensating security controls or explicitly accepts the risk of not performing the verification as required.\\n",
      "enhancements": "\\n",
      "baseline_low": true,
      "baseline_moderate": true,
      "baseline_high": true,
      "iso17799": [
        "None."
      ],
      "cobit41": [
        "None."
      ],
      "pci_dss_v2": [
        "None."
      ],
      "joomla_id": 44
    },
    {
      "id": "SI-07",
      "name": "Software And Information Integrity",
      "family": "SI",
      "family_name": "System and Information Integrity",
      "control_class": "Operational",
      "description": "The information system detects and protects against unauthorized changes to software and information.\\n",
      "supplemental_guidance": "The organization employs integrity verification applications on the information system to look for evidence of information tampering, errors, and omissions. The organization employs good software engineering practices with regard to commercial off-the-shelf integrity mechanisms (e.g., parity checks, cyclical redundancy checks, cryptographic hashes) and uses tools to automatically monitor the integrity of the information system and the applications it hosts.\\n",
      "enhancements": "\\n",
      "baseline_low": true,
      "baseline_moderate": true,
      "baseline_high": true,
      "iso17799": [
        "12.2.1",
        "12.2.2",
        "12.2.4"
      ],
      "cobit41": [
        "PO2.4",
        "AI2.4",
        "DS5.9"
      ],
      "pci_dss_v2": [
        "11.5"
      ],
      "joomla_id": 45
    },
    {
      "id": "SI-08",
      "name": "Spam Protection",
      "family": "SI",
      "family_name": "System and Information Integrity",
      "control_class": "Operational",
      "description": "The information system implements spam protection.\\n",
      "supplemental_guidance": "The organization employs spam protection mechanisms at critical information system entry points (e.g., firewalls, electronic mail servers, remote-access servers) and at workstations, servers, or mobile computing devices on the network. The organization uses the spam protection mechanisms to detect and take appropriate action on unsolicited messages transported by electronic mail, electronic mail attachments, Internet accesses, or other common means. Consideration is given to using spam protection software products from multiple vendors (e.g., using one vendor for boundary devices and servers and another vendor for workstations). NIST Special Publication 800-45 provides guidance on electronic mail security.\\n",
      "enhancements": "\\n",
      "baseline_low": true,
      "baseline_moderate": true,
      "baseline_high": true,
      "iso17799": [
        "None."
      ],
      "cobit41": [
        "DS5.9"
      ],
      "pci_dss_v2": [
        "None."
      ],
      "joomla_id": 46
    },
    {
      "id": "SI-09",
      "name": "Information Input Restrictions",
      "family": "SI",
      "family_name": "System and Information Integrity",
      "control_class": "Operational",
      "description": "The organization restricts the capability to input information to the information system to authorized personnel.\\n",
      "supplemental_guidance": "Restrictions on personnel authorized to input information to the information system may extend beyond the typical access controls employed by the system and include limitations based on specific operational/project responsibilities.\\n",
      "enhancements": "(0) None.\\n",
      "baseline_low": true,
      "baseline_moderate": true,
      "baseline_high": true,
      "iso17799": [
        "12.2.1",
        "12.2.2"
      ],
      "cobit41": [
        "AC1",
        "AC2"
      ],
      "pci_dss_v2": [
        "None."
      ],
      "joomla_id": 47
    },
    {
      "id": "SI-10",
      "name": "Information Accuracy, Completeness, Validity, And Authenticity",
      "family": "SI",
      "family_name": "System and Information Integrity",
      "control_class": "Operational",
      "description": "The information system checks information for accuracy, completeness, validity, and authenticity.\\n",
      "supplemental_guidance": "Checks for accuracy, completeness, validity, and authenticity of information are accomplished as close to the point of origin as possible. Rules for checking the valid syntax of information system inputs (e.g., character set, length, numerical range, acceptable values) are in place to verify that inputs match specified definitions for format and content. Inputs passed to interpreters are prescreened to prevent the content from being unintentionally interpreted as commands. The extent to which the information system is able to check the accuracy, completeness, validity, and authenticity of information is guided by organizational policy and operational requirements.\\n",
      "enhancements": "(0) None.\\n",
      "baseline_low": true,
      "baseline_moderate": true,
      "baseline_high": true,
      "iso17799": [
        "10.7.3",
        "12.2.1",
        "12.2.2"
      ],
      "cobit41": [
        "PO2.4",
        "AI2.3",
        "AI2.4",
        "DS11.1",
        "DS11.6",
        "AC3",
        "AC4",
        "AC6"
      ],
      "pci_dss_v2": [
        "None."
      ],
      "joomla_id": 48
    },
    {
      "id": "SI-11",
      "name": "Error Handling",
      "family": "SI",
      "family_name": "System and Information Integrity",
      "control_class": "Operational",
      "description": "The information system identifies and handles error conditions in an expeditious manner without providing information that could be exploited by adversaries.\\n",
      "supplemental_guidance": "The structure and content of error messages are carefully considered by the organization. Error messages are revealed only to authorized personnel. Error messages generated by the information system provide timely and useful information without revealing potentially harmful information that could be used by adversaries. Sensitive information (e.g., account numbers, social security numbers, and credit card numbers) are not listed in error logs or associated administrative messages. The extent to which the information system is able to identify and handle error conditions is guided by organizational policy and operational requirements.\\n",
      "enhancements": "(0) None.\\n",
      "baseline_low": true,
      "baseline_moderate": true,
      "baseline_high": true,
      "iso17799": [
        "12.2.1",
        "12.2.2",
        "12.2.3",
        "12.2.4"
      ],
      "cobit41": [
        "AC5"
      ],
      "pci_dss_v2": [
        "None."
      ],
      "joomla_id": 49
    },
    {
      "id": "SI-12",
      "name": "Information Output Handling And Retention",
      "family": "SI",
      "family_name": "System and Information Integrity",
      "control_class": "Operational",
      "description": "The organization handles and retains output from the information system in accordance with applicable laws, Executive Orders, directives, policies, regulations, standards, and operational requirements.\\n",
      "supplemental_guidance": "None.\\n",
      "enhancements": "(0) None.\\n",
      "baseline_low": true,
      "baseline_moderate": true,
      "baseline_high": true,
      "iso17799": [
        "10.7.3",
        "12.2.4"
      ],
      "cobit41": [
        "DS11.1",
        "DS11.6",
        "AC5"
      ],
      "pci_dss_v2": [
        "3.1.1"
      ],
      "joomla_id": 50
    },
    {
      "id": "SA-01",
      "name": "System And Services Acquisition Policy And Procedures",
      "family": "SA",
      "family_name": "System and Services Acquisition",
      "control_class": "Management",
      "description": "The organization develops, disseminates, and periodically reviews/updates: (i) a formal, documented, system and services acquisition policy that includes information security considerations and that addresses purpose, scope, roles, responsibilities, management commitment, coordination among organizational entities, and compliance; and (ii) formal, documented procedures to facilitate the implementation of the system and services acquisition policy and associated system and services acquisition controls.\\n",
      "supplemental_guidance": "The system and services acquisition policy and procedures are consistent with applicable laws, Executive Orders, directives, policies, regulations, standards, and guidance. The system and services acquisition policy can be included as part of the general information security policy for the organization. System and services acquisition procedures can be developed for the security program in general, and for a particular information system, when required. NIST Special Publication 800-12 provides guidance on security policies and procedures.\\n",
      "enhancements": "(0) None.\\n",
      "baseline_low": true,
      "baseline_moderate": true,
      "baseline_high": true,
      "iso17799": [
        "12.1",
        "15.1.1"
      ],
      "cobit41": [
        "AI2.5",
        "AI5.1",
        "PC5"
      ],
      "pci_dss_v2": [
        "12.5.1"
      ],
      "joomla_id": 51
    },
    {
      "id": "SA-02",
      "name": "Allocation Of Resources",
      "family": "SA",
      "family_name": "System and Services Acquisition",
      "control_class": "Management",
      "description": "The organization determines, documents, and allocates as part of its capital planning and investment control process, the resources required to adequately protect the information system.\\n",
      "supplemental_guidance": "The organization includes the determination of security requirements for the information system in mission/business case planning and establishes a discrete line item for information system security in the organizationâ€™s programming and budgeting documentation. NIST Special Publication 800-65 provides guidance on integrating security into the capital planning and investment control process.\\n",
      "enhancements": "(0) None.\\n",
      "baseline_low": true,
      "baseline_moderate": true,
      "baseline_high": true,
      "iso17799": [
        "10.3.1"
      ],
      "cobit41": [
        "PO1.1",
        "PO5.2"
      ],
      "pci_dss_v2": [
        "None."
      ],
      "joomla_id": 52
    },
    {
      "id": "SA-03",
      "name": "Life Cycle Support",
      "family": "SA",
      "family_name": "System and Services Acquisition",
      "control_class": "Management",
      "description": "The organization manages the information system using a system development life cycle methodology that includes information security considerations.\\n",
      "supplemental_guidance": "NIST Special Publication 800-64 provides guidance on security considerations in the system development life cycle.\\n",
      "enhancements": "(0) None.\\n",
      "baseline_low": true,
      "baseline_moderate": true,
      "baseline_high": true,
      "iso17799": [
        "None."
      ],
      "cobit41": [
        "PO8.3",
        "AI2.7"
      ],
      "pci_dss_v2": [
        "6.3"
      ],
      "joomla_id": 53
    },
    {
      "id": "SA-04",
      "name": "Acquisitions",
      "family": "SA",
      "family_name": "System and Services Acquisition",
      "control_class": "Management",
      "description": "The organization includes security requirements and/or security specifications, either explicitly or by reference, in information system acquisition contracts based on an assessment of risk and in accordance with applicable laws, Executive Orders, directives, policies, regulations, and standards.\\n",
      "supplemental_guidance": "(1) Solicitation Documents; The solicitation documents (e.g., Requests for Proposals) for information systems and services include, either explicitly or by reference, security requirements that describe: (i) required security capabilities (security needs and, as necessary, specific security controls and other specific FISMA requirements); (ii) required design and development processes; (iii) required test and evaluation procedures; and (iv) required documentation. The requirements in the solicitation documents permit updating security controls as new threats/vulnerabilities are identified and as new technologies are implemented. NIST Special Publication 800-36 provides guidance on the selection of information security products. NIST Special Publication 800-35 provides guidance on information technology security services. NIST Special Publication 800-64 provides guidance on security considerations in the system development life cycle. (2) Information System Documentation; The solicitation documents include requirements for appropriate information system documentation. The documentation addresses user and systems administrator guidance and information regarding the implementation of the security controls in the information system. The level of detail required in the documentation is based on the FIPS 199 security category for the information system. (3) Use of Tested, Evaluated, and Validated Products; NIST Special Publication 800-23 provides guidance on the acquisition and use of tested/evaluated information technology products. (4) Configuration Settings and Implementation Guidance; The information system required documentation includes security configuration settings and security implementation guidance. OMB FISMA reporting instructions provide guidance on configuration requirements for federal information systems. NIST Special Publication 800-70 provides guidance on configuration settings for information technology products.\\n",
      "enhancements": "\\n",
      "baseline_low": true,
      "baseline_moderate": true,
      "baseline_high": true,
      "iso17799": [
        "12.1.1"
      ],
      "cobit41": [
        "AI2.4",
        "AI5.4"
      ],
      "pci_dss_v2": [
        "None."
      ],
      "joomla_id": 54
    },
    {
      "id": "SA-05",
      "name": "Information System Documentation",
      "family": "SA",
      "family_name": "System and Services Acquisition",
      "control_class": "Management",
      "description": "The organization obtains, protects as required, and makes available to authorized personnel, adequate documentation for the information system.\\n",
      "supplemental_guidance": "Documentation includes administrator and user guides with information on: (i) configuring, installing, and operating the information system; and (ii) effectively using the systemâ€™s security features. When adequate information system documentation is either unavailable or non existent (e.g., due to the age of the system or lack of support from the vendor/manufacturer), the organization documents attempts to obtain such documentation and provides compensating security controls, if needed.\\n",
      "enhancements": "\\n",
      "baseline_low": true,
      "baseline_moderate": true,
      "baseline_high": true,
      "iso17799": [
        "10.7.4"
      ],
      "cobit41": [
        "DS5.7"
      ],
      "pci_dss_v2": [
        "None."
      ],
      "joomla_id": 55
    },
    {
      "id": "SA-06",
      "name": "Software Usage Restrictions",
      "family": "SA",
      "family_name": "System and Services Acquisition",
      "control_class": "Management",
      "description": "The organization complies with software usage restrictions.\\n",
      "supplemental_guidance": "Software and associated documentation are used in accordance with contract agreements and copyright laws. For software and associated documentation protected by quantity licenses, the organization employs tracking systems to control copying and distribution. The organization controls and documents the use of publicly accessible peer-to-peer file sharing technology to ensure that this capability is not used for the unauthorized distribution, display, performance, or reproduction of copyrighted work.\\n",
      "enhancements": "(0) None.\\n",
      "baseline_low": true,
      "baseline_moderate": true,
      "baseline_high": true,
      "iso17799": [
        "15.1.2"
      ],
      "cobit41": [
        "DS9.3"
      ],
      "pci_dss_v2": [
        "None."
      ],
      "joomla_id": 56
    },
    {
      "id": "SA-07",
      "name": "User Installed Software",
      "family": "SA",
      "family_name": "System and Services Acquisition",
      "control_class": "Management",
      "description": "The organization enforces explicit rules governing the installation of software by users.\\n",
      "supplemental_guidance": "If provided the necessary privileges, users have the ability to install software. The organization identifies what types of software installations are permitted (e.g., updates and security patches to existing software) and what types of installations are prohibited (e.g., software that is free only for personal, not government use, and software whose pedigree with regard to being potentially malicious is unknown or suspect).\\n",
      "enhancements": "(0) None.\\n",
      "baseline_low": true,
      "baseline_moderate": true,
      "baseline_high": true,
      "iso17799": [
        "15.1.2"
      ],
      "cobit41": [
        "DS9.3"
      ],
      "pci_dss_v2": [
        "12.3.7"
      ],
      "joomla_id": 57
    },
    {
      "id": "SA-08",
      "name": "Security Engineering Principles",
      "family": "SA",
      "family_name": "System and Services Acquisition",
      "control_class": "Management",
      "description": "The organization designs and implements the information system using security engineering principles.\\n",
      "supplemental_guidance": "NIST Special Publication 800-27 provides guidance on engineering principles for information system security. The application of security engineering principles is primarily targeted at new development information systems or systems undergoing major upgrades and is integrated into the system development life cycle. For legacy information systems, the organization applies security engineering principles to system upgrades and modifications, to the extent feasible, given the current state of the hardware, software, and firmware components within the system.\\n",
      "enhancements": "(0) None.\\n",
      "baseline_low": true,
      "baseline_moderate": true,
      "baseline_high": true,
      "iso17799": [
        "12.1"
      ],
      "cobit41": [
        "AI2.4"
      ],
      "pci_dss_v2": [
        "6.3"
      ],
      "joomla_id": 58
    },
    {
      "id": "SA-09",
      "name": "External Information System Services",
      "family": "SA",
      "family_name": "System and Services Acquisition",
      "control_class": "Management",
      "description": "The organization: (i) requires that providers of external information system services employ adequate security controls in accordance with applicable laws, Executive Orders, directives, policies, regulations, standards, guidance, and established service-level agreements; and (ii) monitors security control compliance.\\n",
      "supplemental_guidance": "An external information system service is a service that is implemented outside of the accreditation boundary of the organizational information system (i.e., a service that is used by, but not a part of, the organizational information system). Relationships with external service providers are established in a variety of ways, for example, through joint ventures, business partnerships, outsourcing arrangements (i.e., through contracts, interagency agreements, lines of business arrangements), licensing agreements, and/or supply chain exchanges. Ultimately, the responsibility for adequately mitigating risks to the organizationâ€™s operations and assets, and to individuals, arising from the use of external information system services remains with the authorizing official. Authorizing officials must require that an appropriate chain of trust be established with external service providers when dealing with the many issues associated with information system security. For services external to the organization, a chain of trust requires that the organization establish and retain a level of confidence that each participating service provider in the potentially complex consumer-provider relationship provides adequate protection for the services rendered to the organization. Where a sufficient level of trust cannot be established in the external services and/or service providers, the organization employs compensating security controls or accepts the greater degree of risk to its operations and assets, or to individuals. The external information system services documentation includes government, service provider, and end user security roles and responsibilities, and any service-level agreements. Service-level agreements define the expectations of performance for each required security control, describe measurable outcomes, and identify remedies and response requirements for any identified instance of non-compliance. NIST Special Publication 800-35 provides guidance on information technology security services. NIST Special Publication 800-64 provides guidance on the security considerations in the system development life cycle.\\n",
      "enhancements": "(0) None.\\n",
      "baseline_low": true,
      "baseline_moderate": true,
      "baseline_high": true,
      "iso17799": [
        "6.2.1",
        "6.2.3",
        "10.2.1",
        "10.2.2",
        "10.6.2"
      ],
      "cobit41": [
        "DS1.6",
        "DS2.3",
        "ME3.1",
        "ME3.3"
      ],
      "pci_dss_v2": [
        "12.8.2"
      ],
      "joomla_id": 59
    },
    {
      "id": "SA-10",
      "name": "Developer Configuration Management",
      "family": "SA",
      "family_name": "System and Services Acquisition",
      "control_class": "Management",
      "description": "The organization requires that information system developers create and implement a configuration management plan that controls changes to the system during development, tracks security flaws, requires authorization of changes, and provides documentation of the plan and its implementation.\\n",
      "supplemental_guidance": "This control also applies to the development actions associated with information system changes.\\n",
      "enhancements": "(0) None.\\n",
      "baseline_low": true,
      "baseline_moderate": true,
      "baseline_high": true,
      "iso17799": [
        "12.5.1",
        "12.5.2"
      ],
      "cobit41": [
        "None."
      ],
      "pci_dss_v2": [
        "6.4.5"
      ],
      "joomla_id": 60
    },
    {
      "id": "SC-01",
      "name": "System And Communications Protection Policy And Procedures",
      "family": "SC",
      "family_name": "System and Communications Protection",
      "control_class": "Technical",
      "description": "The organization develops, disseminates, and periodically reviews/updates: (i) a formal, documented, system and communications protection policy that addresses purpose, scope, roles, responsibilities, management commitment, coordination among organizational entities, and compliance; and (ii) formal, documented procedures to facilitate the implementation of the system and communications protection policy and associated system and communications protection controls.\\n",
      "supplemental_guidance": "The system and communications protection policy and procedures are consistent with applicable laws, Executive Orders, directives, policies, regulations, standards, and guidance. The system and communications protection policy can be included as part of the general information security policy for the organization. System and communications protection procedures can be developed for the security program in general, and for a particular information system, when required. NIST Special Publication 800-12 provides guidance on security policies and procedures.\\n",
      "enhancements": "(0) None.\\n",
      "baseline_low": true,
      "baseline_moderate": true,
      "baseline_high": true,
      "iso17799": [
        "10.8.1",
        "15.1.1"
      ],
      "cobit41": [
        "DS5.2",
        "PC5"
      ],
      "pci_dss_v2": [
        "12.5.1"
      ],
      "joomla_id": 61
    },
    {
      "id": "SC-02",
      "name": "Application Partitioning",
      "family": "SC",
      "family_name": "System and Communications Protection",
      "control_class": "Technical",
      "description": "The information system separates user functionality (including user interface services) from information system management functionality.\\n",
      "supplemental_guidance": "The information system physically or logically separates user interface services (e.g., public web pages) from information storage and management services (e.g., database management). Separation may be accomplished through the use of different computers, different central processing units, different instances of the operating system, different network addresses, combinations of these methods, or other methods as appropriate.\\n",
      "enhancements": "(0) None.\\n",
      "baseline_low": true,
      "baseline_moderate": true,
      "baseline_high": true,
      "iso17799": [
        "11.4.5"
      ],
      "cobit41": [
        "AI2.4"
      ],
      "pci_dss_v2": [
        "2.2.1",
        "1.3.7"
      ],
      "joomla_id": 62
    },
    {
      "id": "SC-03",
      "name": "Security Function Isolation",
      "family": "SC",
      "family_name": "System and Communications Protection",
      "control_class": "Technical",
      "description": "The information system isolates security functions from nonsecurity functions.\\n",
      "supplemental_guidance": "The information system isolates security functions from nonsecurity functions by means of partitions, domains, etc., including control of access to and integrity of, the hardware, software, and firmware that perform those security functions. The information system maintains a separate execution domain (e.g., address space) for each executing process.\\n",
      "enhancements": "\\n",
      "baseline_low": true,
      "baseline_moderate": true,
      "baseline_high": true,
      "iso17799": [
        "11.4.5"
      ],
      "cobit41": [
        "DS5.7"
      ],
      "pci_dss_v2": [
        "2.2.1"
      ],
      "joomla_id": 63
    },
    {
      "id": "SC-04",
      "name": "Information Remnance",
      "family": "SC",
      "family_name": "System and Communications Protection",
      "control_class": "Technical",
      "description": "The information system prevents unauthorized and unintended information transfer via shared system resources.\\n",
      "supplemental_guidance": "Control of information system remnance, sometimes referred to as object reuse, or data remnance, prevents information, including encrypted representations of information, produced by the actions of a prior user/role (or the actions of a process acting on behalf of a prior user/role) from being available to any current user/role (or current process) that obtains access to a shared system resource (e.g., registers, main memory, secondary storage) after that resource has been released back to the information system.\\n",
      "enhancements": "(0) None.\\n",
      "baseline_low": true,
      "baseline_moderate": true,
      "baseline_high": true,
      "iso17799": [
        "10.8.1"
      ],
      "cobit41": [
        "None."
      ],
      "pci_dss_v2": [
        "None."
      ],
      "joomla_id": 64
    },
    {
      "id": "SC-05",
      "name": "Denial Of Service Protection",
      "family": "SC",
      "family_name": "System and Communications Protection",
      "control_class": "Technical",
      "description": "The information system protects against or limits the effects of the following types of denial of service attacks: [Assignment: organization-defined list of types of denial of service attacks or reference to source for current list].\\n",
      "supplemental_guidance": "A variety of technologies exist to limit, or in some cases, eliminate the effects of denial of service attacks. For example, boundary protection devices can filter certain types of packets to protect devices on an organizationâ€™s internal network from being directly affected by denial of service attacks. Information systems that are publicly accessible can be protected by employing increased capacity and bandwidth combined with service redundancy.\\n",
      "enhancements": "\\n",
      "baseline_low": true,
      "baseline_moderate": true,
      "baseline_high": true,
      "iso17799": [
        "10.8.4",
        "13.2.1"
      ],
      "cobit41": [
        "None."
      ],
      "pci_dss_v2": [
        "None."
      ],
      "joomla_id": 65
    },
    {
      "id": "SC-06",
      "name": "Resource Priority",
      "family": "SC",
      "family_name": "System and Communications Protection",
      "control_class": "Technical",
      "description": "The information system limits the use of resources by priority.\\n",
      "supplemental_guidance": "Priority protection helps prevent a lower-priority process from delaying or interfering with the information system servicing any higher-priority process.\\n",
      "enhancements": "(0) None.\\n",
      "baseline_low": true,
      "baseline_moderate": true,
      "baseline_high": true,
      "iso17799": [
        "None."
      ],
      "cobit41": [
        "None."
      ],
      "pci_dss_v2": [
        "None."
      ],
      "joomla_id": 66
    },
    {
      "id": "SC-07",
      "name": "Boundary Protection",
      "family": "SC",
      "family_name": "System and Communications Protection",
      "control_class": "Technical",
      "description": "The information system monitors and controls communications at the external boundary of the information system and at key internal boundaries within the system.\\n",
      "supplemental_guidance": "Any connections to the Internet, or other external networks or information systems, occur through managed interfaces consisting of appropriate boundary protection devices (e.g., proxies, gateways, routers, firewalls, guards, encrypted tunnels) arranged in an effective architecture (e.g., routers protecting firewalls and application gateways residing on a protected subnetwork commonly referred to as a demilitarized zone or DMZ). Information system boundary protections at any designated alternate processing sites provide the same levels of protection as that of the primary site. As part of a defense-in-depth protection strategy, the organization considers partitioning higher- impact information systems into separate physical domains (or environments) and applying the concepts of managed interfaces described above to restrict or prohibit network access in accordance with an organizational assessment of risk. FIPS 199 security categorization guides the selection of appropriate candidates for domain partitioning. The organization carefully considers the intrinsically shared nature of commercial telecommunications services in the implementation of security controls associated with the use of such services. Commercial telecommunications services are commonly based on network components and consolidated management systems shared by all attached commercial customers, and may include third party provided access lines and other service elements. Consequently, such interconnecting transmission services may represent sources of increased risk despite contract security provisions. Therefore, when this situation occurs, the organization either implements appropriate compensating security controls or explicitly accepts the additional risk. NIST Special Publication 800-77 provides guidance on virtual private networks. Related security controls: MP- 4, RA-2.\\n",
      "enhancements": "\\n",
      "baseline_low": true,
      "baseline_moderate": true,
      "baseline_high": true,
      "iso17799": [
        "11.4.6"
      ],
      "cobit41": [
        "DS5.10"
      ],
      "pci_dss_v2": [
        "1.2",
        "1.2.1",
        "1.3.1",
        "1.3.2",
        "1.3.3",
        "1.3.4"
      ],
      "joomla_id": 67
    },
    {
      "id": "SC-08",
      "name": "Transmission Integrity",
      "family": "SC",
      "family_name": "System and Communications Protection",
      "control_class": "Technical",
      "description": "The information system protects the integrity of transmitted information.\\n",
      "supplemental_guidance": "If the organization is relying on a commercial service provider for transmission services as a commodity item rather than a fully dedicated service, it may be more difficult to obtain the necessary assurances regarding the implementation of needed security controls for transmission integrity. When it is infeasible or impractical to obtain the necessary security controls and assurances of control effectiveness through appropriate contracting vehicles, the organization either implements appropriate compensating security controls or explicitly accepts the additional risk. NIST Special Publication 800-52 provides guidance on protecting transmission integrity using Transport Layer Security (TLS). NIST Special Publication 800-77 provides guidance on protecting transmission integrity using IPsec. NIST Special Publication 800-81 provides guidance on Domain Name System (DNS) message authentication and integrity verification. NSTISSI No. 7003 contains guidance on the use of Protective Distribution Systems.\\n",
      "enhancements": "\\n",
      "baseline_low": true,
      "baseline_moderate": true,
      "baseline_high": true,
      "iso17799": [
        "10.6.1",
        "10.8.1",
        "10.9.1"
      ],
      "cobit41": [
        "AC6"
      ],
      "pci_dss_v2": [
        "None."
      ],
      "joomla_id": 68
    },
    {
      "id": "SC-09",
      "name": "Transmission Confidentiality",
      "family": "SC",
      "family_name": "System and Communications Protection",
      "control_class": "Technical",
      "description": "The information system protects the confidentiality of transmitted information.\\n",
      "supplemental_guidance": "If the organization is relying on a commercial service provider for transmission services as a commodity item rather than a fully dedicated service, it may be more difficult to obtain the necessary assurances regarding the implementation of needed security controls for transmission confidentiality. When it is infeasible or impractical to obtain the necessary security controls and assurances of control effectiveness through appropriate contracting vehicles, the organization either implements appropriate compensating security controls or explicitly accepts the additional risk. NIST Special Publication 800-52 provides guidance on protecting transmission confidentiality using Transport Layer Security (TLS). NIST Special Publication 800-77 provides guidance on protecting transmission confidentiality using IPsec. NSTISSI No. 7003 contains guidance on the use of Protective Distribution Systems. Related security control: AC-17.\\n",
      "enhancements": "\\n",
      "baseline_low": true,
      "baseline_moderate": true,
      "baseline_high": true,
      "iso17799": [
        "10.6.1",
        "10.8.1",
        "10.9.1"
      ],
      "cobit41": [
        "DS5.11",
        "AC6"
      ],
      "pci_dss_v2": [
        "4.1",
        "4.1.1"
      ],
      "joomla_id": 69
    },
    {
      "id": "SC-10",
      "name": "Network Disconnect",
      "family": "SC",
      "family_name": "System and Communications Protection",
      "control_class": "Technical",
      "description": "The information system terminates a network connection at the end of a session or after [Assignment: organization-defined time period] of inactivity.\\n",
      "supplemental_guidance": "The organization applies this control within the context of risk management that considers specific mission or operational requirements.\\n",
      "enhancements": "(0) None.\\n",
      "baseline_low": true,
      "baseline_moderate": true,
      "baseline_high": true,
      "iso17799": [
        "11.5.6"
      ],
      "cobit41": [
        "None."
      ],
      "pci_dss_v2": [
        "12.3.8"
      ],
      "joomla_id": 70
    },
    {
      "id": "SC-11",
      "name": "Trusted Path",
      "family": "SC",
      "family_name": "System and Communications Protection",
      "control_class": "Technical",
      "description": "The information system establishes a trusted communications path between the user and the following security functions of the system: [Assignment: organization-defined security functions to include at a minimum, information system authentication and reauthentication].\\n",
      "supplemental_guidance": "A trusted path is employed for high-confidence connections between the security functions of the information system and the user (e.g., for login).\\n",
      "enhancements": "(0) None.\\n",
      "baseline_low": true,
      "baseline_moderate": true,
      "baseline_high": true,
      "iso17799": [
        "10.9.2"
      ],
      "cobit41": [
        "DS5.11",
        "AC6"
      ],
      "pci_dss_v2": [
        "None."
      ],
      "joomla_id": 71
    },
    {
      "id": "SC-12",
      "name": "Cryptographic Key Establishment And Management",
      "family": "SC",
      "family_name": "System and Communications Protection",
      "control_class": "Technical",
      "description": "When cryptography is required and employed within the information system, the organization establishes and manages cryptographic keys using automated mechanisms with supporting procedures or manual procedures.\\n",
      "supplemental_guidance": "NIST Special Publication 800-56 provides guidance on cryptographic key establishment. NIST Special Publication 800-57 provides guidance on cryptographic key management.\\n",
      "enhancements": "(0) None.\\n",
      "baseline_low": true,
      "baseline_moderate": true,
      "baseline_high": true,
      "iso17799": [
        "12.3.1",
        "12.3.2"
      ],
      "cobit41": [
        "DS5.8"
      ],
      "pci_dss_v2": [
        "3.5",
        "3.6",
        "3.6.1",
        "3.6.2",
        "3.6.3",
        "3.6.4",
        "3.6.5",
        "3.6.6",
        "3.6.7",
        "3.6.8"
      ],
      "joomla_id": 72
    },
    {
      "id": "SC-13",
      "name": "Use Of Cryptography",
      "family": "SC",
      "family_name": "System and Communications Protection",
      "control_class": "Technical",
      "description": "For information requiring cryptographic protection, the information system implements cryptographic mechanisms that comply with applicable laws, Executive Orders, directives, policies, regulations, standards, and guidance.\\n",
      "supplemental_guidance": "The applicable federal standard for employing cryptography in nonnational security information systems is FIPS 140-2 (as amended). Validation certificates issued by the NIST Cryptographic Module Validation Program (including FIPS 140-1, FIPS 140-2, and future amendments) remain in effect and the modules remain available for continued use and purchase until a validation certificate is specifically revoked. NIST Special Publications 800-56 and 800-57 provide guidance on cryptographic key establishment and cryptographic key management. Additional information on the use of validated cryptography is available at http://csrc.nist.gov/cryptval.\\n",
      "enhancements": "(0) None.\\n",
      "baseline_low": true,
      "baseline_moderate": true,
      "baseline_high": true,
      "iso17799": [
        "None."
      ],
      "cobit41": [
        "DS5.8"
      ],
      "pci_dss_v2": [
        "3.6",
        "4.1.c"
      ],
      "joomla_id": 73
    },
    {
      "id": "SC-14",
      "name": "Public Access Protections",
      "family": "SC",
      "family_name": "System and Communications Protection",
      "control_class": "Technical",
      "description": "The information system protects the integrity and availability of publicly available information and applications.\\n",
      "supplemental_guidance": "None.\\n",
      "enhancements": "(0) None.\\n",
      "baseline_low": true,
      "baseline_moderate": true,
      "baseline_high": true,
      "iso17799": [
        "10.7.4",
        "10.9.3"
      ],
      "cobit41": [
        "None."
      ],
      "pci_dss_v2": [
        "None."
      ],
      "joomla_id": 74
    },
    {
      "id": "SC-15",
      "name": "Collaborative Computing",
      "family": "SC",
      "family_name": "System and Communications Protection",
      "control_class": "Technical",
      "description": "The information system prohibits remote activation of collaborative computing mechanisms and provides an explicit indication of use to the local users.\\n",
      "supplemental_guidance": "Collaborative computing mechanisms include, for example, video and audio conferencing capabilities. Explicit indication of use includes, for example, signals to local users when cameras and/or microphones are activated.\\n",
      "enhancements": "(1) The information system provides physical disconnect of camera and microphone in a manner that supports ease of use.\\n",
      "baseline_low": true,
      "baseline_moderate": true,
      "baseline_high": true,
      "iso17799": [
        "None."
      ],
      "cobit41": [
        "None."
      ],
      "pci_dss_v2": [
        "4.2"
      ],
      "joomla_id": 75
    },
    {
      "id": "SC-16",
      "name": "Transmission Of Security Parameters",
      "family": "SC",
      "family_name": "System and Communications Protection",
      "control_class": "Technical",
      "description": "The information system reliably associates security parameters with information exchanged between information systems.\\n",
      "supplemental_guidance": "Security parameters include, for example, security labels and markings. Security parameters may be explicitly or implicitly associated with the information contained within the information system.\\n",
      "enhancements": "(0) None.\\n",
      "baseline_low": true,
      "baseline_moderate": true,
      "baseline_high": true,
      "iso17799": [
        "7.2.2",
        "10.8.2",
        "10.9.2"
      ],
      "cobit41": [
        "DS5.11"
      ],
      "pci_dss_v2": [
        "None."
      ],
      "joomla_id": 76
    },
    {
      "id": "SC-17",
      "name": "Public Key Infrastructure Certificates",
      "family": "SC",
      "family_name": "System and Communications Protection",
      "control_class": "Technical",
      "description": "The organization issues public key certificates under an appropriate certificate policy or obtains public key certificates under an appropriate certificate policy from an approved service provider.\\n",
      "supplemental_guidance": "For user certificates, each agency either establishes an agency certification authority cross-certified with the Federal Bridge Certification Authority at medium assurance or higher or uses certificates from an approved, shared service provider, as required by OMB Memorandum 05-24. NIST Special Publication 800-32 provides guidance on public key technology. NIST Special Publication 800-63 provides guidance on remote electronic authentication.\\n",
      "enhancements": "(0) None.\\n",
      "baseline_low": true,
      "baseline_moderate": true,
      "baseline_high": true,
      "iso17799": [
        "12.3.2"
      ],
      "cobit41": [
        "None."
      ],
      "pci_dss_v2": [
        "None."
      ],
      "joomla_id": 77
    },
    {
      "id": "SC-18",
      "name": "Mobile Code",
      "family": "SC",
      "family_name": "System and Communications Protection",
      "control_class": "Technical",
      "description": "The organization: (i) establishes usage restrictions and implementation guidance for mobile code technologies based on the potential to cause damage to the information system if used maliciously; and (ii) authorizes, monitors, and controls the use of mobile code within the information system.\\n",
      "supplemental_guidance": "Mobile code technologies include, for example, Java, JavaScript, ActiveX, PDF, Postscript, Shockwave movies, Flash animations, and VBScript. Usage restrictions and implementation guidance apply to both the selection and use of mobile code installed on organizational servers and mobile code downloaded and executed on individual workstations. Control procedures prevent the development, acquisition, or introduction of unacceptable mobile code within the information system. NIST Special Publication 800-28 provides guidance on active content and mobile code.\\n",
      "enhancements": "(0) None.\\n",
      "baseline_low": true,
      "baseline_moderate": true,
      "baseline_high": true,
      "iso17799": [
        "10.4.1",
        "10.4.2"
      ],
      "cobit41": [
        "DS5.9"
      ],
      "pci_dss_v2": [
        "None."
      ],
      "joomla_id": 78
    },
    {
      "id": "SC-19",
      "name": "Voice Over Internet Protocol",
      "family": "SC",
      "family_name": "System and Communications Protection",
      "control_class": "Technical",
      "description": "The organization: (i) establishes usage restrictions and implementation guidance for Voice over Internet Protocol (VoIP) technologies based on the potential to cause damage to the information system if used maliciously; and (ii) authorizes, monitors, and controls the use of VoIP within the information system.\\n",
      "supplemental_guidance": "NIST Special Publication 800-58 provides guidance on security considerations for VoIP technologies employed in information systems.\\n",
      "enhancements": "(0) None.\\n",
      "baseline_low": true,
      "baseline_moderate": true,
      "baseline_high": true,
      "iso17799": [
        "None."
      ],
      "cobit41": [
        "None."
      ],
      "pci_dss_v2": [
        "None."
      ],
      "joomla_id": 79
    },
    {
      "id": "SC-20",
      "name": "Secure Name / Address Resolution Service (Authoritative Source)",
      "family": "SC",
      "family_name": "System and Communications Protection",
      "control_class": "Technical",
      "description": "The information system that provides name/address resolution service provides additional data origin and integrity artifacts along with the authoritative data it returns in response to resolution queries.\\n",
      "supplemental_guidance": "This control enables remote clients to obtain origin authentication and integrity verification assurances for the name/address resolution information obtained through the service. A domain name system (DNS) server is an example of an information system that provides name/address resolution service; digital signatures and cryptographic keys are examples of additional artifacts; and DNS resource records are examples of authoritative data. NIST Special Publication 800-81 provides guidance on secure domain name system deployment.\\n",
      "enhancements": "\\n",
      "baseline_low": true,
      "baseline_moderate": true,
      "baseline_high": true,
      "iso17799": [
        "None."
      ],
      "cobit41": [
        "None."
      ],
      "pci_dss_v2": [
        "None."
      ],
      "joomla_id": 80
    },
    {
      "id": "SC-21",
      "name": "Secure Name / Address Resolution Service (Recursive Or Caching Resolver)",
      "family": "SC",
      "family_name": "System and Communications Protection",
      "control_class": "Technical",
      "description": "The information system that provides name/address resolution service for local clients performs data origin authentication and data integrity verification on the resolution responses it receives from authoritative sources when requested by client systems.\\n",
      "supplemental_guidance": "A resolving or caching domain name system (DNS) server is an example of an information system that provides name/address resolution service for local clients and authoritative DNS servers are examples of authoritative sources. NIST Special Publication 800-81 provides guidance on secure domain name system deployment.\\n",
      "enhancements": "\\n",
      "baseline_low": true,
      "baseline_moderate": true,
      "baseline_high": true,
      "iso17799": [
        "None."
      ],
      "cobit41": [
        "None."
      ],
      "pci_dss_v2": [
        "None."
      ],
      "joomla_id": 81
    },
    {
      "id": "SC-22",
      "name": "Architecture And Provisioning For Name / Address Resolution Service",
      "family": "SC",
      "family_name": "System and Communications Protection",
      "control_class": "Technical",
      "description": "The information systems that collectively provide name/address resolution service for an organization are fault tolerant and implement role separation.\\n",
      "supplemental_guidance": "A domain name system (DNS) server is an example of an information system that provides name/address resolution service. To eliminate single points of failure and to enhance redundancy, there are typically at least two authoritative domain name system (DNS) servers, one configured as primary and the other as secondary. Additionally, the two servers are commonly located in two different network subnets and geographically separated (i.e., not located in the same physical facility). If organizational information technology resources are divided into those resources belonging to internal networks and those resources belonging to external networks, authoritative DNS servers with two roles (internal and external) are established. The DNS server with the internal role provides name/address resolution information pertaining to both internal and external information technology resources while the DNS server with the external role only provides name/address resolution information pertaining to external information technology resources. The list of clients who can access the authoritative DNS server of a particular role is also specified. NIST Special Publication 800-81 provides guidance on secure DNS deployment.\\n",
      "enhancements": "(0) None.\\n",
      "baseline_low": true,
      "baseline_moderate": true,
      "baseline_high": true,
      "iso17799": [
        "None."
      ],
      "cobit41": [
        "None."
      ],
      "pci_dss_v2": [
        "2.2.1"
      ],
      "joomla_id": 82
    },
    {
      "id": "SC-23",
      "name": "Session Authenticity",
      "family": "SC",
      "family_name": "System and Communications Protection",
      "control_class": "Technical",
      "description": "The information system provides mechanisms to protect the authenticity of communications sessions.\\n",
      "supplemental_guidance": "This control focuses on communications protection at the session, versus packet, level. The intent of this control is to implement session-level protection where needed (e.g., in service-oriented architectures providing web-based services). NIST Special Publication 800-52 provides guidance on the use of transport layer security (TLS) mechanisms. NIST Special Publication 800-77 provides guidance on the deployment of IPsec virtual private networks (VPNs) and other methods of protecting communications sessions. NIST Special Publication 800-95 provides guidance on secure web services.\\n",
      "enhancements": "(0) None.\\n",
      "baseline_low": true,
      "baseline_moderate": true,
      "baseline_high": true,
      "iso17799": [
        "None."
      ],
      "cobit41": [
        "AC6",
        "DS5.11"
      ],
      "pci_dss_v2": [
        "None."
      ],
      "joomla_id": 83
    },
    {
      "id": "RA-01",
      "name": "Risk Assessment Policy And Procedures",
      "family": "RA",
      "family_name": "Risk Assessment",
      "control_class": "Management",
      "description": "The organization develops, disseminates, and periodically reviews/updates: (i) a formal, documented risk assessment policy that addresses purpose, scope, roles, responsibilities, management commitment, coordination among organizational entities, and compliance; and (ii) formal, documented procedures to facilitate the implementation of the risk assessment policy and associated risk assessment controls.\\n",
      "supplemental_guidance": "The risk assessment policy and procedures are consistent with applicable laws, Executive Orders, directives, policies, regulations, standards, and guidance. The risk assessment policy can be included as part of the general information security policy for the organization. Risk assessment procedures can be developed for the security program in general, and for a particular information system, when required. NIST Special Publications 800-30 provides guidance on the assessment of risk. NIST Special Publication 800-12 provides guidance on security policies and procedures.\\n",
      "enhancements": "(0) None.\\n",
      "baseline_low": true,
      "baseline_moderate": true,
      "baseline_high": true,
      "iso17799": [
        "4.1",
        "15.1.1"
      ],
      "cobit41": [
        "PO9.1",
        "PC5"
      ],
      "pci_dss_v2": [
        "12.5.1",
        "12.1"
      ],
      "joomla_id": 84
    },
    {
      "id": "RA-02",
      "name": "Security Categorization",
      "family": "RA",
      "family_name": "Risk Assessment",
      "control_class": "Management",
      "description": "The organization categorizes the information system and the information processed, stored, or transmitted by the system in accordance with applicable laws, Executive Orders, directives, policies, regulations, standards, and guidance and documents the results (including supporting rationale) in the system security plan. Designated senior-level officials within the organization review and approve the security categorizations.\\n",
      "supplemental_guidance": "The applicable federal standard for security categorization of nonnational security information and information systems is FIPS 199. The organization conducts FIPS 199 security categorizations as an organization-wide activity with the involvement of the chief information officer, senior agency information security officer, information system owners, and information owners. The organization also considers potential impacts to other organizations and, in accordance with the USA PATRIOT Act of 2001 and Homeland Security Presidential Directives, potential national-level impacts in categorizing the information system. As part of a defense-in-depth protection strategy, the organization considers partitioning higher-impact information systems into separate physical domains (or environments) and restricting or prohibiting network access in accordance with an organizational assessment of risk. NIST Special Publication 800-60 provides guidance on determining the security categories of the information types resident on the information system. Related security controls: MP-4, SC-7.\\n",
      "enhancements": "(0) None.\\n",
      "baseline_low": true,
      "baseline_moderate": true,
      "baseline_high": true,
      "iso17799": [
        "7.2.1"
      ],
      "cobit41": [
        "PO9.2"
      ],
      "pci_dss_v2": [
        "12.1.2"
      ],
      "joomla_id": 85
    },
    {
      "id": "RA-03",
      "name": "Risk Assessment",
      "family": "RA",
      "family_name": "Risk Assessment",
      "control_class": "Management",
      "description": "The organization conducts assessments of the risk and magnitude of harm that could result from the unauthorized access, use, disclosure, disruption, modification, or destruction of information and information systems that support the operations and assets of the agency (including information and information systems managed/operated by external parties).\\n",
      "supplemental_guidance": "Risk assessments take into account vulnerabilities, threat sources, and security controls planned or in place to determine the resulting level of residual risk posed to organizational operations, organizational assets, or individuals based on the operation of the information system. The organization also considers potential impacts to other organizations and, in accordance with the USA PATRIOT Act and Homeland Security Presidential Directives, potential national-level impacts in categorizing the information system. Risk assessments also take into account risk posed to organizational operations, organizational assets, or individuals from external parties (e.g., service providers, contractors operating information systems on behalf of the organization, individuals accessing organizational information systems, outsourcing entities). In accordance with OMB policy and related E-authentication initiatives, authentication of public users accessing federal information systems may also be required to protect nonpublic or privacy-related information. As such, organizational assessments of risk also address public access to federal information systems. The General Services Administration provides tools supporting that portion of the risk assessment dealing with public access to federal information systems. NIST Special Publication 800-30 provides guidance on conducting risk assessments including threat, vulnerability, and impact assessments.\\n",
      "enhancements": "(0) None.\\n",
      "baseline_low": true,
      "baseline_moderate": true,
      "baseline_high": true,
      "iso17799": [
        "4.0",
        "4.1",
        "4.2",
        "6.2.1",
        "10.10.2",
        "10.10.5",
        "12.5.1",
        "12.6.1",
        "14.1.1",
        "14.1.2"
      ],
      "cobit41": [
        "PO9.3",
        "PO9.4",
        "AI1.1"
      ],
      "pci_dss_v2": [
        "12.1.2"
      ],
      "joomla_id": 86
    },
    {
      "id": "RA-04",
      "name": "Risk Assessment Update",
      "family": "RA",
      "family_name": "Risk Assessment",
      "control_class": "Management",
      "description": "The organization updates the risk assessment [Assignment: organization-defined frequency] or whenever there are significant changes to the information system, the facilities where the system resides, or other conditions that may impact the security or accreditation status of the system.\\n",
      "supplemental_guidance": "The organization develops and documents specific criteria for what is considered significant change to the information system. NIST Special Publication 800-30 provides guidance on conducting risk assessment updates.\\n",
      "enhancements": "(0) None.\\n",
      "baseline_low": true,
      "baseline_moderate": true,
      "baseline_high": true,
      "iso17799": [
        "4.1"
      ],
      "cobit41": [
        "PO9.4"
      ],
      "pci_dss_v2": [
        "12.1.3"
      ],
      "joomla_id": 87
    },
    {
      "id": "RA-05",
      "name": "Vulnerability Scanning",
      "family": "RA",
      "family_name": "Risk Assessment",
      "control_class": "Management",
      "description": "The organization scans for vulnerabilities in the information system [Assignment: organization-defined frequency] or when significant new vulnerabilities potentially affecting the system are identified and reported.\\n",
      "supplemental_guidance": "Vulnerability scanning is conducted using appropriate scanning tools and techniques. The organization trains selected personnel in the use and maintenance of vulnerability scanning tools and techniques. Vulnerability scans are scheduled and/or random in accordance with organizational policy and assessment of risk. The information obtained from the vulnerability scanning process is freely shared with appropriate personnel throughout the organization to help eliminate similar vulnerabilities in other information systems. Vulnerability analysis for custom software and applications may require additional, more specialized approaches (e.g., vulnerability scanning tools for applications, source code reviews, static analysis of source code). NIST Special Publication 800-42 provides guidance on network security testing. NIST Special Publication 800-40 (Version 2) provides guidance on patch and vulnerability management.\\n",
      "enhancements": "\\n",
      "baseline_low": true,
      "baseline_moderate": true,
      "baseline_high": true,
      "iso17799": [
        "12.6.1"
      ],
      "cobit41": [
        "PO9.3",
        "DS5.5"
      ],
      "pci_dss_v2": [
        "11.1",
        "11.2",
        "11.2.1",
        "11.2.2",
        "11.2.3",
        "11.3"
      ],
      "joomla_id": 88
    },
    {
      "id": "PL-01",
      "name": "Security Planning Policy And Procedures",
      "family": "PL",
      "family_name": "Planning",
      "control_class": "Management",
      "description": "The organization develops, disseminates, and periodically reviews/updates: (i) a formal, documented, security planning policy that addresses purpose, scope, roles, responsibilities, management commitment, coordination among organizational entities, and compliance; and (ii) formal, documented procedures to facilitate the implementation of the security planning policy and associated security planning controls.\\n",
      "supplemental_guidance": "The security planning policy and procedures are consistent with applicable laws, Executive Orders, directives, policies, regulations, standards, and guidance. The security planning policy addresses the overall policy requirements for confidentiality, integrity, and availability and can be included as part of the general information security policy for the organization. Security planning procedures can be developed for the security program in general, and for a particular information system, when required. NIST Special Publication 800-18 provides guidance on security planning. NIST Special Publication 800-12 provides guidance on security policies and procedures.\\n",
      "enhancements": "(0) None.\\n",
      "baseline_low": true,
      "baseline_moderate": true,
      "baseline_high": true,
      "iso17799": [
        "6.1",
        "15.1.1"
      ],
      "cobit41": [
        "DS5.2",
        "PC5"
      ],
      "pci_dss_v2": [
        "12.5.1"
      ],
      "joomla_id": 89
    },
    {
      "id": "PL-02",
      "name": "System Security Plan",
      "family": "PL",
      "family_name": "Planning",
      "control_class": "Management",
      "description": "The organization develops and implements a security plan for the information system that provides an overview of the security requirements for the system and a description of the security controls in place or planned for meeting those requirements. Designated officials within the organization review and approve the plan.\\n",
      "supplemental_guidance": "The security plan is aligned with the organizationâ€™s information system architecture and information security architecture. NIST Special Publication 800-18 provides guidance on security planning.\\n",
      "enhancements": "(0) None.\\n",
      "baseline_low": true,
      "baseline_moderate": true,
      "baseline_high": true,
      "iso17799": [
        "6.1"
      ],
      "cobit41": [
        "PO1.4",
        "DS5.2"
      ],
      "pci_dss_v2": [
        "12.1"
      ],
      "joomla_id": 90
    },
    {
      "id": "PL-03",
      "name": "System Security Plan Update",
      "family": "PL",
      "family_name": "Planning",
      "control_class": "Management",
      "description": "The organization reviews the security plan for the information system [Assignment: organization-defined frequency, at least annually] and revises the plan to address system/organizational changes or problems identified during plan implementation or security control assessments.\\n",
      "supplemental_guidance": "Significant changes are defined in advance by the organization and identified in the configuration management process. NIST Special Publication 800-18 provides guidance on security plan updates.\\n",
      "enhancements": "(0) None.\\n",
      "baseline_low": true,
      "baseline_moderate": true,
      "baseline_high": true,
      "iso17799": [
        "6.1"
      ],
      "cobit41": [
        "PO1.4"
      ],
      "pci_dss_v2": [
        "12.1"
      ],
      "joomla_id": 91
    },
    {
      "id": "PL-04",
      "name": "Rules Of Behavior",
      "family": "PL",
      "family_name": "Planning",
      "control_class": "Management",
      "description": "The organization establishes and makes readily available to all information system users, a set of rules that describes their responsibilities and expected behavior with regard to information and information system usage. The organization receives signed acknowledgment from users indicating that they have read, understand, and agree to abide by the rules of behavior, before authorizing access to the information system and its resident information.\\n",
      "supplemental_guidance": "Electronic signatures are acceptable for use in acknowledging rules of behavior unless specifically prohibited by organizational policy. NIST Special Publication 800-18 provides guidance on preparing rules of behavior.\\n",
      "enhancements": "(0) None.\\n",
      "baseline_low": true,
      "baseline_moderate": true,
      "baseline_high": true,
      "iso17799": [
        "7.1.3",
        "8.1.3",
        "15.1.5"
      ],
      "cobit41": [
        "PO6.5",
        "DS5.2",
        "PC4"
      ],
      "pci_dss_v2": [
        "12.6.2"
      ],
      "joomla_id": 92
    },
    {
      "id": "PL-05",
      "name": "Privacy Impact Assessment",
      "family": "PL",
      "family_name": "Planning",
      "control_class": "Management",
      "description": "The organization conducts a privacy impact assessment on the information system in accordance with OMB policy.\\n",
      "supplemental_guidance": "OMB Memorandum 03-22 provides guidance for implementing the privacy provisions of the E-Government Act of 2002.\\n",
      "enhancements": "(0) None.\\n",
      "baseline_low": true,
      "baseline_moderate": true,
      "baseline_high": true,
      "iso17799": [
        "15.1.4"
      ],
      "cobit41": [
        "None."
      ],
      "pci_dss_v2": [
        "3.1.1"
      ],
      "joomla_id": 93
    },
    {
      "id": "PL-06",
      "name": "Security-Related Activity Planning",
      "family": "PL",
      "family_name": "Planning",
      "control_class": "Management",
      "description": "The organization plans and coordinates security-related activities affecting the information system before conducting such activities in order to reduce the impact on organizational operations (i.e., mission, functions, image, and reputation), organizational assets, and individuals.\\n",
      "supplemental_guidance": "Routine security-related activities include, but are not limited to, security assessments, audits, system hardware and software maintenance, security certifications, and testing/exercises. Organizational advance planning and coordination includes both emergency and non-emergency (i.e., routine) situations.\\n",
      "enhancements": "(0) None.\\n",
      "baseline_low": true,
      "baseline_moderate": true,
      "baseline_high": true,
      "iso17799": [
        "15.3.1"
      ],
      "cobit41": [
        "None."
      ],
      "pci_dss_v2": [
        "None."
      ],
      "joomla_id": 94
    },
    {
      "id": "PE-01",
      "name": "Physical And Environmental Protection Policy And Procedures",
      "family": "PE",
      "family_name": "Physical and Environmental Protection",
      "control_class": "Operational",
      "description": "The organization develops, disseminates, and periodically reviews/updates: (i) a formal, documented, physical and environmental protection policy that addresses purpose, scope, roles, responsibilities, management commitment, coordination among organizational entities, and compliance; and (ii) formal, documented procedures to facilitate the implementation of the physical and environmental protection policy and associated physical and environmental protection controls.\\n",
      "supplemental_guidance": "The physical and environmental protection policy and procedures are consistent with applicable laws, Executive Orders, directives, policies, regulations, standards, and guidance. The physical and environmental protection policy can be included as part of the general information security policy for the organization. Physical and environmental protection procedures can be developed for the security program in general, and for a particular information system, when required. NIST Special Publication 800-12 provides guidance on security policies and procedures.\\n",
      "enhancements": "(0) None.\\n",
      "baseline_low": true,
      "baseline_moderate": true,
      "baseline_high": true,
      "iso17799": [
        "15.1.1"
      ],
      "cobit41": [
        "DS12.1",
        "DS12.5",
        "PC5"
      ],
      "pci_dss_v2": [
        "12.5.1"
      ],
      "joomla_id": 95
    },
    {
      "id": "PE-02",
      "name": "Physical Access Authorizations",
      "family": "PE",
      "family_name": "Physical and Environmental Protection",
      "control_class": "Operational",
      "description": "The organization develops and keeps current a list of personnel with authorized access to the facility where the information system resides (except for those areas within the facility officially designated as publicly accessible) and issues appropriate authorization credentials. Designated officials within the organization review and approve the access list and authorization credentials [Assignment: organization-defined frequency, at least annually].\\n",
      "supplemental_guidance": "Appropriate authorization credentials include, for example, badges, identification cards, and smart cards. The organization promptly removes from the access list personnel no longer requiring access to the facility where the information system resides.\\n",
      "enhancements": "(0) None.\\n",
      "baseline_low": true,
      "baseline_moderate": true,
      "baseline_high": true,
      "iso17799": [
        "9.1.2",
        "9.1.6"
      ],
      "cobit41": [
        "DS12.3"
      ],
      "pci_dss_v2": [
        "9.1"
      ],
      "joomla_id": 96
    },
    {
      "id": "PE-03",
      "name": "Physical Access Control",
      "family": "PE",
      "family_name": "Physical and Environmental Protection",
      "control_class": "Operational",
      "description": "The organization controls all physical access points (including designated entry/exit points) to the facility where the information system resides (except for those areas within the facility officially designated as publicly accessible) and verifies individual access authorizations before granting access to the facility. The organization controls access to areas officially designated as publicly accessible, as appropriate, in accordance with the organizationâ€™s assessment of risk.\\n",
      "supplemental_guidance": "The organization uses physical access devices (e.g., keys, locks, combinations, card readers) and/or guards to control entry to facilities containing information systems. The organization secures keys, combinations, and other access devices and inventories those devices regularly. The organization changes combinations and keys: (i) periodically; and (ii) when keys are lost, combinations are compromised, or individuals are transferred or terminated. Workstations and associated peripherals connected to (and part of) an organizational information system may be located in areas designated as publicly accessible with access to such devices being appropriately controlled. Where federal Personal Identity Verification (PIV) credential is used as an identification token and token-based access control is employed, the access control system conforms to the requirements of FIPS 201 and NIST Special Publication 800-73. If the token- based access control function employs cryptographic verification, the access control system conforms to the requirements of NIST Special Publication 800-78. If the token-based access control function employs biometric verification, the access control system conforms to the requirements of NIST Special Publication 800-76.\\n",
      "enhancements": "\\n",
      "baseline_low": true,
      "baseline_moderate": true,
      "baseline_high": true,
      "iso17799": [
        "9.1.1",
        "9.1.2",
        "9.1.5",
        "9.1.6",
        "10.5.1"
      ],
      "cobit41": [
        "DS12.2"
      ],
      "pci_dss_v2": [
        "9.1"
      ],
      "joomla_id": 97
    },
    {
      "id": "PE-04",
      "name": "Access Control For Transmission Medium",
      "family": "PE",
      "family_name": "Physical and Environmental Protection",
      "control_class": "Operational",
      "description": "The organization controls physical access to information system distribution and transmission lines within organizational facilities.\\n",
      "supplemental_guidance": "Physical protections applied to information system distribution and transmission lines help prevent accidental damage, disruption, and physical tampering. Additionally, physical protections are necessary to help prevent eavesdropping or in transit modification of unencrypted transmissions. Protective measures to control physical access to information system distribution and transmission lines include: (i) locked wiring closets; (ii) disconnected or locked spare jacks; and/or (iii) protection of cabling by conduit or cable trays.\\n",
      "enhancements": "(0) None.\\n",
      "baseline_low": true,
      "baseline_moderate": true,
      "baseline_high": true,
      "iso17799": [
        "9.2.3"
      ],
      "cobit41": [
        "DS5.7",
        "DS12.2"
      ],
      "pci_dss_v2": [
        "9.1.2",
        "9.1.3"
      ],
      "joomla_id": 98
    },
    {
      "id": "PE-05",
      "name": "Access Control For Display Medium",
      "family": "PE",
      "family_name": "Physical and Environmental Protection",
      "control_class": "Operational",
      "description": "The organization controls physical access to information system devices that display information to prevent unauthorized individuals from observing the display output.\\n",
      "supplemental_guidance": "None.\\n",
      "enhancements": "(0) None.\\n",
      "baseline_low": true,
      "baseline_moderate": true,
      "baseline_high": true,
      "iso17799": [
        "9.1.2",
        "11.3.3"
      ],
      "cobit41": [
        "DS12.2"
      ],
      "pci_dss_v2": [
        "None."
      ],
      "joomla_id": 99
    },
    {
      "id": "PE-06",
      "name": "Monitoring Physical Access",
      "family": "PE",
      "family_name": "Physical and Environmental Protection",
      "control_class": "Operational",
      "description": "The organization monitors physical access to the information system to detect and respond to physical security incidents.\\n",
      "supplemental_guidance": "The organization reviews physical access logs periodically and investigates apparent security violations or suspicious physical access activities. Response to detected physical security incidents is part of the organizationâ€™s incident response capability.\\n",
      "enhancements": "\\n",
      "baseline_low": true,
      "baseline_moderate": true,
      "baseline_high": true,
      "iso17799": [
        "9.1.2"
      ],
      "cobit41": [
        "DS12.3"
      ],
      "pci_dss_v2": [
        "9.1.1"
      ],
      "joomla_id": 100
    },
    {
      "id": "PE-07",
      "name": "Visitor Control",
      "family": "PE",
      "family_name": "Physical and Environmental Protection",
      "control_class": "Operational",
      "description": "The organization controls physical access to the information system by authenticating visitors before authorizing access to the facility where the information system resides other than areas designated as publicly accessible.\\n",
      "supplemental_guidance": "Government contractors and others with permanent authorization credentials are not considered visitors. Personal Identity Verification (PIV) credentials for federal employees and contractors conform to FIPS 201, and the issuing organizations for the PIV credentials are accredited in accordance with the provisions of NIST Special Publication 800-79.\\n",
      "enhancements": "(1) The organization escorts visitors and monitors visitor activity, when required.\\n",
      "baseline_low": true,
      "baseline_moderate": true,
      "baseline_high": true,
      "iso17799": [
        "9.1.2"
      ],
      "cobit41": [
        "DS12.3"
      ],
      "pci_dss_v2": [
        "9.2",
        "9.3.x"
      ],
      "joomla_id": 101
    },
    {
      "id": "PE-08",
      "name": "Access Records",
      "family": "PE",
      "family_name": "Physical and Environmental Protection",
      "control_class": "Operational",
      "description": "The organization maintains visitor access records to the facility where the information system resides (except for those areas within the facility officially designated as publicly accessible) that includes: (i) name and organization of the person visiting; (ii) signature of the visitor; (iii) form of identification; (iv) date of access; (v) time of entry and departure; (vi) purpose of visit; and (vii) name and organization of person visited. Designated officials within the organization review the visitor access records [Assignment: organization-defined frequency].\\n",
      "supplemental_guidance": "None.\\n",
      "enhancements": "\\n",
      "baseline_low": true,
      "baseline_moderate": true,
      "baseline_high": true,
      "iso17799": [
        "9.1.2"
      ],
      "cobit41": [
        "DS12.3"
      ],
      "pci_dss_v2": [
        "9.4"
      ],
      "joomla_id": 102
    },
    {
      "id": "PE-09",
      "name": "Power Equipment And Power Cabling",
      "family": "PE",
      "family_name": "Physical and Environmental Protection",
      "control_class": "Operational",
      "description": "The organization protects power equipment and power cabling for the information system from damage and destruction.\\n",
      "supplemental_guidance": "None.\\n",
      "enhancements": "(1) The organization employs redundant and parallel power cabling paths.\\n",
      "baseline_low": true,
      "baseline_moderate": true,
      "baseline_high": true,
      "iso17799": [
        "9.2.2",
        "9.2.3"
      ],
      "cobit41": [
        "DS12.4"
      ],
      "pci_dss_v2": [
        "None."
      ],
      "joomla_id": 103
    },
    {
      "id": "PE-10",
      "name": "Emergency Shutoff",
      "family": "PE",
      "family_name": "Physical and Environmental Protection",
      "control_class": "Operational",
      "description": "The organization provides, for specific locations within a facility containing concentrations of information system resources, the capability of shutting off power to any information system component that may be malfunctioning or threatened without endangering personnel by requiring them to approach the equipment.\\n",
      "supplemental_guidance": "Facilities containing concentrations of information system resources may include, for example, data centers, server rooms, and mainframe rooms.\\n",
      "enhancements": "(1) The organization protects the emergency power-off capability from accidental or unauthorized activation.\\n",
      "baseline_low": true,
      "baseline_moderate": true,
      "baseline_high": true,
      "iso17799": [
        "9.2.2"
      ],
      "cobit41": [
        "DS12.4"
      ],
      "pci_dss_v2": [
        "None."
      ],
      "joomla_id": 104
    },
    {
      "id": "PE-11",
      "name": "Emergency Power",
      "family": "PE",
      "family_name": "Physical and Environmental Protection",
      "control_class": "Operational",
      "description": "The organization provides a short-term uninterruptible power supply to facilitate an orderly shutdown of the information system in the event of a primary power source loss.\\n",
      "supplemental_guidance": "None.\\n",
      "enhancements": "\\n",
      "baseline_low": true,
      "baseline_moderate": true,
      "baseline_high": true,
      "iso17799": [
        "9.2.2"
      ],
      "cobit41": [
        "DS12.4"
      ],
      "pci_dss_v2": [
        "None."
      ],
      "joomla_id": 105
    },
    {
      "id": "PE-12",
      "name": "Emergency Lighting",
      "family": "PE",
      "family_name": "Physical and Environmental Protection",
      "control_class": "Operational",
      "description": "The organization employs and maintains automatic emergency lighting that activates in the event of a power outage or disruption and that covers emergency exits and evacuation routes.\\n",
      "supplemental_guidance": "None.\\n",
      "enhancements": "(0) None.\\n",
      "baseline_low": true,
      "baseline_moderate": true,
      "baseline_high": true,
      "iso17799": [
        "9.2.2"
      ],
      "cobit41": [
        "DS12.4"
      ],
      "pci_dss_v2": [
        "None."
      ],
      "joomla_id": 106
    },
    {
      "id": "PE-13",
      "name": "Fire Protection",
      "family": "PE",
      "family_name": "Physical and Environmental Protection",
      "control_class": "Operational",
      "description": "The organization employs and maintains fire suppression and detection devices/systems that can be activated in the event of a fire.\\n",
      "supplemental_guidance": "Fire suppression and detection devices/systems include, but are not limited to, sprinkler systems, handheld fire extinguishers, fixed fire hoses, and smoke detectors.\\n",
      "enhancements": "\\n",
      "baseline_low": true,
      "baseline_moderate": true,
      "baseline_high": true,
      "iso17799": [
        "9.1.4",
        "9.2.1"
      ],
      "cobit41": [
        "DS12.4"
      ],
      "pci_dss_v2": [
        "None."
      ],
      "joomla_id": 107
    },
    {
      "id": "PE-14",
      "name": "Temperature And Humidity Controls",
      "family": "PE",
      "family_name": "Physical and Environmental Protection",
      "control_class": "Operational",
      "description": "The organization regularly maintains, within acceptable levels, and monitors the temperature and humidity within the facility where the information system resides.\\n",
      "supplemental_guidance": "None.\\n",
      "enhancements": "(0) None.\\n",
      "baseline_low": true,
      "baseline_moderate": true,
      "baseline_high": true,
      "iso17799": [
        "9.2.1",
        "10.5.1",
        "10.7.1"
      ],
      "cobit41": [
        "DS12.4"
      ],
      "pci_dss_v2": [
        "None."
      ],
      "joomla_id": 108
    },
    {
      "id": "PE-15",
      "name": "Water Damage Protection",
      "family": "PE",
      "family_name": "Physical and Environmental Protection",
      "control_class": "Operational",
      "description": "The organization protects the information system from water damage resulting from broken plumbing lines or other sources of water leakage by providing master shutoff valves that are accessible, working properly, and known to key personnel.\\n",
      "supplemental_guidance": "None.\\n",
      "enhancements": "(1) The organization employs mechanisms that, without the need for manual intervention, protect the information system from water damage in the event of a significant water leak.\\n",
      "baseline_low": true,
      "baseline_moderate": true,
      "baseline_high": true,
      "iso17799": [
        "9.1.4",
        "9.2.1"
      ],
      "cobit41": [
        "DS12.4"
      ],
      "pci_dss_v2": [
        "None."
      ],
      "joomla_id": 109
    },
    {
      "id": "PE-16",
      "name": "Delivery And Removal",
      "family": "PE",
      "family_name": "Physical and Environmental Protection",
      "control_class": "Operational",
      "description": "The organization authorizes and controls information system-related items entering and exiting the facility and maintains appropriate records of those items.\\n",
      "supplemental_guidance": "The organization controls delivery areas and, if possible, isolates the areas from the information system and media libraries to avoid unauthorized physical access.\\n",
      "enhancements": "(0) None.\\n",
      "baseline_low": true,
      "baseline_moderate": true,
      "baseline_high": true,
      "iso17799": [
        "9.1.6",
        "9.2.7",
        "10.7.1"
      ],
      "cobit41": [
        "DS12.2"
      ],
      "pci_dss_v2": [
        "None."
      ],
      "joomla_id": 110
    },
    {
      "id": "PE-17",
      "name": "Alternate Work Site",
      "family": "PE",
      "family_name": "Physical and Environmental Protection",
      "control_class": "Operational",
      "description": "The organization employs appropriate management, operational, and technical information system security controls at alternate work sites.\\n",
      "supplemental_guidance": "The organization provides a means for employees to communicate with information system security staff in case of security problems. NIST Special Publication 800-46 provides guidance on security in telecommuting and broadband communications.\\n",
      "enhancements": "(0) None.\\n",
      "baseline_low": true,
      "baseline_moderate": true,
      "baseline_high": true,
      "iso17799": [
        "11.7.2"
      ],
      "cobit41": [
        "None."
      ],
      "pci_dss_v2": [
        "None."
      ],
      "joomla_id": 111
    },
    {
      "id": "PE-18",
      "name": "Location Of Information System Components",
      "family": "PE",
      "family_name": "Physical and Environmental Protection",
      "control_class": "Operational",
      "description": "The organization positions information system components within the facility to minimize potential damage from physical and environmental hazards and to minimize the opportunity for unauthorized access.\\n",
      "supplemental_guidance": "Physical and environmental hazards include, for example, flooding, fire, tornados, earthquakes, hurricanes, acts of terrorism, vandalism, electrical interference, and electromagnetic radiation. Whenever possible, the organization also considers the location or site of the facility with regard to physical and environmental hazards.\\n",
      "enhancements": "(1) The organization plans the location or site of the facility where the information system resides with regard to physical and environmental hazards and for existing facilities, considers the physical and environmental hazards in its risk mitigation strategy.\\n",
      "baseline_low": true,
      "baseline_moderate": true,
      "baseline_high": true,
      "iso17799": [
        "9.2.1"
      ],
      "cobit41": [
        "DS12.1"
      ],
      "pci_dss_v2": [
        "None."
      ],
      "joomla_id": 112
    },
    {
      "id": "PE-19",
      "name": "Information Leakage",
      "family": "PE",
      "family_name": "Physical and Environmental Protection",
      "control_class": "Operational",
      "description": "The organization protects the information system from information leakage due to electromagnetic signals emanations.\\n",
      "supplemental_guidance": "The FIPS 199 security categorization (for confidentiality) of the information system and organizational security policy guides the application of safeguards and countermeasures employed to protect the information system against information leakage due to electromagnetic signals emanations.\\n",
      "enhancements": "(0) None.\\n",
      "baseline_low": true,
      "baseline_moderate": true,
      "baseline_high": true,
      "iso17799": [
        "None."
      ],
      "cobit41": [
        "DS12.2"
      ],
      "pci_dss_v2": [
        "None."
      ],
      "joomla_id": 113
    },
    {
      "id": "PS-01",
      "name": "Personnel Security Policy And Procedures",
      "family": "PS",
      "family_name": "Personnel Security",
      "control_class": "Operational",
      "description": "The organization develops, disseminates, and periodically reviews/updates: (i) a formal, documented, personnel security policy that addresses purpose, scope, roles, responsibilities, management commitment, coordination among organizational entities, and compliance; and (ii) formal, documented procedures to facilitate the implementation of the personnel security policy and associated personnel security controls.\\n",
      "supplemental_guidance": "The personnel security policy and procedures are consistent with applicable laws, Executive Orders, directives, policies, regulations, standards, and guidance. The personnel security policy can be included as part of the general information security policy for the organization. Personnel security procedures can be developed for the security program in general, and for a particular information system, when required. NIST Special Publication 800-12 provides guidance on security policies and procedures.\\n",
      "enhancements": "(0) None.\\n",
      "baseline_low": true,
      "baseline_moderate": true,
      "baseline_high": true,
      "iso17799": [
        "8.1.1",
        "15.1.1"
      ],
      "cobit41": [
        "PO4.6",
        "PO7.3",
        "PC5"
      ],
      "pci_dss_v2": [
        "12.5.1"
      ],
      "joomla_id": 114
    },
    {
      "id": "PS-02",
      "name": "Position Categorization",
      "family": "PS",
      "family_name": "Personnel Security",
      "control_class": "Operational",
      "description": "The organization assigns a risk designation to all positions and establishes screening criteria for individuals filling those positions. The organization reviews and revises position risk designations [Assignment: organization-defined frequency].\\n",
      "supplemental_guidance": "Position risk designations are consistent with 5 CFR 731.106(a) and Office of Personnel Management policy and guidance.\\n",
      "enhancements": "(0) None.\\n",
      "baseline_low": true,
      "baseline_moderate": true,
      "baseline_high": true,
      "iso17799": [
        "8.1.2"
      ],
      "cobit41": [
        "PO4.13",
        "PO7.3"
      ],
      "pci_dss_v2": [
        "12.7"
      ],
      "joomla_id": 115
    },
    {
      "id": "PS-03",
      "name": "Personnel Screening",
      "family": "PS",
      "family_name": "Personnel Security",
      "control_class": "Operational",
      "description": "The organization screens individuals requiring access to organizational information and information systems before authorizing access.\\n",
      "supplemental_guidance": "Screening is consistent with: (i) 5 CFR 731.106; (ii) Office of Personnel Management policy, regulations, and guidance; (iii) organizational policy, regulations, and guidance; (iv) FIPS 201 and Special Publications 800-73, 800-76, and 800-78; and (v) the criteria established for the risk designation of the assigned position.\\n",
      "enhancements": "(0) None.\\n",
      "baseline_low": true,
      "baseline_moderate": true,
      "baseline_high": true,
      "iso17799": [
        "8.1.2"
      ],
      "cobit41": [
        "PO7.6"
      ],
      "pci_dss_v2": [
        "12.7"
      ],
      "joomla_id": 116
    },
    {
      "id": "PS-04",
      "name": "Personnel Termination",
      "family": "PS",
      "family_name": "Personnel Security",
      "control_class": "Operational",
      "description": "The organization, upon termination of individual employment, terminates information system access, conducts exit interviews, retrieves all organizational information system-related property, and provides appropriate personnel with access to official records created by the terminated employee that are stored on organizational information systems.\\n",
      "supplemental_guidance": "Information system-related property includes, for example, keys, identification cards, and building passes. Timely execution of this control is particularly essential for employees or contractors terminated for cause.\\n",
      "enhancements": "(0) None.\\n",
      "baseline_low": true,
      "baseline_moderate": true,
      "baseline_high": true,
      "iso17799": [
        "8.1.3",
        "8.3",
        "11.2.1"
      ],
      "cobit41": [
        "PO7.8"
      ],
      "pci_dss_v2": [
        "8.5.4"
      ],
      "joomla_id": 117
    },
    {
      "id": "PS-05",
      "name": "Personnel Transfer",
      "family": "PS",
      "family_name": "Personnel Security",
      "control_class": "Operational",
      "description": "The organization reviews information systems/facilities access authorizations when personnel are reassigned or transferred to other positions within the organization and initiates appropriate actions.\\n",
      "supplemental_guidance": "Appropriate actions that may be required include: (i) returning old and issuing new keys, identification cards, building passes; (ii) closing old accounts and establishing new accounts; (iii) changing system access authorizations; and (iv) providing for access to official records created or controlled by the employee at the old work location and in the old accounts.\\n",
      "enhancements": "(0) None.\\n",
      "baseline_low": true,
      "baseline_moderate": true,
      "baseline_high": true,
      "iso17799": [
        "8.3.1",
        "8.3.3",
        "11.2.1"
      ],
      "cobit41": [
        "PO7.8"
      ],
      "pci_dss_v2": [
        "7.1.1"
      ],
      "joomla_id": 118
    },
    {
      "id": "PS-06",
      "name": "Access Agreements",
      "family": "PS",
      "family_name": "Personnel Security",
      "control_class": "Operational",
      "description": "The organization completes appropriate signed access agreements for individuals requiring access to organizational information and information systems before authorizing access and reviews/updates the agreements [Assignment: organization-defined frequency].\\n",
      "supplemental_guidance": "Access agreements include, for example, nondisclosure agreements, acceptable use agreements, rules of behavior, and conflict-of-interest agreements. Electronic signatures are acceptable for use in acknowledging access agreements unless specifically prohibited by organizational policy.\\n",
      "enhancements": "(0) None.\\n",
      "baseline_low": true,
      "baseline_moderate": true,
      "baseline_high": true,
      "iso17799": [
        "6.1.5",
        "8.1.3"
      ],
      "cobit41": [
        "DS5.4"
      ],
      "pci_dss_v2": [
        "7.1.3"
      ],
      "joomla_id": 119
    },
    {
      "id": "PS-07",
      "name": "Third-Party Personnel Security",
      "family": "PS",
      "family_name": "Personnel Security",
      "control_class": "Operational",
      "description": "The organization establishes personnel security requirements including security roles and responsibilities for third-party providers and monitors provider compliance.\\n",
      "supplemental_guidance": "Third-party providers include, for example, service bureaus, contractors, and other organizations providing information system development, information technology services, outsourced applications, and network and security management. The organization explicitly includes personnel security requirements in acquisition-related documents. NIST Special Publication 800-35 provides guidance on information technology security services.\\n",
      "enhancements": "(0) None.\\n",
      "baseline_low": true,
      "baseline_moderate": true,
      "baseline_high": true,
      "iso17799": [
        "6.2.1",
        "6.2.3",
        "8.1.1",
        "8.1.2",
        "8.1.3",
        "8.2.1",
        "8.2.2",
        "11.2.1"
      ],
      "cobit41": [
        "PO4.14",
        "DS2.2"
      ],
      "pci_dss_v2": [
        "8.5.6",
        "7.2.2"
      ],
      "joomla_id": 120
    },
    {
      "id": "PS-08",
      "name": "Personnel Sanctions",
      "family": "PS",
      "family_name": "Personnel Security",
      "control_class": "Operational",
      "description": "The organization employs a formal sanctions process for personnel failing to comply with established information security policies and procedures.\\n",
      "supplemental_guidance": "The sanctions process is consistent with applicable laws, Executive Orders, directives, policies, regulations, standards, and guidance. The sanctions process can be included as part of the general personnel policies and procedures for the organization.\\n",
      "enhancements": "(0) None.\\n",
      "baseline_low": true,
      "baseline_moderate": true,
      "baseline_high": true,
      "iso17799": [
        "8.2.3",
        "11.2.1"
      ],
      "cobit41": [
        "None."
      ],
      "pci_dss_v2": [
        "None."
      ],
      "joomla_id": 121
    },
    {
      "id": "MP-01",
      "name": "Media Protection Policy And Procedures",
      "family": "MP",
      "family_name": "Media Protection",
      "control_class": "Operational",
      "description": "The organization develops, disseminates, and periodically reviews/updates: (i) a formal, documented, media protection policy that addresses purpose, scope, roles, responsibilities, management commitment, coordination among organizational entities, and compliance; and (ii) formal, documented procedures to facilitate the implementation of the media protection policy and associated media protection controls.\\n",
      "supplemental_guidance": "The media protection policy and procedures are consistent with applicable laws, Executive Orders, directives, policies, regulations, standards, and guidance. The media protection policy can be included as part of the general information security policy for the organization. Media protection procedures can be developed for the security program in general, and for a particular information system, when required. NIST Special Publication 800-12 provides guidance on security policies and procedures.\\n",
      "enhancements": "(0) None.\\n",
      "baseline_low": true,
      "baseline_moderate": true,
      "baseline_high": true,
      "iso17799": [
        "10.1.1",
        "10.7",
        "15.1.1",
        "15.1.3"
      ],
      "cobit41": [
        "DS11.1",
        "DS11.6",
        "PC5"
      ],
      "pci_dss_v2": [
        "12.5.1"
      ],
      "joomla_id": 122
    },
    {
      "id": "MP-02",
      "name": "Media Access",
      "family": "MP",
      "family_name": "Media Protection",
      "control_class": "Operational",
      "description": "The organization restricts access to information system media to authorized individuals.\\n",
      "supplemental_guidance": "Information system media includes both digital media (e.g., diskettes, magnetic tapes, external/removable hard drives, flash/thumb drives, compact disks, digital video disks) and non-digital media (e.g., paper, microfilm). This control also applies to portable and mobile computing and communications devices with information storage capability (e.g., notebook computers, personal digital assistants, cellular telephones). An organizational assessment of risk guides the selection of media and associated information contained on that media requiring restricted access. Organizations document in policy and procedures, the media requiring restricted access, individuals authorized to access the media, and the specific measures taken to restrict access. The rigor with which this control is applied is commensurate with the FIPS 199 security categorization of the information contained on the media. For example, fewer protection measures are needed for media containing information determined by the organization to be in the public domain, to be publicly releasable, or to have limited or no adverse impact on the organization or individuals if accessed by other than authorized personnel. In these situations, it is assumed that the physical access controls where the media resides provide adequate protection.\\n",
      "enhancements": "\\n",
      "baseline_low": true,
      "baseline_moderate": true,
      "baseline_high": true,
      "iso17799": [
        "10.7.3"
      ],
      "cobit41": [
        "DS11.6"
      ],
      "pci_dss_v2": [
        "9.6",
        "9.8",
        "9.9"
      ],
      "joomla_id": 123
    },
    {
      "id": "MP-03",
      "name": "Media Labeling",
      "family": "MP",
      "family_name": "Media Protection",
      "control_class": "Operational",
      "description": "The organization: (i) affixes external labels to removable information system media and information system output indicating the distribution limitations, handling caveats and applicable security markings (if any) of the information; and (ii) exempts [Assignment: organization-defined list of media types or hardware components] from labeling so long as they remain within [Assignment: organization-defined protected environment].\\n",
      "supplemental_guidance": "An organizational assessment of risk guides the selection of media requiring labeling. Organizations document in policy and procedures, the media requiring labeling and the specific measures taken to afford such protection. The rigor with which this control is applied is commensurate with the FIPS 199 security categorization of the information contained on the media. For example, labeling is not required for media containing information determined by the organization to be in the public domain or to be publicly releasable.\\n",
      "enhancements": "(0) None.\\n",
      "baseline_low": true,
      "baseline_moderate": true,
      "baseline_high": true,
      "iso17799": [
        "7.2.2",
        "10.7.3",
        "10.8.2",
        "15.1.3"
      ],
      "cobit41": [
        "DS11.6"
      ],
      "pci_dss_v2": [
        "9.7",
        "12.3.4"
      ],
      "joomla_id": 124
    },
    {
      "id": "MP-04",
      "name": "Media Storage",
      "family": "MP",
      "family_name": "Media Protection",
      "control_class": "Operational",
      "description": "The organization physically controls and securely stores information system media within controlled areas.\\n",
      "supplemental_guidance": "Information system media includes both digital media (e.g., diskettes, magnetic tapes, external/removable hard drives, flash/thumb drives, compact disks, digital video disks) and non-digital media (e.g., paper, microfilm). A controlled area is any area or space for which the organization has confidence that the physical and procedural protections provided are sufficient to meet the requirements established for protecting the information and/or information system. This control applies to portable and mobile computing and communications devices with information storage capability (e.g., notebook computers, personal digital assistants, cellular telephones). Telephone systems are also considered information systems and may have the capability to store information on internal media (e.g., on voicemail systems). Since telephone systems do not have, in most cases, the identification, authentication, and access control mechanisms typically employed in other information systems, organizational personnel exercise extreme caution in the types of information stored on telephone voicemail systems. An organizational assessment of risk guides the selection of media and associated information contained on that media requiring physical protection. Organizations document in policy and procedures, the media requiring physical protection and the specific measures taken to afford such protection. The rigor with which this control is applied is commensurate with the FIPS 199 security categorization of the information contained on the media. For example, fewer protection measures are needed for media containing information determined by the organization to be in the public domain, to be publicly releasable, or to have limited or no adverse impact on the organization or individuals if accessed by other than authorized personnel. In these situations, it is assumed that the physical access controls to the facility where the media resides provide adequate protection. The organization protects information system media identified by the organization until the media are destroyed or sanitized using approved equipment, techniques, and procedures. As part of a defense-in-depth protection strategy, the organization considers routinely encrypting information at rest on selected secondary storage devices. FIPS 199 security categorization guides the selection of appropriate candidates for secondary storage encryption. The organization implements effective cryptographic key management in support of secondary storage encryption and provides protections to maintain the availability of the information in the event of the loss of cryptographic keys by users. NIST Special Publications 800-56 and 800-57 provide guidance on cryptographic key establishment and cryptographic key management. Related security controls: CP-9, RA-2.\\n",
      "enhancements": "(0) None.\\n",
      "baseline_low": true,
      "baseline_moderate": true,
      "baseline_high": true,
      "iso17799": [
        "10.7.1",
        "10.7.2",
        "10.7.3",
        "10.7.4",
        "15.1.3"
      ],
      "cobit41": [
        "DS11.2",
        "DS11.6"
      ],
      "pci_dss_v2": [
        "9.5",
        "9.6"
      ],
      "joomla_id": 125
    },
    {
      "id": "MP-05",
      "name": "Media Transport",
      "family": "MP",
      "family_name": "Media Protection",
      "control_class": "Operational",
      "description": "The organization protects and controls information system media during transport outside of controlled areas and restricts the activities associated with transport of such media to authorized personnel.\\n",
      "supplemental_guidance": "Information system media includes both digital media (e.g., diskettes, tapes, removable hard drives, flash/thumb drives, compact disks, digital video disks) and non- digital media (e.g., paper, microfilm). A controlled area is any area or space for which the organization has confidence that the physical and procedural protections provided are sufficient to meet the requirements established for protecting the information and/or information system. This control also applies to portable and mobile computing and communications devices with information storage capability (e.g., notebook computers, personal digital assistants, cellular telephones) that are transported outside of controlled areas. Telephone systems are also considered information systems and may have the capability to store information on internal media (e.g., on voicemail systems). Since telephone systems do not have, in most cases, the identification, authentication, and access control mechanisms typically employed in other information systems, organizational personnel exercise extreme caution in the types of information stored on telephone voicemail systems that are transported outside of controlled areas. An organizational assessment of risk guides the selection of media and associated information contained on that media requiring protection during transport. Organizations document in policy and procedures, the media requiring protection during transport and the specific measures taken to protect such transported media. The rigor with which this control is applied is commensurate with the FIPS 199 security categorization of the information contained on the media. An organizational assessment of risk also guides the selection and use of appropriate storage containers for transporting non-digital media. Authorized transport and courier personnel may include individuals from outside the organization (e.g., U.S. Postal Service or a commercial transport or delivery service).\\n",
      "enhancements": "\\n",
      "baseline_low": true,
      "baseline_moderate": true,
      "baseline_high": true,
      "iso17799": [
        "10.8.3"
      ],
      "cobit41": [
        "DS11.4",
        "DS11.6"
      ],
      "pci_dss_v2": [
        "9.7.2"
      ],
      "joomla_id": 126
    },
    {
      "id": "MP-06",
      "name": "Media Sanitization And Disposal",
      "family": "MP",
      "family_name": "Media Protection",
      "control_class": "Operational",
      "description": "The organization sanitizes information system media, both digital and non-digital, prior to disposal or release for reuse.\\n",
      "supplemental_guidance": "Sanitization is the process used to remove information from information system media such that there is reasonable assurance, in proportion to the confidentiality of the information, that the information cannot be retrieved or reconstructed. Sanitization techniques, including clearing, purging, and destroying media information, prevent the disclosure of organizational information to unauthorized individuals when such media is reused or disposed. The organization uses its discretion on sanitization techniques and procedures for media containing information deemed to be in the public domain or publicly releasable, or deemed to have no adverse impact on the organization or individuals if released for reuse or disposed. NIST Special Publication 800-88 provides guidance on media sanitization. The National Security Agency also provides media sanitization guidance and maintains a listing of approved sanitization products at http://www.nsa.gov/ia/government/mdg.cfm.\\n",
      "enhancements": "\\n",
      "baseline_low": true,
      "baseline_moderate": true,
      "baseline_high": true,
      "iso17799": [
        "9.2.6",
        "10.7.1",
        "10.7.2"
      ],
      "cobit41": [
        "DS11.4",
        "DS11.6"
      ],
      "pci_dss_v2": [
        "9.10",
        "9.10.1",
        "9.10.2"
      ],
      "joomla_id": 127
    },
    {
      "id": "MA-01",
      "name": "System Maintenance Policy And Procedures",
      "family": "MA",
      "family_name": "Maintenance",
      "control_class": "Operational",
      "description": "The organization develops, disseminates, and periodically reviews/updates: (i) a formal, documented, information system maintenance policy that addresses purpose, scope, roles, responsibilities, management commitment, coordination among organizational entities, and compliance; and (ii) formal, documented procedures to facilitate the implementation of the information system maintenance policy and associated system maintenance controls.\\n",
      "supplemental_guidance": "The information system maintenance policy and procedures are consistent with applicable laws, Executive Orders, directives, policies, regulations, standards, and guidance. The information system maintenance policy can be included as part of the general information security policy for the organization. System maintenance procedures can be developed for the security program in general, and for a particular information system, when required. NIST Special Publication 800-12 provides guidance on security policies and procedures.\\n",
      "enhancements": "(0) None.\\n",
      "baseline_low": true,
      "baseline_moderate": true,
      "baseline_high": true,
      "iso17799": [
        "10.1.1",
        "15.1.1"
      ],
      "cobit41": [
        "PC5"
      ],
      "pci_dss_v2": [
        "None."
      ],
      "joomla_id": 128
    },
    {
      "id": "MA-02",
      "name": "Controlled Maintenance",
      "family": "MA",
      "family_name": "Maintenance",
      "control_class": "Operational",
      "description": "The organization schedules, performs, documents, and reviews records of routine preventative and regular maintenance (including repairs) on the components of the information system in accordance with manufacturer or vendor specifications and/or organizational requirements.\\n",
      "supplemental_guidance": "All maintenance activities to include routine, scheduled maintenance and repairs are controlled; whether performed on site or remotely and whether the equipment is serviced on site or removed to another location. Organizational officials approve the removal of the information system or information system components from the facility when repairs are necessary. If the information system or component of the system requires off-site repair, the organization removes all information from associated media using approved procedures. After maintenance is performed on the information system, the organization checks all potentially impacted security controls to verify that the controls are still functioning properly.\\n",
      "enhancements": "\\n",
      "baseline_low": true,
      "baseline_moderate": true,
      "baseline_high": true,
      "iso17799": [
        "9.2.4"
      ],
      "cobit41": [
        "AI2.10"
      ],
      "pci_dss_v2": [
        "9.8"
      ],
      "joomla_id": 129
    },
    {
      "id": "MA-03",
      "name": "Maintenance Tools",
      "family": "MA",
      "family_name": "Maintenance",
      "control_class": "Operational",
      "description": "The organization approves, controls, and monitors the use of information system maintenance tools and maintains the tools on an ongoing basis.\\n",
      "supplemental_guidance": "The intent of this control is to address hardware and software brought into the information system specifically for diagnostic/repair actions (e.g., a hardware or software packet sniffer that is introduced for the purpose of a particular maintenance activity). Hardware and/or software components that may support information system maintenance, yet are a part of the system (e.g., the software implementing â€œping,â€ â€œls,â€ â€œipconfig,â€ or the hardware and software implementing the monitoring port of an Ethernet switch) are not covered by this control.\\n",
      "enhancements": "\\n",
      "baseline_low": true,
      "baseline_moderate": true,
      "baseline_high": true,
      "iso17799": [
        "None."
      ],
      "cobit41": [
        "None."
      ],
      "pci_dss_v2": [
        "None."
      ],
      "joomla_id": 130
    },
    {
      "id": "MA-04",
      "name": "Remote Maintenance",
      "family": "MA",
      "family_name": "Maintenance",
      "control_class": "Operational",
      "description": "The organization authorizes, monitors, and controls any remotely executed maintenance and diagnostic activities, if employed.\\n",
      "supplemental_guidance": "Remote maintenance and diagnostic activities are conducted by individuals communicating through an external, non-organization-controlled network (e.g., the Internet). The use of remote maintenance and diagnostic tools is consistent with organizational policy and documented in the security plan for the information system. The organization maintains records for all remote maintenance and diagnostic activities. Other techniques and/or controls to consider for improving the security of remote maintenance include: (i) encryption and decryption of communications; (ii) strong identification and authentication techniques, such as Level 3 or 4 tokens as described in NIST Special Publication 800-63; and (iii) remote disconnect verification. When remote maintenance is completed, the organization (or information system in certain cases) terminates all sessions and remote connections invoked in the performance of that activity. If password-based authentication is used to accomplish remote maintenance, the organization changes the passwords following each remote maintenance service. NIST Special Publication 800-88 provides guidance on media sanitization. The National Security Agency provides a listing of approved media sanitization products at http://www.nsa.gov/ia/government/mdg.cfm. Related security controls: IA-2, MP-6.\\n",
      "enhancements": "\\n",
      "baseline_low": true,
      "baseline_moderate": true,
      "baseline_high": true,
      "iso17799": [
        "11.4.4"
      ],
      "cobit41": [
        "None."
      ],
      "pci_dss_v2": [
        "8.5.6"
      ],
      "joomla_id": 131
    },
    {
      "id": "MA-05",
      "name": "Maintenance Personnel",
      "family": "MA",
      "family_name": "Maintenance",
      "control_class": "Operational",
      "description": "The organization allows only authorized personnel to perform maintenance on the information system.\\n",
      "supplemental_guidance": "Maintenance personnel (whether performing maintenance locally or remotely) have appropriate access authorizations to the information system when maintenance activities allow access to organizational information or could result in a future compromise of confidentiality, integrity, or availability. When maintenance personnel do not have needed access authorizations, organizational personnel with appropriate access authorizations supervise maintenance personnel during the performance of maintenance activities on the information system.\\n",
      "enhancements": "(0) None.\\n",
      "baseline_low": true,
      "baseline_moderate": true,
      "baseline_high": true,
      "iso17799": [
        "6.2.3",
        "9.2.4"
      ],
      "cobit41": [
        "None."
      ],
      "pci_dss_v2": [
        "8.5.6"
      ],
      "joomla_id": 132
    },
    {
      "id": "MA-06",
      "name": "Timely Maintenance",
      "family": "MA",
      "family_name": "Maintenance",
      "control_class": "Operational",
      "description": "The organization obtains maintenance support and spare parts for [Assignment: organization-defined list of key information system components] within [Assignment: organization-defined time period] of failure.\\n",
      "supplemental_guidance": "None.\\n",
      "enhancements": "(0) None.\\n",
      "baseline_low": true,
      "baseline_moderate": true,
      "baseline_high": true,
      "iso17799": [
        "None."
      ],
      "cobit41": [
        "None."
      ],
      "pci_dss_v2": [
        "None."
      ],
      "joomla_id": 133
    },
    {
      "id": "IR-01",
      "name": "Incident Response Policy And Procedures",
      "family": "IR",
      "family_name": "Incident Response",
      "control_class": "Operational",
      "description": "The organization develops, disseminates, and periodically reviews/updates: (i) a formal, documented, incident response policy that addresses purpose, scope, roles, responsibilities, management commitment, coordination among organizational entities, and compliance; and (ii) formal, documented procedures to facilitate the implementation of the incident response policy and associated incident response controls.\\n",
      "supplemental_guidance": "The incident response policy and procedures are consistent with applicable laws, Executive Orders, directives, policies, regulations, standards, and guidance. The incident response policy can be included as part of the general information security policy for the organization. Incident response procedures can be developed for the security program in general, and for a particular information system, when required. NIST Special Publication 800-12 provides guidance on security policies and procedures. NIST Special Publication 800-61 provides guidance on incident handling and reporting. NIST Special Publication 800-83 provides guidance on malware incident handling and prevention.\\n",
      "enhancements": "(0) None.\\n",
      "baseline_low": true,
      "baseline_moderate": true,
      "baseline_high": true,
      "iso17799": [
        "10.4.1",
        "13.1",
        "13.2.1",
        "15.1.1"
      ],
      "cobit41": [
        "PO9.5",
        "PO9.6",
        "DS5.6",
        "DS8.2",
        "PC5"
      ],
      "pci_dss_v2": [
        "12.9"
      ],
      "joomla_id": 135
    },
    {
      "id": "IR-02",
      "name": "Incident Response Training",
      "family": "IR",
      "family_name": "Incident Response",
      "control_class": "Operational",
      "description": "The organization trains personnel in their incident response roles and responsibilities with respect to the information system and provides refresher training [Assignment: organization- defined frequency, at least annually].\\n",
      "supplemental_guidance": "None.\\n",
      "enhancements": "\\n",
      "baseline_low": true,
      "baseline_moderate": true,
      "baseline_high": true,
      "iso17799": [
        "13.1.1"
      ],
      "cobit41": [
        "None."
      ],
      "pci_dss_v2": [
        "12.9.4"
      ],
      "joomla_id": 136
    },
    {
      "id": "IR-03",
      "name": "Incident Response Testing And Exercises",
      "family": "IR",
      "family_name": "Incident Response",
      "control_class": "Operational",
      "description": "The organization tests and/or exercises the incident response capability for the information system [Assignment: organization-defined frequency, at least annually] using [Assignment: organization-defined tests and/or exercises] to determine the incident response effectiveness and documents the results.\\n",
      "supplemental_guidance": "NIST Special Publication 800-84 provides guidance on test, training, and exercise programs for information technology plans and capabilities.\\n",
      "enhancements": "\\n",
      "baseline_low": true,
      "baseline_moderate": true,
      "baseline_high": true,
      "iso17799": [
        "14.1.5"
      ],
      "cobit41": [
        "None."
      ],
      "pci_dss_v2": [
        "12.9.2"
      ],
      "joomla_id": 137
    },
    {
      "id": "IR-04",
      "name": "Incident Handling",
      "family": "IR",
      "family_name": "Incident Response",
      "control_class": "Operational",
      "description": "The organization implements an incident handling capability for security incidents that includes preparation, detection and analysis, containment, eradication, and recovery.\\n",
      "supplemental_guidance": "Incident-related information can be obtained from a variety of sources including, but not limited to, audit monitoring, network monitoring, physical access monitoring, and user/administrator reports. The organization incorporates the lessons learned from ongoing incident handling activities into the incident response procedures and implements the procedures accordingly. Related security controls: AU-6, PE-6.\\n",
      "enhancements": "(1) The organization employs automated mechanisms to support the incident handling process.\\n",
      "baseline_low": true,
      "baseline_moderate": true,
      "baseline_high": true,
      "iso17799": [
        "6.1.6",
        "13.2.1",
        "13.2.2"
      ],
      "cobit41": [
        "PO9.5",
        "PO9.6",
        "DS8.2"
      ],
      "pci_dss_v2": [
        "12.9",
        "12.9.1",
        "12.9.6"
      ],
      "joomla_id": 138
    },
    {
      "id": "IR-05",
      "name": "Incident Monitoring",
      "family": "IR",
      "family_name": "Incident Response",
      "control_class": "Operational",
      "description": "The organization tracks and documents information system security incidents on an ongoing basis.\\n",
      "supplemental_guidance": "None.\\n",
      "enhancements": "(1) The organization employs automated mechanisms to assist in the tracking of security incidents and in the collection and analysis of incident information.\\n",
      "baseline_low": true,
      "baseline_moderate": true,
      "baseline_high": true,
      "iso17799": [
        "None."
      ],
      "cobit41": [
        "DS8.2",
        "DS8.4"
      ],
      "pci_dss_v2": [
        "12.9.5"
      ],
      "joomla_id": 139
    },
    {
      "id": "IR-06",
      "name": "Incident Reporting",
      "family": "IR",
      "family_name": "Incident Response",
      "control_class": "Operational",
      "description": "The organization promptly reports incident information to appropriate authorities.\\n",
      "supplemental_guidance": "The types of incident information reported, the content and timeliness of the reports, and the list of designated reporting authorities or organizations are consistent with applicable laws, Executive Orders, directives, policies, regulations, standards, and guidance. Organizational officials report cyber security incidents to the United States Computer Emergency Readiness Team (US-CERT) at http://www.us-cert.gov within the specified timeframe designated in the US-CERT Concept of Operations for Federal Cyber Security Incident Handling. In addition to incident information, weaknesses and vulnerabilities in the information system are reported to appropriate organizational officials in a timely manner to prevent security incidents. NIST Special Publication 800-61 provides guidance on incident reporting.\\n",
      "enhancements": "(1) The organization employs automated mechanisms to assist in the reporting of security incidents.\\n",
      "baseline_low": true,
      "baseline_moderate": true,
      "baseline_high": true,
      "iso17799": [
        "6.1.6",
        "6.2.2",
        "6.2.3",
        "13.1.1",
        "13.1.2"
      ],
      "cobit41": [
        "DS5.6"
      ],
      "pci_dss_v2": [
        "12.9.1"
      ],
      "joomla_id": 140
    },
    {
      "id": "IR-07",
      "name": "Incident Response Assistance",
      "family": "IR",
      "family_name": "Incident Response",
      "control_class": "Operational",
      "description": "The organization provides an incident response support resource that offers advice and assistance to users of the information system for the handling and reporting of security incidents. The support resource is an integral part of the organizationâ€™s incident response capability.\\n",
      "supplemental_guidance": "Possible implementations of incident response support resources in an organization include a help desk or an assistance group and access to forensics services, when required.\\n",
      "enhancements": "(1) The organization employs automated mechanisms to increase the availability of incident response- related information and support.\\n",
      "baseline_low": true,
      "baseline_moderate": true,
      "baseline_high": true,
      "iso17799": [
        "14.1.3"
      ],
      "cobit41": [
        "DS8.1"
      ],
      "pci_dss_v2": [
        "12.9.3"
      ],
      "joomla_id": 141
    },
    {
      "id": "CP-01",
      "name": "Contingency Planning Policy And Procedures",
      "family": "CP",
      "family_name": "Contingency Planning",
      "control_class": "Operational",
      "description": "The organization develops, disseminates, and periodically reviews/updates: (i) a formal, documented, contingency planning policy that addresses purpose, scope, roles, responsibilities, management commitment, coordination among organizational entities, and compliance; and (ii) formal, documented procedures to facilitate the implementation of the contingency planning policy and associated contingency planning controls.\\n",
      "supplemental_guidance": "The contingency planning policy and procedures are consistent with applicable laws, Executive Orders, directives, policies, regulations, standards, and guidance. The contingency planning policy can be included as part of the general information security policy for the organization. Contingency planning procedures can be developed for the security program in general, and for a particular information system, when required. NIST Special Publication 800-34 provides guidance on contingency planning. NIST Special Publication 800-12 provides guidance on security policies and procedures.\\n",
      "enhancements": "(0) None.\\n",
      "baseline_low": true,
      "baseline_moderate": true,
      "baseline_high": true,
      "iso17799": [
        "5.1.1",
        "10.4.1",
        "14.1.1",
        "14.1.3",
        "15.1.1"
      ],
      "cobit41": [
        "DS4.1",
        "PC5"
      ],
      "pci_dss_v2": [
        "12.9",
        "12.9.1"
      ],
      "joomla_id": 142
    },
    {
      "id": "CP-02",
      "name": "Contingency Plan",
      "family": "CP",
      "family_name": "Contingency Planning",
      "control_class": "Operational",
      "description": "The organization develops and implements a contingency plan for the information system addressing contingency roles, responsibilities, assigned individuals with contact information, and activities associated with restoring the system after a disruption or failure. Designated officials within the organization review and approve the contingency plan and distribute copies of the plan to key contingency personnel.\\n",
      "supplemental_guidance": "None.\\n",
      "enhancements": "\\n",
      "baseline_low": true,
      "baseline_moderate": true,
      "baseline_high": true,
      "iso17799": [
        "10.3.2",
        "10.4.1",
        "10.8.5",
        "14.1.3",
        "14.1.4"
      ],
      "cobit41": [
        "DS4.2"
      ],
      "pci_dss_v2": [
        "12.9.1",
        "12.9.2"
      ],
      "joomla_id": 143
    },
    {
      "id": "CP-03",
      "name": "Contingency Training",
      "family": "CP",
      "family_name": "Contingency Planning",
      "control_class": "Operational",
      "description": "The organization trains personnel in their contingency roles and responsibilities with respect to the information system and provides refresher training [Assignment: organization- defined frequency, at least annually].\\n",
      "supplemental_guidance": "None.\\n",
      "enhancements": "\\n",
      "baseline_low": true,
      "baseline_moderate": true,
      "baseline_high": true,
      "iso17799": [
        "14.1.3",
        "14.1.4"
      ],
      "cobit41": [
        "DS4.6"
      ],
      "pci_dss_v2": [
        "12.9.4"
      ],
      "joomla_id": 144
    },
    {
      "id": "CP-04",
      "name": "Contingency Plan Testing And Exercises",
      "family": "CP",
      "family_name": "Contingency Planning",
      "control_class": "Operational",
      "description": "The organization: (i) tests and/or exercises the contingency plan for the information system [Assignment: organization-defined frequency, at least annually] using [Assignment: organization-defined tests and/or exercises] to determine the planâ€™s effectiveness and the organizationâ€™s readiness to execute the plan; and (ii) reviews the contingency plan test/exercise results and initiates corrective actions.\\n",
      "supplemental_guidance": "There are several methods for testing and/or exercising contingency plans to identify potential weaknesses (e.g., full-scale contingency plan testing, functional/tabletop exercises). The depth and rigor of contingency plan testing and/or exercises increases with the FIPS 199 impact level of the information system. Contingency plan testing and/or exercises also include a determination of the effects on organizational operations and assets (e.g., reduction in mission capability) and individuals arising due to contingency operations in accordance with the plan. NIST Special Publication 800-84 provides guidance on test, training, and exercise programs for information technology plans and capabilities.\\n",
      "enhancements": "\\n",
      "baseline_low": true,
      "baseline_moderate": true,
      "baseline_high": true,
      "iso17799": [
        "10.5.1",
        "14.1.5"
      ],
      "cobit41": [
        "DS4.2",
        "DS4.5"
      ],
      "pci_dss_v2": [
        "12.9.2"
      ],
      "joomla_id": 145
    },
    {
      "id": "CP-05",
      "name": "Contingency Plan Update",
      "family": "CP",
      "family_name": "Contingency Planning",
      "control_class": "Operational",
      "description": "The organization reviews the contingency plan for the information system [Assignment: organization-defined frequency, at least annually] and revises the plan to address system/organizational changes or problems encountered during plan implementation, execution, or testing.\\n",
      "supplemental_guidance": "Organizational changes include changes in mission, functions, or business processes supported by the information system. The organization communicates changes to appropriate organizational elements responsible for related plans (e.g., Business Continuity Plan, Disaster Recovery Plan, Continuity of Operations Plan, Business Recovery Plan, Incident Response Plan, Emergency Action Plan).\\n",
      "enhancements": "(0) None.\\n",
      "baseline_low": true,
      "baseline_moderate": true,
      "baseline_high": true,
      "iso17799": [
        "14.1.3",
        "14.1.5"
      ],
      "cobit41": [
        "DS4.4"
      ],
      "pci_dss_v2": [
        "12.9.6"
      ],
      "joomla_id": 146
    },
    {
      "id": "CP-06",
      "name": "Alternate Storage Site",
      "family": "CP",
      "family_name": "Contingency Planning",
      "control_class": "Operational",
      "description": "The organization identifies an alternate storage site and initiates necessary agreements to permit the storage of information system backup information.\\n",
      "supplemental_guidance": "The frequency of information system backups and the transfer rate of backup information to the alternate storage site (if so designated) are consistent with the organizationâ€™s recovery time objectives and recovery point objectives.\\n",
      "enhancements": "\\n",
      "baseline_low": true,
      "baseline_moderate": true,
      "baseline_high": true,
      "iso17799": [
        "10.5.1"
      ],
      "cobit41": [
        "DS4.1",
        "DS4.9"
      ],
      "pci_dss_v2": [
        "None."
      ],
      "joomla_id": 147
    },
    {
      "id": "CP-07",
      "name": "Alternate Processing Site",
      "family": "CP",
      "family_name": "Contingency Planning",
      "control_class": "Operational",
      "description": "The organization identifies an alternate processing site and initiates necessary agreements to permit the resumption of information system operations for critical mission/business functions within [Assignment: organization-defined time period] when the primary processing capabilities are unavailable.\\n",
      "supplemental_guidance": "Equipment and supplies required to resume operations within the organization-defined time period are either available at the alternate site or contracts are in place to support delivery to the site. Timeframes to resume information system operations are consistent with organization-established recovery time objectives.\\n",
      "enhancements": "\\n",
      "baseline_low": true,
      "baseline_moderate": true,
      "baseline_high": true,
      "iso17799": [
        "14.1.4"
      ],
      "cobit41": [
        "DS4.1",
        "DS4.8"
      ],
      "pci_dss_v2": [
        "None."
      ],
      "joomla_id": 148
    },
    {
      "id": "CP-08",
      "name": "Telecommunications Services",
      "family": "CP",
      "family_name": "Contingency Planning",
      "control_class": "Operational",
      "description": "The organization identifies primary and alternate telecommunications services to support the information system and initiates necessary agreements to permit the resumption of system operations for critical mission/business functions within [Assignment: organization-defined time period] when the primary telecommunications capabilities are unavailable.\\n",
      "supplemental_guidance": "In the event that the primary and/or alternate telecommunications services are provided by a common carrier, the organization requests Telecommunications Service Priority (TSP) for all telecommunications services used for national security emergency preparedness (see http://tsp.ncs.gov for a full explanation of the TSP program).\\n",
      "enhancements": "\\n",
      "baseline_low": true,
      "baseline_moderate": true,
      "baseline_high": true,
      "iso17799": [
        "14.1.4"
      ],
      "cobit41": [
        "DS4.1"
      ],
      "pci_dss_v2": [
        "None."
      ],
      "joomla_id": 149
    },
    {
      "id": "CP-09",
      "name": "Information System Backup",
      "family": "CP",
      "family_name": "Contingency Planning",
      "control_class": "Operational",
      "description": "The organization conducts backups of user-level and system-level information (including system state information) contained in the information system [Assignment: organization-defined frequency] and protects backup information at the storage location.\\n",
      "supplemental_guidance": "The frequency of information system backups and the transfer rate of backup information to alternate storage sites (if so designated) are consistent with the organizationâ€™s recovery time objectives and recovery point objectives. While integrity and availability are the primary concerns for system backup information, protecting backup information from unauthorized disclosure is also an important consideration depending on the type of information residing on the backup media and the FIPS 199 impact level. An organizational assessment of risk guides the use of encryption for backup information. The protection of system backup information while in transit is beyond the scope of this control. Related security controls: MP-4, MP-5.\\n",
      "enhancements": "\\n",
      "baseline_low": true,
      "baseline_moderate": true,
      "baseline_high": true,
      "iso17799": [
        "10.5.1",
        "11.7.1"
      ],
      "cobit41": [
        "DS4.2",
        "DS4.9",
        "DS11.5"
      ],
      "pci_dss_v2": [
        "12.9.1a"
      ],
      "joomla_id": 150
    },
    {
      "id": "CP-10",
      "name": "Information System Recovery And Reconstitution",
      "family": "CP",
      "family_name": "Contingency Planning",
      "control_class": "Operational",
      "description": "The organization employs mechanisms with supporting procedures to allow the information system to be recovered and reconstituted to a known secure state after a disruption or failure.\\n",
      "supplemental_guidance": "Information system recovery and reconstitution to a known secure state means that all system parameters (either default or organization-established) are set to secure values, security-critical patches are reinstalled, security-related configuration settings are reestablished, system documentation and operating procedures are available, application and system software is reinstalled and configured with secure settings, information from the most recent, known secure backups is loaded, and the system is fully tested.\\n",
      "enhancements": "(1) The organization includes a full recovery and reconstitution of the information system as part of contingency plan testing.\\n",
      "baseline_low": true,
      "baseline_moderate": true,
      "baseline_high": true,
      "iso17799": [
        "14.1.4"
      ],
      "cobit41": [
        "DS4.8",
        "DS11.5"
      ],
      "pci_dss_v2": [
        "None."
      ],
      "joomla_id": 151
    },
    {
      "id": "CM-01",
      "name": "Configuration Management Policy And Procedures",
      "family": "CM",
      "family_name": "Configuration Management",
      "control_class": "Operational",
      "description": "The organization develops, disseminates, and periodically reviews/updates: (i) a formal, documented, configuration management policy that addresses purpose, scope, roles, responsibilities, management commitment, coordination among organizational entities, and compliance; and (ii) formal, documented procedures to facilitate the implementation of the configuration management policy and associated configuration management controls.\\n",
      "supplemental_guidance": "The configuration management policy and procedures are consistent with applicable laws, Executive Orders, directives, policies, regulations, standards, and guidance. The configuration management policy can be included as part of the general information security policy for the organization. Configuration management procedures can be developed for the security program in general, and for a particular information system, when required. NIST Special Publication 800-12 provides guidance on security policies and procedures.\\n",
      "enhancements": "(0) None.\\n",
      "baseline_low": true,
      "baseline_moderate": true,
      "baseline_high": true,
      "iso17799": [
        "12.4.1",
        "12.5.1",
        "15.1.1"
      ],
      "cobit41": [
        "PO2.1",
        "AI6.1",
        "DS9.1",
        "PC5"
      ],
      "pci_dss_v2": [
        "2.2a"
      ],
      "joomla_id": 152
    },
    {
      "id": "CM-02",
      "name": "Baseline Configuration",
      "family": "CM",
      "family_name": "Configuration Management",
      "control_class": "Operational",
      "description": "The organization develops, documents, and maintains a current baseline configuration of the information system.\\n",
      "supplemental_guidance": "This control establishes a baseline configuration for the information system. The baseline configuration provides information about a particular componentâ€™s makeup (e.g., the standard software load for a workstation or notebook computer including updated patch information) and the componentâ€™s logical placement within the information system architecture. The baseline configuration also provides the organization with a well-defined and documented specification to which the information system is built and deviations, if required, are documented in support of mission needs/objectives. The baseline configuration of the information system is consistent with the Federal Enterprise Architecture. Related security controls: CM-6, CM-8.\\n",
      "enhancements": "\\n",
      "baseline_low": true,
      "baseline_moderate": true,
      "baseline_high": true,
      "iso17799": [
        "7.1.1",
        "15.1.2"
      ],
      "cobit41": [
        "PO1.6",
        "PO2.1",
        "DS9.1"
      ],
      "pci_dss_v2": [
        "2.2",
        "2.1.1"
      ],
      "joomla_id": 153
    },
    {
      "id": "CM-03",
      "name": "Configuration Change Control",
      "family": "CM",
      "family_name": "Configuration Management",
      "control_class": "Operational",
      "description": "The organization authorizes, documents, and controls changes to the information system.\\n",
      "supplemental_guidance": "The organization manages configuration changes to the information system using an organizationally approved process (e.g., a chartered Configuration Control Board). Configuration change control involves the systematic proposal, justification, implementation, test/evaluation, review, and disposition of changes to the information system, including upgrades and modifications. Configuration change control includes changes to the configuration settings for information technology products (e.g., operating systems, firewalls, routers). The organization includes emergency changes in the configuration change control process, including changes resulting from the remediation of flaws. The approvals to implement a change to the information system include successful results from the security analysis of the change. The organization audits activities associated with configuration changes to the information system. Related security controls: CM-4, CM-6, SI-2.\\n",
      "enhancements": "(1) The organization employs automated mechanisms to: (i) document proposed changes to the information system; (ii) notify appropriate approval authorities; (iii) highlight approvals that have not been received in a timely manner; (iv) inhibit change until necessary approvals are received; and (v) document completed changes to the information system.\\n",
      "baseline_low": true,
      "baseline_moderate": true,
      "baseline_high": true,
      "iso17799": [
        "10.1.2",
        "10.2.3",
        "12.4.1",
        "12.5.1",
        "12.5.2",
        "12.5.3"
      ],
      "cobit41": [
        "AI6.1",
        "AI6.3",
        "DS9.2"
      ],
      "pci_dss_v2": [
        "6.4"
      ],
      "joomla_id": 154
    },
    {
      "id": "CM-04",
      "name": "Monitoring Configuration Changes",
      "family": "CM",
      "family_name": "Configuration Management",
      "control_class": "Operational",
      "description": "The organization monitors changes to the information system conducting security impact analyses to determine the effects of the changes.\\n",
      "supplemental_guidance": "Prior to change implementation, and as part of the change approval process, the organization analyzes changes to the information system for potential security impacts. After the information system is changed (including upgrades and modifications), the organization checks the security features to verify that the features are still functioning properly. The organization audits activities associated with configuration changes to the information system. Monitoring configuration changes and conducting security impact analyses are important elements with regard to the ongoing assessment of security controls in the information system. Related security control: CA-7.\\n",
      "enhancements": "(0) None.\\n",
      "baseline_low": true,
      "baseline_moderate": true,
      "baseline_high": true,
      "iso17799": [
        "10.1.2"
      ],
      "cobit41": [
        "DS5.5",
        "DS9.3"
      ],
      "pci_dss_v2": [
        "11.5"
      ],
      "joomla_id": 155
    },
    {
      "id": "CM-05",
      "name": "Access Restrictions For Change",
      "family": "CM",
      "family_name": "Configuration Management",
      "control_class": "Operational",
      "description": "The organization: (i) approves individual access privileges and enforces physical and logical access restrictions associated with changes to the information system; and (ii) generates, retains, and reviews records reflecting all such changes.\\n",
      "supplemental_guidance": "Planned or unplanned changes to the hardware, software, and/or firmware components of the information system can have significant effects on the overall security of the system. Accordingly, only qualified and authorized individuals obtain access to information system components for purposes of initiating changes, including upgrades, and modifications.\\n",
      "enhancements": "(1) The organization employs automated mechanisms to enforce access restrictions and support auditing of the enforcement actions.\\n",
      "baseline_low": true,
      "baseline_moderate": true,
      "baseline_high": true,
      "iso17799": [
        "11.6.1"
      ],
      "cobit41": [
        "None."
      ],
      "pci_dss_v2": [
        "2.2"
      ],
      "joomla_id": 156
    },
    {
      "id": "CM-06",
      "name": "Configuration Settings",
      "family": "CM",
      "family_name": "Configuration Management",
      "control_class": "Operational",
      "description": "The organization: (i) establishes mandatory configuration settings for information technology products employed within the information system; (ii) configures the security settings of information technology products to the most restrictive mode consistent with operational requirements; (iii) documents the configuration settings; and (iv) enforces the configuration settings in all components of the information system.\\n",
      "supplemental_guidance": "Configuration settings are the configurable parameters of the information technology products that compose the information system. Organizations monitor and control changes to the configuration settings in accordance with organizational policies and procedures. OMB FISMA reporting instructions provide guidance on configuration requirements for federal information systems. NIST Special Publication 800-70 provides guidance on producing and using configuration settings for information technology products employed in organizational information systems. Related security controls: CM-2, CM-3, SI-4.\\n",
      "enhancements": "(1) The organization employs automated mechanisms to centrally manage, apply, and verify configuration settings.\\n",
      "baseline_low": true,
      "baseline_moderate": true,
      "baseline_high": true,
      "iso17799": [
        "None."
      ],
      "cobit41": [
        "None."
      ],
      "pci_dss_v2": [
        "2.2",
        "2.2.3"
      ],
      "joomla_id": 157
    },
    {
      "id": "CM-07",
      "name": "Least Functionality",
      "family": "CM",
      "family_name": "Configuration Management",
      "control_class": "Operational",
      "description": "The organization configures the information system to provide only essential capabilities and specifically prohibits and/or restricts the use of the following functions, ports, protocols, and/or services: [Assignment: organization-defined list of prohibited and/or restricted functions, ports, protocols, and/or services].\\n",
      "supplemental_guidance": "Information systems are capable of providing a wide variety of functions and services. Some of the functions and services, provided by default, may not be necessary to support essential organizational operations (e.g., key missions, functions). Additionally, it is sometimes convenient to provide multiple services from a single component of an information system, but doing so increases risk over limiting the services provided by any one component. Where feasible, the organization limits component functionality to a single function per device (e.g., email server or web server, not both). The functions and services provided by information systems, or individual components of information systems, are carefully reviewed to determine which functions and services are candidates for elimination (e.g., Voice Over Internet Protocol, Instant Messaging, File Transfer Protocol, Hyper Text Transfer Protocol, file sharing).\\n",
      "enhancements": "(1) The organization reviews the information system [Assignment: organization-defined frequency], to identify and eliminate unnecessary functions, ports, protocols, and/or services.\\n",
      "baseline_low": true,
      "baseline_moderate": true,
      "baseline_high": true,
      "iso17799": [
        "None."
      ],
      "cobit41": [
        "None."
      ],
      "pci_dss_v2": [
        "2.2.2",
        "2.2.4"
      ],
      "joomla_id": 158
    },
    {
      "id": "CM-08",
      "name": "Information System Component Inventory",
      "family": "CM",
      "family_name": "Configuration Management",
      "control_class": "Operational",
      "description": "The organization develops, documents, and maintains a current inventory of the components of the information system and relevant ownership information.\\n",
      "supplemental_guidance": "The organization determines the appropriate level of granularity for the information system components included in the inventory that are subject to management control (i.e., tracking, and reporting). The inventory of information system components includes any information determined to be necessary by the organization to achieve effective property accountability (e.g., manufacturer, model number, serial number, software license information, system/component owner). The component inventory is consistent with the accreditation boundary of the information system. Related security controls: CM-2, CM-6.\\n",
      "enhancements": "\\n",
      "baseline_low": true,
      "baseline_moderate": true,
      "baseline_high": true,
      "iso17799": [
        "7.1.1",
        "15.1.2"
      ],
      "cobit41": [
        "None."
      ],
      "pci_dss_v2": [
        "12.3.3",
        "12.3.4"
      ],
      "joomla_id": 159
    },
    {
      "id": "CA-01",
      "name": "Certification, Accreditation, And Security Assessment Policies And Procedures",
      "family": "CA",
      "family_name": "Security Assessment and Authorization",
      "control_class": "Management",
      "description": "The organization develops, disseminates, and periodically reviews/updates: (i) formal, documented, security assessment and certification and accreditation policies that address purpose, scope, roles, responsibilities, management commitment, coordination among organizational entities, and compliance; and (ii) formal, documented procedures to facilitate the implementation of the security assessment and certification and accreditation policies and associated assessment, certification, and accreditation controls.\\n",
      "supplemental_guidance": "The security assessment and certification and accreditation policies and procedures are consistent with applicable laws, Executive Orders, directives, policies, regulations, standards, and guidance. The security assessment and certification and accreditation policies can be included as part of the general information security policy for the organization. Security assessment and certification and accreditation procedures can be developed for the security program in general, and for a particular information system, when required. The organization defines what constitutes a significant change to the information system to achieve consistent security reaccreditations. NIST Special Publication 800-53A provides guidance on security control assessments. NIST Special Publication 800-37 provides guidance on security certification and accreditation. NIST Special Publication 800-12 provides guidance on security policies and procedures.\\n",
      "enhancements": "(0) None.\\n",
      "baseline_low": true,
      "baseline_moderate": true,
      "baseline_high": true,
      "iso17799": [
        "6.1.4",
        "10.3.2",
        "15.1.1"
      ],
      "cobit41": [
        "PO10.12",
        "PC5"
      ],
      "pci_dss_v2": [
        "12.5.1"
      ],
      "joomla_id": 160
    },
    {
      "id": "CA-02",
      "name": "Security Assessments",
      "family": "CA",
      "family_name": "Security Assessment and Authorization",
      "control_class": "Management",
      "description": "The organization conducts an assessment of the security controls in the information system [Assignment: organization-defined frequency, at least annually] to determine the extent to which the controls are implemented correctly, operating as intended, and producing the desired outcome with respect to meeting the security requirements for the system.\\n",
      "supplemental_guidance": "This control is intended to support the FISMA requirement that the management, operational, and technical controls in each information system contained in the inventory of major information systems be assessed with a frequency depending on risk, but no less than annually. The FISMA requirement for (at least) annual security control assessments should not be interpreted by organizations as adding additional assessment requirements to those requirements already in place in the security certification and accreditation process. To satisfy the annual FISMA assessment requirement, organizations can draw upon the security control assessment results from any of the following sources, including but not limited to: (i) security certifications conducted as part of an information system accreditation or reaccreditation process (see CA-4); (ii) continuous monitoring activities (see CA-7); or (iii) testing and evaluation of the information system as part of the ongoing system development life cycle process (provided that the testing and evaluation results are current and relevant to the determination of security control effectiveness). Existing security assessment results are reused to the extent that they are still valid and are supplemented with additional assessments as needed. Reuse of assessment information is critical in achieving a broad-based, cost-effective, and fully integrated security program capable of producing the needed evidence to determine the actual security status of the information system. OMB does not require an annual assessment of all security controls employed in an organizational information system. In accordance with OMB policy, organizations must annually assess a subset of the security controls based on: (i) the FIPS 199 security categorization of the information system; (ii) the specific security controls selected and employed by the organization to protect the information system; and (iii) the level of assurance (or confidence) that the organization must have in determining the effectiveness of the security controls in the information system. It is expected that the organization will assess all of the security controls in the information system during the three-year accreditation cycle. The organization can use the current yearâ€™s assessment results obtained during security certification to meet the annual FISMA assessment requirement (see CA- 4). NIST Special Publication 800-53A provides guidance on security control assessments to include reuse of existing assessment results. Related security controls: CA-4, CA-6, CA-7, SA- 11.\\n",
      "enhancements": "(0) None.\\n",
      "baseline_low": true,
      "baseline_moderate": true,
      "baseline_high": true,
      "iso17799": [
        "6.1.8",
        "15.2.1",
        "15.2.2"
      ],
      "cobit41": [
        "DS5.5"
      ],
      "pci_dss_v2": [
        "11.1",
        "11.2"
      ],
      "joomla_id": 161
    },
    {
      "id": "CA-03",
      "name": "Information System Connections",
      "family": "CA",
      "family_name": "Security Assessment and Authorization",
      "control_class": "Management",
      "description": "The organization authorizes all connections from the information system to other information systems outside of the accreditation boundary through the use of system connection agreements and monitors/controls the system connections on an ongoing basis.\\n",
      "supplemental_guidance": "Since FIPS 199 security categorizations apply to individual information systems, the organization carefully considers the risks that may be introduced when systems are connected to other information systems with different security requirements and security controls, both within the organization and external to the organization. Risk considerations also include information systems sharing the same networks. NIST Special Publication 800-47 provides guidance on connecting information systems. Related security controls: SC-7, SA-9.\\n",
      "enhancements": "(0) None.\\n",
      "baseline_low": true,
      "baseline_moderate": true,
      "baseline_high": true,
      "iso17799": [
        "10.6.2",
        "10.9.1",
        "11.4.5",
        "11.4.6",
        "11.4.7"
      ],
      "cobit41": [
        "None."
      ],
      "pci_dss_v2": [
        "1.1.5",
        "1.1.6"
      ],
      "joomla_id": 162
    },
    {
      "id": "CA-04",
      "name": "Security Certification",
      "family": "CA",
      "family_name": "Security Assessment and Authorization",
      "control_class": "Management",
      "description": "The organization conducts an assessment of the security controls in the information system to determine the extent to which the controls are implemented correctly, operating as intended, and producing the desired outcome with respect to meeting the security requirements for the system.\\n",
      "supplemental_guidance": "A security certification is conducted by the organization in support of the OMB Circular A-130, Appendix III requirement for accrediting the information system. The security certification is a key factor in all security accreditation (i.e., authorization) decisions and is integrated into and spans the system development life cycle. The organization assesses all security controls in an information system during the initial security accreditation. Subsequent to the initial accreditation and in accordance with OMB policy, the organization assesses a subset of the controls annually during continuous monitoring (see CA-7). The organization can use the current yearâ€™s assessment results obtained during security certification to meet the annual FISMA assessment requirement (see CA-2). NIST Special Publication 800-53A provides guidance on security control assessments. NIST Special Publication 800-37 provides guidance on security certification and accreditation. Related security controls: CA-2, CA-6, SA-11.\\n",
      "enhancements": "(1) The organization employs an independent certification agent or certification team to conduct an assessment of the security controls in the information system. Enhancement Supplemental Guidance: An independent certification agent or certification team is any individual or group capable of conducting an impartial assessment of an organizational information system. Impartiality implies that the assessors are free from any perceived or actual conflicts of interest with respect to the developmental, operational, and/or management chain of command associated with the information system or to the determination of security control effectiveness. Independent security certification services can be obtained from other elements within the organization or can be contracted to a public or private sector entity outside of the organization. Contracted certification services are considered independent if the information system owner is not directly involved in the contracting process or cannot unduly influence the independence of the certification agent or certification team conducting the assessment of the security controls in the information system. The authorizing official decides on the required level of certifier independence based on the criticality and sensitivity of the information system and the ultimate risk to organizational operations and organizational assets, and to individuals. The authorizing official determines if the level of certifier independence is sufficient to provide confidence that the assessment results produced are sound and can be used to make a credible, risk-based decision. In special situations, for example when the organization that owns the information system is small or the organizational structure requires that the assessment of the security controls be accomplished by individuals that are in the developmental, operational, and/or management chain of the system owner or authorizing official, independence in the certification process can be achieved by ensuring the assessment results are carefully reviewed and analyzed by an independent team of experts to validate the completeness, consistency, and veracity of the results. The authorizing official should consult with the Office of the Inspector General, the senior agency information security officer, and the chief information officer to fully discuss the implications of any decisions on certifier independence in the types of special circumstances described above.\\n",
      "baseline_low": true,
      "baseline_moderate": true,
      "baseline_high": true,
      "iso17799": [
        "10.3.2"
      ],
      "cobit41": [
        "AI7.7"
      ],
      "pci_dss_v2": [
        "11.3"
      ],
      "joomla_id": 163
    },
    {
      "id": "CA-05",
      "name": "Plan Of Action And Milestones",
      "family": "CA",
      "family_name": "Security Assessment and Authorization",
      "control_class": "Management",
      "description": "The organization develops and updates [Assignment: organization-defined frequency], a plan of action and milestones for the information system that documents the organizationâ€™s planned, implemented, and evaluated remedial actions to correct deficiencies noted during the assessment of the security controls and to reduce or eliminate known vulnerabilities in the system.\\n",
      "supplemental_guidance": "The plan of action and milestones is a key document in the security accreditation package developed for the authorizing official and is subject to federal reporting requirements established by OMB. The plan of action and milestones updates are based on the findings from security control assessments, security impact analyses, and continuous monitoring activities. OMB FISMA reporting guidance contains instructions regarding organizational plans of action and milestones. NIST Special Publication 800-37 provides guidance on the security certification and accreditation of information systems. NIST Special Publication 800-30 provides guidance on risk mitigation.\\n",
      "enhancements": "(0) None.\\n",
      "baseline_low": true,
      "baseline_moderate": true,
      "baseline_high": true,
      "iso17799": [
        "15.2.1"
      ],
      "cobit41": [
        "ME2.7"
      ],
      "pci_dss_v2": [
        "None."
      ],
      "joomla_id": 164
    },
    {
      "id": "CA-06",
      "name": "Security Accreditation",
      "family": "CA",
      "family_name": "Security Assessment and Authorization",
      "control_class": "Management",
      "description": "The organization authorizes (i.e., accredits) the information system for processing before operations and updates the authorization [Assignment: organization-defined frequency, at least every three years] or when there is a significant change to the system. A senior organizational official signs and approves the security accreditation.\\n",
      "supplemental_guidance": "OMB Circular A-130, Appendix III, establishes policy for security accreditations of federal information systems. The organization assesses the security controls employed within the information system before and in support of the security accreditation. Security assessments conducted in support of security accreditations are called security certifications. The security accreditation of an information system is not a static process. Through the employment of a comprehensive continuous monitoring process (the fourth and final phase of the certification and accreditation process), the critical information contained in the accreditation package (i.e., the system security plan, the security assessment report, and the plan of action and milestones) is updated on an ongoing basis providing the authorizing official and the information system owner with an up-to-date status of the security state of the information system. To reduce the administrative burden of the three-year reaccreditation process, the authorizing official uses the results of the ongoing continuous monitoring process to the maximum extent possible as the basis for rendering a reaccreditation decision. NIST Special Publication 800-37 provides guidance on the security certification and accreditation of information systems. Related security controls: CA-2, CA-4, CA-7.\\n",
      "enhancements": "(0) None.\\n",
      "baseline_low": true,
      "baseline_moderate": true,
      "baseline_high": true,
      "iso17799": [
        "10.3.2"
      ],
      "cobit41": [
        "AI7.7",
        "DS5.5"
      ],
      "pci_dss_v2": [
        "None."
      ],
      "joomla_id": 165
    },
    {
      "id": "CA-07",
      "name": "Continuous Monitoring",
      "family": "CA",
      "family_name": "Security Assessment and Authorization",
      "control_class": "Management",
      "description": "The organization monitors the security controls in the information system on an ongoing basis.\\n",
      "supplemental_guidance": "Continuous monitoring activities include configuration management and control of information system components, security impact analyses of changes to the system, ongoing assessment of security controls, and status reporting. The organization assesses all security controls in an information system during the initial security accreditation. Subsequent to the initial accreditation and in accordance with OMB policy, the organization assesses a subset of the controls annually during continuous monitoring. The selection of an appropriate subset of security controls is based on: (i) the FIPS 199 security categorization of the information system; (ii) the specific security controls selected and employed by the organization to protect the information system; and (iii) the level of assurance (or grounds for confidence) that the organization must have in determining the effectiveness of the security controls in the information system. The organization establishes the selection criteria and subsequently selects a subset of the security controls employed within the information system for assessment. The organization also establishes the schedule for control monitoring to ensure adequate coverage is achieved. Those security controls that are volatile or critical to protecting the information system are assessed at least annually. All other controls are assessed at least once during the information systemâ€™s three- year accreditation cycle. The organization can use the current yearâ€™s assessment results obtained during continuous monitoring to meet the annual FISMA assessment requirement (see CA-2). This control is closely related to and mutually supportive of the activities required in monitoring configuration changes to the information system. An effective continuous monitoring program results in ongoing updates to the information system security plan, the security assessment report, and the plan of action and milestonesâ€”the three principle documents in the security accreditation package. A rigorous and well executed continuous monitoring process significantly reduces the level of effort required for the reaccreditation of the information system. NIST Special Publication 800-37 provides guidance on the continuous monitoring process. NIST Special Publication 800-53A provides guidance on the assessment of security controls. Related security controls: CA-2, CA-4, CA-5, CA-6, CM-4.\\n",
      "enhancements": "\\n",
      "baseline_low": true,
      "baseline_moderate": true,
      "baseline_high": true,
      "iso17799": [
        "15.2.1",
        "15.2.2"
      ],
      "cobit41": [
        "PO1.3",
        "DS5.5"
      ],
      "pci_dss_v2": [
        "12.5.2",
        "12.9.5"
      ],
      "joomla_id": 166
    },
    {
      "id": "AT-01",
      "name": "Security Awareness And Training Policy And Procedures",
      "family": "AT",
      "family_name": "Awareness and Training",
      "control_class": "Operational",
      "description": "The organization develops, disseminates, and periodically reviews/updates: (i) a formal, documented, security awareness and training policy that addresses purpose, scope, roles, responsibilities, management commitment, coordination among organizational entities, and compliance; and (ii) formal, documented procedures to facilitate the implementation of the security awareness and training policy and associated security awareness and training controls.\\n",
      "supplemental_guidance": "The security awareness and training policy and procedures are consistent with applicable laws, Executive Orders, directives, policies, regulations, standards, and guidance. The security awareness and training policy can be included as part of the general information security policy for the organization. Security awareness and training procedures can be developed for the security program in general, and for a particular information system, when required. NIST Special Publications 800-16 and 800-50 provide guidance on security awareness and training. NIST Special Publication 800-12 provides guidance on security policies and procedures.\\n",
      "enhancements": "(0) None.\\n",
      "baseline_low": true,
      "baseline_moderate": true,
      "baseline_high": true,
      "iso17799": [
        "5.1.1",
        "8.2.2",
        "15.1.1"
      ],
      "cobit41": [
        "DS7.1",
        "PC5"
      ],
      "pci_dss_v2": [
        "12.6"
      ],
      "joomla_id": 167
    },
    {
      "id": "AT-02",
      "name": "Security Awareness",
      "family": "AT",
      "family_name": "Awareness and Training",
      "control_class": "Operational",
      "description": "The organization provides basic security awareness training to all information system users (including managers and senior executives) before authorizing access to the system, when required by system changes, and [Assignment: organization-defined frequency, at least annually] thereafter.\\n",
      "supplemental_guidance": "The organization determines the appropriate content of security awareness training based on the specific requirements of the organization and the information systems to which personnel have authorized access. The organizationâ€™s security awareness program is consistent with the requirements contained in C.F.R. Part 5 Subpart C (5 C.F.R 930.301) and with the guidance in NIST Special Publication 800-50.\\n",
      "enhancements": "(0) None.\\n",
      "baseline_low": true,
      "baseline_moderate": true,
      "baseline_high": true,
      "iso17799": [
        "6.2.3",
        "8.2.2",
        "10.4.1",
        "11.7.1",
        "13.1.1",
        "14.1.4",
        "15.1.4"
      ],
      "cobit41": [
        "PO7.4"
      ],
      "pci_dss_v2": [
        "12.6.1a"
      ],
      "joomla_id": 168
    },
    {
      "id": "AT-03",
      "name": "Security Training",
      "family": "AT",
      "family_name": "Awareness and Training",
      "control_class": "Operational",
      "description": "The organization identifies personnel that have significant information system security roles and responsibilities during the system development life cycle, documents those roles and responsibilities, and provides appropriate information system security training: (i) before authorizing access to the system or performing assigned duties; (ii) when required by system changes; and (iii) [Assignment: organization-defined frequency] thereafter.\\n",
      "supplemental_guidance": "The organization determines the appropriate content of security training based on the specific requirements of the organization and the information systems to which personnel have authorized access. In addition, the organization provides system managers, system and network administrators, and other personnel having access to system-level software, adequate technical training to perform their assigned duties. The organizationâ€™s security training program is consistent with the requirements contained in C.F.R. Part 5 Subpart C (5 C.F.R 930.301) and with the guidance in NIST Special Publication 800-50.\\n",
      "enhancements": "(0) None.\\n",
      "baseline_low": true,
      "baseline_moderate": true,
      "baseline_high": true,
      "iso17799": [
        "8.2.2",
        "10.3.2",
        "11.7.1",
        "13.1.1",
        "14.1.4"
      ],
      "cobit41": [
        "PO7.4",
        "DS7.2"
      ],
      "pci_dss_v2": [
        "12.6.1b",
        "12.9.4"
      ],
      "joomla_id": 169
    },
    {
      "id": "AT-04",
      "name": "Security Training Records",
      "family": "AT",
      "family_name": "Awareness and Training",
      "control_class": "Operational",
      "description": "The organization documents and monitors individual information system security training activities including basic security awareness training and specific information system security training.\\n",
      "supplemental_guidance": "None.\\n",
      "enhancements": "(0) None.\\n",
      "baseline_low": true,
      "baseline_moderate": true,
      "baseline_high": true,
      "iso17799": [
        "None."
      ],
      "cobit41": [
        "DS7.2"
      ],
      "pci_dss_v2": [
        "12.6.2"
      ],
      "joomla_id": 170
    },
    {
      "id": "AT-05",
      "name": "Contacts With Security Groups And Associations",
      "family": "AT",
      "family_name": "Awareness and Training",
      "control_class": "Operational",
      "description": "The organization establishes and maintains contacts with special interest groups, specialized forums, professional associations, news groups, and/or peer groups of security professionals in similar organizations to stay up to date with the latest recommended security practices, techniques, and technologies and to share the latest security-related information including threats, vulnerabilities, and incidents.\\n",
      "supplemental_guidance": "To facilitate ongoing security education and training for organizational personnel in an environment of rapid technology changes and dynamic threats, the organization establishes and institutionalizes contacts with selected groups and associations within the security community. The groups and associations selected are in keeping with the organizationâ€™s mission requirements. Information sharing activities regarding threats, vulnerabilities, and incidents related to information systems are consistent with applicable laws, Executive Orders, directives, policies, regulations, standards, and guidance.\\n",
      "enhancements": "(0) None.\\n",
      "baseline_low": true,
      "baseline_moderate": true,
      "baseline_high": true,
      "iso17799": [
        "6.1.7"
      ],
      "cobit41": [
        "None."
      ],
      "pci_dss_v2": [
        "None."
      ],
      "joomla_id": 171
    },
    {
      "id": "AU-03",
      "name": "Content Of Audit Records",
      "family": "AU",
      "family_name": "Audit and Accountability",
      "control_class": "Technical",
      "description": "The information system produces audit records that contain sufficient information to establish what events occurred, the sources of the events, and the outcomes of the events.\\n",
      "supplemental_guidance": "Audit record content includes, for most audit records: (i) date and time of the event; (ii) the component of the information system (e.g., software component, hardware component) where the event occurred; (iii) type of event; (iv) user/subject identity; and (v) the outcome (success or failure) of the event. NIST Special Publication 800-92 provides guidance on computer security log management.\\n",
      "enhancements": "\\n",
      "baseline_low": true,
      "baseline_moderate": true,
      "baseline_high": true,
      "iso17799": [
        "10.10.1",
        "10.10.4"
      ],
      "cobit41": [
        "None."
      ],
      "pci_dss_v2": [
        "10.3"
      ],
      "joomla_id": 172
    },
    {
      "id": "AU-04",
      "name": "Audit Storage Capacity",
      "family": "AU",
      "family_name": "Audit and Accountability",
      "control_class": "Technical",
      "description": "The organization allocates sufficient audit record storage capacity and configures auditing to reduce the likelihood of such capacity being exceeded.\\n",
      "supplemental_guidance": "The organization provides sufficient audit storage capacity, taking into account the auditing to be performed and the online audit processing requirements. Related security controls: AU-2, AU-5, AU-6, AU-7, SI-4.\\n",
      "enhancements": "(0) None.\\n",
      "baseline_low": true,
      "baseline_moderate": true,
      "baseline_high": true,
      "iso17799": [
        "10.10.3"
      ],
      "cobit41": [
        "None."
      ],
      "pci_dss_v2": [
        "10.7"
      ],
      "joomla_id": 173
    },
    {
      "id": "AU-05",
      "name": "Response To Audit Processing Failures",
      "family": "AU",
      "family_name": "Audit and Accountability",
      "control_class": "Technical",
      "description": "The information system alerts appropriate organizational officials in the event of an audit processing failure and takes the following additional actions: [Assignment: organization-defined actions to be taken (e.g., shut down information system, overwrite oldest audit records, stop generating audit records)].\\n",
      "supplemental_guidance": "Audit processing failures include, for example, software/hardware errors, failures in the audit capturing mechanisms, and audit storage capacity being reached or exceeded. Related security control: AU-4.\\n",
      "enhancements": "\\n",
      "baseline_low": true,
      "baseline_moderate": true,
      "baseline_high": true,
      "iso17799": [
        "10.10.3"
      ],
      "cobit41": [
        "None."
      ],
      "pci_dss_v2": [
        "10.6",
        "12.9"
      ],
      "joomla_id": 174
    },
    {
      "id": "AU-06",
      "name": "Audit Monitoring, Analysis, And Reporting",
      "family": "AU",
      "family_name": "Audit and Accountability",
      "control_class": "Technical",
      "description": "The organization regularly reviews/analyzes information system audit records for indications of inappropriate or unusual activity, investigates suspicious activity or suspected violations, reports findings to appropriate officials, and takes necessary actions.\\n",
      "supplemental_guidance": "Organizations increase the level of audit monitoring and analysis activity within the information system whenever there is an indication of increased risk to organizational operations, organizational assets, or individuals based on law enforcement information, intelligence information, or other credible sources of information.\\n",
      "enhancements": "\\n",
      "baseline_low": true,
      "baseline_moderate": true,
      "baseline_high": true,
      "iso17799": [
        "10.10.2",
        "10.10.4",
        "13.2.1"
      ],
      "cobit41": [
        "DS5.5"
      ],
      "pci_dss_v2": [
        "10.6",
        "12.5.2",
        "12.9.5"
      ],
      "joomla_id": 175
    },
    {
      "id": "AU-07",
      "name": "Audit Reduction And Report Generation",
      "family": "AU",
      "family_name": "Audit and Accountability",
      "control_class": "Technical",
      "description": "The information system provides an audit reduction and report generation capability.\\n",
      "supplemental_guidance": "Audit reduction, review, and reporting tools support after-the-fact investigations of security incidents without altering original audit records.\\n",
      "enhancements": "\\n",
      "baseline_low": true,
      "baseline_moderate": true,
      "baseline_high": true,
      "iso17799": [
        "10.10.3"
      ],
      "cobit41": [
        "None."
      ],
      "pci_dss_v2": [
        "None."
      ],
      "joomla_id": 176
    },
    {
      "id": "AU-08",
      "name": "Time Stamps",
      "family": "AU",
      "family_name": "Audit and Accountability",
      "control_class": "Technical",
      "description": "The information system provides time stamps for use in audit record generation.\\n",
      "supplemental_guidance": "Time stamps (including date and time) of audit records are generated using internal system clocks.\\n",
      "enhancements": "(1) The organization synchronizes internal information system clocks [Assignment: organization- defined frequency].\\n",
      "baseline_low": true,
      "baseline_moderate": true,
      "baseline_high": true,
      "iso17799": [
        "10.10.6"
      ],
      "cobit41": [
        "None."
      ],
      "pci_dss_v2": [
        "10.4"
      ],
      "joomla_id": 177
    },
    {
      "id": "AU-09",
      "name": "Protection Of Audit Information",
      "family": "AU",
      "family_name": "Audit and Accountability",
      "control_class": "Technical",
      "description": "The information system protects audit information and audit tools from unauthorized access, modification, and deletion.\\n",
      "supplemental_guidance": "Audit information includes all information (e.g., audit records, audit settings, and audit reports) needed to successfully audit information system activity.\\n",
      "enhancements": "(1) The information system produces audit records on hardware-enforced, write-once media.\\n",
      "baseline_low": true,
      "baseline_moderate": true,
      "baseline_high": true,
      "iso17799": [
        "10.10.3",
        "15.1.3",
        "15.3.2"
      ],
      "cobit41": [
        "None."
      ],
      "pci_dss_v2": [
        "10.5"
      ],
      "joomla_id": 178
    },
    {
      "id": "AU-10",
      "name": "Non-Repudiation",
      "family": "AU",
      "family_name": "Audit and Accountability",
      "control_class": "Technical",
      "description": "The information system provides the capability to determine whether a given individual took a particular action.\\n",
      "supplemental_guidance": "Examples of particular actions taken by individuals include creating information, sending a message, approving information (e.g., indicating concurrence or signing a contract), and receiving a message. Non-repudiation protects against later false claims by an individual of not having taken a specific action. Non-repudiation protects individuals against later claims by an author of not having authored a particular document, a sender of not having transmitted a message, a receiver of not having received a message, or a signatory of not having signed a document. Non-repudiation services can be used to determine if information originated from an individual, or if an individual took specific actions (e.g., sending an email, signing a contract, approving a procurement request) or received specific information. Non-repudiation services are obtained by employing various techniques or mechanisms (e.g., digital signatures, digital message receipts, time stamps).\\n",
      "enhancements": "(0) None.\\n",
      "baseline_low": true,
      "baseline_moderate": true,
      "baseline_high": true,
      "iso17799": [
        "10.8.2",
        "10.9.1",
        "12.3.1"
      ],
      "cobit41": [
        "DS5.11"
      ],
      "pci_dss_v2": [
        "10.5",
        "10.5.5"
      ],
      "joomla_id": 179
    },
    {
      "id": "AU-11",
      "name": "Audit Record Retention",
      "family": "AU",
      "family_name": "Audit and Accountability",
      "control_class": "Technical",
      "description": "The organization retains audit records for [Assignment: organization-defined time period] to provide support for after-the-fact investigations of security incidents and to meet regulatory and organizational information retention requirements.\\n",
      "supplemental_guidance": "The organization retains audit records until it is determined that they are no longer needed for administrative, legal, audit, or other operational purposes. This includes, for example, retention and availability of audit records relative to Freedom of Information Act (FOIA) requests, subpoena, and law enforcement actions. Standard categorizations of audit records relative to such types of actions and standard response processes for each type of action are developed and disseminated. NIST Special Publication 800-61 provides guidance on computer security incident handling and audit record retention.\\n",
      "enhancements": "(0) None.\\n",
      "baseline_low": true,
      "baseline_moderate": true,
      "baseline_high": true,
      "iso17799": [
        "10.10.1",
        "15.1.3"
      ],
      "cobit41": [
        "None."
      ],
      "pci_dss_v2": [
        "10.7"
      ],
      "joomla_id": 180
    },
    {
      "id": "IA-01",
      "name": "Identification And Authentication Policy And Procedures",
      "family": "IA",
      "family_name": "Identification and Authentication",
      "control_class": "Technical",
      "description": "The organization develops, disseminates, and periodically reviews/updates: (i) a formal, documented, identification and authentication policy that addresses purpose, scope, roles, responsibilities, management commitment, coordination among organizational entities, and compliance; and (ii) formal, documented procedures to facilitate the implementation of the identification and authentication policy and associated identification and authentication controls.\\n",
      "supplemental_guidance": "The identification and authentication policy and procedures are consistent with: (i) FIPS 201 and Special Publications 800-73, 800-76, and 800-78; and (ii) other applicable laws, Executive Orders, directives, policies, regulations, standards, and guidance. The identification and authentication policy can be included as part of the general information security policy for the organization. Identification and authentication procedures can be developed for the security program in general, and for a particular information system, when required. NIST Special Publication 800-12 provides guidance on security policies and procedures. NIST Special Publication 800-63 provides guidance on remote electronic authentication.\\n",
      "enhancements": "(0) None.\\n",
      "baseline_low": true,
      "baseline_moderate": true,
      "baseline_high": true,
      "iso17799": [
        "15.1.1"
      ],
      "cobit41": [
        "DS5.3",
        "PC5"
      ],
      "pci_dss_v2": [
        "12.3.2",
        "8.5.7"
      ],
      "joomla_id": 181
    },
    {
      "id": "IA-03",
      "name": "Device Identification And Authentication",
      "family": "IA",
      "family_name": "Identification and Authentication",
      "control_class": "Technical",
      "description": "The information system identifies and authenticates specific devices before establishing a connection.\\n",
      "supplemental_guidance": "The information system typically uses either shared known information (e.g., Media Access Control (MAC) or Transmission Control Protocol/Internet Protocol (TCP/IP) addresses) or an organizational authentication solution (e.g., IEEE 802.1x and Extensible Authentication Protocol (EAP) or a Radius server with EAP-Transport Layer Security (TLS) authentication) to identify and authenticate devices on local and/or wide area networks. The required strength of the device authentication mechanism is determined by the FIPS 199 security categorization of the information system with higher impact levels requiring stronger authentication.\\n",
      "enhancements": "(0) None.\\n",
      "baseline_low": true,
      "baseline_moderate": true,
      "baseline_high": true,
      "iso17799": [
        "11.4.2",
        "11.4.3",
        "11.7.1"
      ],
      "cobit41": [
        "None."
      ],
      "pci_dss_v2": [
        "None."
      ],
      "joomla_id": 182
    },
    {
      "id": "IA-04",
      "name": "Identifier Management",
      "family": "IA",
      "family_name": "Identification and Authentication",
      "control_class": "Technical",
      "description": "The organization manages user identifiers by: (i) uniquely identifying each user; (ii) verifying the identity of each user; (iii) receiving authorization to issue a user identifier from an appropriate organization official; (iv) issuing the user identifier to the intended party; (v) disabling the user identifier after [Assignment: organization-defined time period] of inactivity; and (vi) archiving user identifiers.\\n",
      "supplemental_guidance": "Identifier management is not applicable to shared information system accounts (e.g., guest and anonymous accounts). FIPS 201 and Special Publications 800-73, 800- 76, and 800-78 specify a personal identity verification (PIV) credential for use in the unique identification and authentication of federal employees and contractors.\\n",
      "enhancements": "(0) None.\\n",
      "baseline_low": true,
      "baseline_moderate": true,
      "baseline_high": true,
      "iso17799": [
        "11.2.3",
        "11.5.2"
      ],
      "cobit41": [
        "DS5.3",
        "DS5.4"
      ],
      "pci_dss_v2": [
        "8.5",
        "8.5.1",
        "8.5.5"
      ],
      "joomla_id": 183
    },
    {
      "id": "IA-05",
      "name": "Authenticator Management",
      "family": "IA",
      "family_name": "Identification and Authentication",
      "control_class": "Technical",
      "description": "The organization manages information system authenticators by: (i) defining initial authenticator content; (ii) establishing administrative procedures for initial authenticator distribution, for lost/compromised, or damaged authenticators, and for revoking authenticators; (iii) changing default authenticators upon information system installation; and (iv) changing/refreshing authenticators periodically.\\n",
      "supplemental_guidance": "Information system authenticators include, for example, tokens, PKI certificates, biometrics, passwords, and key cards. Users take reasonable measures to safeguard authenticators including maintaining possession of their individual authenticators, not loaning or sharing authenticators with others, and reporting lost or compromised authenticators immediately. For password-based authentication, the information system: (i) protects passwords from unauthorized disclosure and modification when stored and transmitted; (ii) prohibits passwords from being displayed when entered; (iii) enforces password minimum and maximum lifetime restrictions; and (iv) prohibits password reuse for a specified number of generations. For PKI- based authentication, the information system: (i) validates certificates by constructing a certification path to an accepted trust anchor; (ii) establishes user control of the corresponding private key; and (iii) maps the authenticated identity to the user account. In accordance with OMB policy and related E-authentication initiatives, authentication of public users accessing federal information systems (and associated authenticator management) may also be required to protect nonpublic or privacy-related information. FIPS 201 and Special Publications 800-73, 800-76, and 800-78 specify a personal identity verification (PIV) credential for use in the unique identification and authentication of federal employees and contractors. NIST Special Publication 800-63 provides guidance on remote electronic authentication.\\n",
      "enhancements": "(0) None.\\n",
      "baseline_low": true,
      "baseline_moderate": true,
      "baseline_high": true,
      "iso17799": [
        "11.5.2",
        "11.5.3"
      ],
      "cobit41": [
        "None."
      ],
      "pci_dss_v2": [
        "8.5"
      ],
      "joomla_id": 184
    },
    {
      "id": "IA-06",
      "name": "Authenticator Feedback",
      "family": "IA",
      "family_name": "Identification and Authentication",
      "control_class": "Technical",
      "description": "The information system obscures feedback of authentication information during the authentication process to protect the information from possible exploitation/use by unauthorized individuals.\\n",
      "supplemental_guidance": "The feedback from the information system does not provide information that would allow an unauthorized user to compromise the authentication mechanism. Displaying asterisks when a user types in a password is an example of obscuring feedback of authentication information.\\n",
      "enhancements": "(0) None.\\n",
      "baseline_low": true,
      "baseline_moderate": true,
      "baseline_high": true,
      "iso17799": [
        "11.5.1"
      ],
      "cobit41": [
        "None."
      ],
      "pci_dss_v2": [
        "None."
      ],
      "joomla_id": 185
    },
    {
      "id": "IA-07",
      "name": "Cryptographic Module Authentication",
      "family": "IA",
      "family_name": "Identification and Authentication",
      "control_class": "Technical",
      "description": "The information system employs authentication methods that meet the requirements of applicable laws, Executive Orders, directives, policies, regulations, standards, and guidance for authentication to a cryptographic module.\\n",
      "supplemental_guidance": "The applicable federal standard for authentication to a cryptographic module is FIPS 140-2 (as amended). Validation certificates issued by the NIST Cryptographic Module Validation Program (including FIPS 140-1, FIPS 140-2, and future amendments) remain in effect, and the modules remain available for continued use and purchase until a validation certificate is specifically revoked. Additional information on the use of validated cryptography is available at http://csrc.nist.gov/cryptval.\\n",
      "enhancements": "(0) None.\\n",
      "baseline_low": true,
      "baseline_moderate": true,
      "baseline_high": true,
      "iso17799": [
        "None."
      ],
      "cobit41": [
        "None."
      ],
      "pci_dss_v2": [
        "3.5"
      ],
      "joomla_id": 186
    },
    {
      "id": "AC-15",
      "name": "Automated Marking",
      "family": "AC",
      "family_name": "Access Control",
      "control_class": "Technical",
      "description": "The information system marks output using standard naming conventions to identify any special dissemination, handling, or distribution instructions.\\n",
      "supplemental_guidance": "Automated marking refers to markings employed on external media (e.g., hardcopy documents output from the information system). The markings used in external marking are distinguished from the labels used on internal data structures described in AC-16.\\n",
      "enhancements": "(0) None.\\n",
      "baseline_low": true,
      "baseline_moderate": true,
      "baseline_high": true,
      "iso17799": [
        "7.2.2"
      ],
      "cobit41": [
        "PO2.3",
        "DS11.6",
        "AC2"
      ],
      "pci_dss_v2": [
        "None."
      ],
      "joomla_id": 197
    },
    {
      "id": "AC-16",
      "name": "Automated Labeling",
      "family": "AC",
      "family_name": "Access Control",
      "control_class": "Technical",
      "description": "The information system appropriately labels information in storage, in process, and in transmission.\\n",
      "supplemental_guidance": "Automated labeling refers to labels employed on internal data structures (e.g., records, files) within the information system. Information labeling is accomplished in accordance with: (i) access control requirements; (ii) special dissemination, handling, or distribution instructions; or (iii) as otherwise required to enforce information system security policy.\\n",
      "enhancements": "(0) None.\\n",
      "baseline_low": true,
      "baseline_moderate": true,
      "baseline_high": true,
      "iso17799": [
        "7.2.2"
      ],
      "cobit41": [
        "PO2.3",
        "DS11.6"
      ],
      "pci_dss_v2": [
        "None."
      ],
      "joomla_id": 198
    },
    {
      "id": "AC-17",
      "name": "Remote Access",
      "family": "AC",
      "family_name": "Access Control",
      "control_class": "Technical",
      "description": "The organization authorizes, monitors, and controls all methods of remote access to the information system.\\n",
      "supplemental_guidance": "Remote access is any access to an organizational information system by a user (or an information system) communicating through an external, non-organization-controlled network (e.g., the Internet). Examples of remote access methods include dial-up, broadband, and wireless. Remote access controls are applicable to information systems other than public web servers or systems specifically designed for public access. The organization restricts access achieved through dial-up connections (e.g., limiting dial-up access based upon source of request) or protects against unauthorized connections or subversion of authorized connections (e.g., using virtual private network technology). NIST Special Publication 800-63 provides guidance on remote electronic authentication. If the federal Personal Identity Verification (PIV) credential is used as an identification token where cryptographic token-based access control is employed, the access control system conforms to the requirements of FIPS 201 and NIST Special Publications 800-73 and 800-78. NIST Special Publication 800-77 provides guidance on IPsec-based virtual private networks. Related security control: IA-2.\\n",
      "enhancements": "\\n",
      "baseline_low": true,
      "baseline_moderate": true,
      "baseline_high": true,
      "iso17799": [
        "11.4.2",
        "11.4.3",
        "11.4.4"
      ],
      "cobit41": [
        "None."
      ],
      "pci_dss_v2": [
        "8.3",
        "8.5.6"
      ],
      "joomla_id": 199
    },
    {
      "id": "AC-18",
      "name": "Wireless Access Restrictions",
      "family": "AC",
      "family_name": "Access Control",
      "control_class": "Technical",
      "description": "The organization: (i) establishes usage restrictions and implementation guidance for wireless technologies; and (ii) authorizes, monitors, controls wireless access to the information system.\\n",
      "supplemental_guidance": "NIST Special Publications 800-48 and 800-97 provide guidance on wireless network security. NIST Special Publication 800-94 provides guidance on wireless intrusion detection and prevention.\\n",
      "enhancements": "\\n",
      "baseline_low": true,
      "baseline_moderate": true,
      "baseline_high": true,
      "iso17799": [
        "11.4.2",
        "11.7.1",
        "11.7.2"
      ],
      "cobit41": [
        "None."
      ],
      "pci_dss_v2": [
        "2.1.1"
      ],
      "joomla_id": 200
    },
    {
      "id": "AC-19",
      "name": "Access Control For Portable And Mobile Devices",
      "family": "AC",
      "family_name": "Access Control",
      "control_class": "Technical",
      "description": "The organization: (i) establishes usage restrictions and implementation guidance for organization-controlled portable and mobile devices; and (ii) authorizes, monitors, and controls device access to organizational information systems.\\n",
      "supplemental_guidance": "Portable and mobile devices (e.g., notebook computers, personal digital assistants, cellular telephones, and other computing and communications devices with network connectivity and the capability of periodically operating in different physical locations) are only allowed access to organizational information systems in accordance with organizational security policies and procedures. Security policies and procedures include device identification and authentication, implementation of mandatory protective software (e.g., malicious code detection, firewall), configuration management, scanning devices for malicious code, updating virus protection software, scanning for critical software updates and patches, conducting primary operating system (and possibly other resident software) integrity checks, and disabling unnecessary hardware (e.g., wireless, infrared). Protecting information residing on portable and mobile devices (e.g., employing cryptographic mechanisms to provide confidentiality and integrity protections during storage and while in transit when outside of controlled areas) is covered in the media protection family. Related security controls: MP-4, MP-5.\\n",
      "enhancements": "(0) None.\\n",
      "baseline_low": true,
      "baseline_moderate": true,
      "baseline_high": true,
      "iso17799": [
        "11.7.1"
      ],
      "cobit41": [
        "None."
      ],
      "pci_dss_v2": [
        "1.4",
        "12.3.10"
      ],
      "joomla_id": 201
    },
    {
      "id": "AC-20",
      "name": "Use Of External Information Systems",
      "family": "AC",
      "family_name": "Access Control",
      "control_class": "Technical",
      "description": "The organization establishes terms and conditions for authorized individuals to: (i) access the information system from an external information system; and (ii) process, store, and/or transmit organization-controlled information using an external information system.\\n",
      "supplemental_guidance": "External information systems are information systems or components of information systems that are outside of the accreditation boundary established by the organization and for which the organization typically has no direct control over the application of required security controls or the assessment of security control effectiveness. External information systems include, but are not limited to, personally owned information systems (e.g., computers, cellular telephones, or personal digital assistants); privately owned computing and communications devices resident in commercial or public facilities (e.g., hotels, convention centers, or airports); information systems owned or controlled by nonfederal governmental organizations; and federal information systems that are not owned by, operated by, or under the direct control of the organization. Authorized individuals include organizational personnel, contractors, or any other individuals with authorized access to the organizational information system. This control does not apply to the use of external information systems to access organizational information systems and information that are intended for public access (e.g., individuals accessing federal information through public interfaces to organizational information systems). The organization establishes terms and conditions for the use of external information systems in accordance with organizational security policies and procedures. The terms and conditions address as a minimum; (i) the types of applications that can be accessed on the organizational information system from the external information system; and (ii) the maximum FIPS 199 security category of information that can be processed, stored, and transmitted on the external information system.\\n",
      "enhancements": "(1) The organization prohibits authorized individuals from using an external information system to access the information system or to process, store, or transmit organization-controlled information except in situations where the organization: (i) can verify the employment of required security controls on the external system as specified in the organizationâ€™s information security policy and system security plan; or (ii) has approved information system connection or processing agreements with the organizational entity hosting the external information system.\\n",
      "baseline_low": true,
      "baseline_moderate": true,
      "baseline_high": true,
      "iso17799": [
        "6.1.4",
        "9.2.5",
        "11.7.1"
      ],
      "cobit41": [
        "None."
      ],
      "pci_dss_v2": [
        "None."
      ],
      "joomla_id": 202
    },
    {
      "id": "SA-11",
      "name": "Developer Security Testing",
      "family": "SA",
      "family_name": "System and Services Acquisition",
      "control_class": "",
      "description": "The organization requires that information system developers create a security test and evaluation plan, implement the plan, and document the results.",
      "supplemental_guidance": "",
      "enhancements": "",
      "baseline_low": false,
      "baseline_moderate": false,
      "baseline_high": false,
      "iso17799": [],
      "cobit41": [],
      "pci_dss_v2": [],
      "joomla_id": 249
    }
  ]
}