{
  "id": "PE-03",
  "name": "Physical Access Control",
  "family": "PE",
  "family_name": "Physical and Environmental Protection",
  "control_class": "Operational",
  "description": "The organization controls all physical access points (including designated entry/exit points) to the facility where the information system resides (except for those areas within the facility officially designated as publicly accessible) and verifies individual access authorizations before granting access to the facility. The organization controls access to areas officially designated as publicly accessible, as appropriate, in accordance with the organization’s assessment of risk.\\n",
  "supplemental_guidance": "The organization uses physical access devices (e.g., keys, locks, combinations, card readers) and/or guards to control entry to facilities containing information systems. The organization secures keys, combinations, and other access devices and inventories those devices regularly. The organization changes combinations and keys: (i) periodically; and (ii) when keys are lost, combinations are compromised, or individuals are transferred or terminated. Workstations and associated peripherals connected to (and part of) an organizational information system may be located in areas designated as publicly accessible with access to such devices being appropriately controlled. Where federal Personal Identity Verification (PIV) credential is used as an identification token and token-based access control is employed, the access control system conforms to the requirements of FIPS 201 and NIST Special Publication 800-73. If the token- based access control function employs cryptographic verification, the access control system conforms to the requirements of NIST Special Publication 800-78. If the token-based access control function employs biometric verification, the access control system conforms to the requirements of NIST Special Publication 800-76.\\n",
  "enhancements": "\\n",
  "baseline_low": true,
  "baseline_moderate": true,
  "baseline_high": true,
  "iso17799": [
    "9.1.1",
    "9.1.2",
    "9.1.5",
    "9.1.6",
    "10.5.1"
  ],
  "cobit41": [
    "DS12.2"
  ],
  "pci_dss_v2": [
    "9.1"
  ],
  "joomla_id": 97
}