{
  "id": "RA-03",
  "name": "Risk Assessment",
  "family": "RA",
  "family_name": "Risk Assessment",
  "control_class": "Management",
  "description": "The organization conducts assessments of the risk and magnitude of harm that could result from the unauthorized access, use, disclosure, disruption, modification, or destruction of information and information systems that support the operations and assets of the agency (including information and information systems managed/operated by external parties).\\n",
  "supplemental_guidance": "Risk assessments take into account vulnerabilities, threat sources, and security controls planned or in place to determine the resulting level of residual risk posed to organizational operations, organizational assets, or individuals based on the operation of the information system. The organization also considers potential impacts to other organizations and, in accordance with the USA PATRIOT Act and Homeland Security Presidential Directives, potential national-level impacts in categorizing the information system. Risk assessments also take into account risk posed to organizational operations, organizational assets, or individuals from external parties (e.g., service providers, contractors operating information systems on behalf of the organization, individuals accessing organizational information systems, outsourcing entities). In accordance with OMB policy and related E-authentication initiatives, authentication of public users accessing federal information systems may also be required to protect nonpublic or privacy-related information. As such, organizational assessments of risk also address public access to federal information systems. The General Services Administration provides tools supporting that portion of the risk assessment dealing with public access to federal information systems. NIST Special Publication 800-30 provides guidance on conducting risk assessments including threat, vulnerability, and impact assessments.\\n",
  "enhancements": "(0) None.\\n",
  "baseline_low": true,
  "baseline_moderate": true,
  "baseline_high": true,
  "iso17799": [
    "4.0",
    "4.1",
    "4.2",
    "6.2.1",
    "10.10.2",
    "10.10.5",
    "12.5.1",
    "12.6.1",
    "14.1.1",
    "14.1.2"
  ],
  "cobit41": [
    "PO9.3",
    "PO9.4",
    "AI1.1"
  ],
  "pci_dss_v2": [
    "12.1.2"
  ],
  "joomla_id": 86
}