{
  "id": "SP-021",
  "slug": "draft-pattern-realtime-collaboration",
  "joomla_id": 281,
  "title": "Realtime Collaboration Pattern",
  "description": "Security architecture for real-time collaboration platforms including video conferencing, screen sharing, instant messaging, and shared document editing. Addresses authentication, data protection, audit trails, and the unique risks of allowing external participants into collaborative sessions.",
  "url": "https://www.opensecurityarchitecture.org/patterns/sp-021",
  "metadata": {
    "release": "26.02",
    "classification": "Application & Operations",
    "status": "published",
    "type": "pattern",
    "datePublished": "2010-05-31",
    "dateModified": "2026-02-06",
    "authors": [
      "Aurelius",
      "Vitruvius"
    ],
    "reviewers": []
  },
  "diagram": {
    "svg": "/images/OSA_images/patterns/08_02_Pattern_021_01_Realtime_Collaboration.svg",
    "png": "/images/OSA_images/patterns/08_02_Pattern_021_01_Realtime_Collaboration.png"
  },
  "content": {
    "description": "Real-time collaboration has become a foundational capability for modern organisations. Platforms such as Microsoft Teams, Zoom, Cisco Webex, Slack, and Google Workspace enable video conferencing, voice calls, screen sharing, instant messaging, and simultaneous document editing across organisational boundaries. The security challenge is substantial: these tools create persistent, high-bandwidth channels between internal systems and external participants, often carrying the organisation's most sensitive working documents and strategic discussions.\n\nThis pattern addresses the security architecture for real-time collaboration environments where internal and external users share documents, co-author content, and communicate synchronously. Unlike email, which is store-and-forward with well-understood security models, real-time collaboration introduces live data streams, shared persistent storage, presence information, and session recordings -- each with distinct security requirements. The attack surface is wide: from the collaboration platform itself, through the network transport, to the unmanaged endpoints of external participants.\n\nA central concern is the tension between usability and security. Collaboration tools succeed only when they are frictionless enough for adoption. Overly restrictive controls drive users to shadow IT alternatives -- personal messaging apps, consumer file-sharing services, unapproved video tools -- which are far harder to secure and audit. The architecture must therefore provide security that is largely invisible to legitimate users while maintaining strong authentication, encrypted transport, content protection, and comprehensive audit trails.\n\nUser lifecycle management is critical. Collaboration spaces accumulate participants over time, and stale accounts with access to sensitive shared folders are a persistent risk. The pattern requires automated provisioning tied to identity governance, with regular access reviews and prompt de-provisioning when engagements end. External guest accounts require particular attention: they should be time-bounded, limited in scope, and subject to stronger authentication requirements than internal users.\n\nThe pattern also addresses the data residency and retention dimensions of collaboration. Shared documents, chat histories, meeting recordings, and whiteboard content all constitute business records that may be subject to regulatory retention requirements, e-discovery obligations, or data sovereignty constraints. Organisations must define clear policies for what is recorded, where it is stored, how long it is retained, and who can access historical collaboration data.",
    "keyControlAreas": [
      "Account Management and Access Governance (AC-02, IA-04): Every collaboration participant -- internal employee, external partner, or guest -- must have a uniquely identifiable account tied to a verified identity. Account provisioning should be linked to business justification such as a project, contract, or partnership agreement. External accounts must be time-bounded with automatic expiry unless explicitly renewed. Regular access reviews should verify that all active accounts still have a legitimate business need. Orphaned accounts from completed projects or departed partners are a common source of unauthorised access to sensitive shared content. Automated lifecycle management through identity governance platforms reduces the risk of stale accounts accumulating in collaboration spaces.",
      "Remote Access and External System Controls (AC-17, AC-20, CA-03): Real-time collaboration inherently involves remote access from diverse endpoints, many of which the organisation does not manage. The architecture must define acceptable connection methods, enforce encrypted transport (TLS 1.2+ minimum), and establish policies for external information system usage. System interconnection agreements (CA-03) should govern how collaboration platforms integrate with partner organisations' infrastructure. Where external participants connect from unmanaged devices, the architecture should consider browser-based access modes that limit data download, copy/paste restrictions for sensitive content, and watermarking of displayed documents to deter screen capture.",
      "Authentication and Identity Verification (IA-02, IA-04): Strong authentication is essential given the sensitivity of real-time collaboration content. Internal users should authenticate via the organisation's identity provider with multi-factor authentication enforced. External participants present a harder challenge -- the organisation cannot mandate their authentication infrastructure. Options include federated identity (SAML/OIDC with trusted partner IdPs), one-time passcodes via email or SMS, or hardware tokens for high-security engagements such as M&A due diligence or board communications. Meeting and session access should use unique join codes with waiting rooms or lobby controls that require host approval before participants can enter. Anonymous or dial-in-only access should be restricted to the minimum necessary.",
      "Audit Trail and Monitoring (AU-02, AU-06, AU-09): Comprehensive audit logging must capture who accessed which collaboration spaces, when, what content was viewed or modified, and what was downloaded or shared externally. Audit events should include session join/leave times, screen sharing initiation, file upload/download, permission changes, and recording start/stop. Logs must be protected from tampering (AU-09) -- collaboration platform administrators should not be able to modify or delete audit records. Regular monitoring and analysis (AU-06) should identify anomalous patterns: unusual access times, bulk downloads, external sharing to unexpected domains, or repeated failed authentication attempts. These logs also serve compliance and e-discovery requirements.",
      "Configuration and Change Management (CM-03, CP-09): Collaboration platform configurations -- tenant settings, sharing policies, guest access policies, retention rules, and integration permissions -- must be managed through formal change control. Uncontrolled configuration changes can silently weaken security: enabling anonymous access, extending external sharing permissions, or disabling audit logging. Backup procedures (CP-09) must cover collaboration content including shared documents, chat histories, and meeting recordings. Many organisations discover too late that their backup strategy does not cover cloud collaboration data, leaving them exposed to accidental deletion, ransomware affecting sync clients, or vendor service disruptions.",
      "Vulnerability and Risk Management (RA-03, RA-05, CA-02): Collaboration platforms represent a significant attack surface that requires ongoing vulnerability management. Regular vulnerability scanning (RA-05) should cover the platform infrastructure, integration points, and custom extensions or bots. Security assessments (CA-02) should evaluate the platform's security configuration against vendor best practices and industry benchmarks. Risk assessments (RA-03) should specifically address the data flows in collaboration scenarios: what is the impact if an external participant's compromised endpoint exfiltrates meeting recordings or shared documents? What is the risk of a supply chain attack through a collaboration platform plugin or integration?",
      "Incident Handling and Security Awareness (IR-04, IR-07, AT-02, AT-03, SI-11): Users must understand the security risks specific to real-time collaboration: sharing screens that expose sensitive applications, joining calls from public locations where conversations can be overheard, accepting meeting invitations that are actually phishing attacks, or uploading malicious files to shared workspaces. Security awareness training (AT-02, AT-03) should include collaboration-specific scenarios. Incident handling procedures (IR-04) must cover collaboration-specific incidents: unauthorised recording of meetings, data leakage through external sharing, compromised guest accounts, and platform-level security incidents. Error handling (SI-11) should ensure that collaboration platforms do not expose sensitive system information in error messages."
    ],
    "assumptions": "The organisation has selected or will select a collaboration platform that supports enterprise security controls including SSO, MFA, audit logging, and granular sharing policies. Shared information will include confidential business documents, and therefore both the communication channel and storage must be encrypted at rest and in transit. External participants will connect from endpoints that the organisation does not manage, and the architecture must account for this. Identity governance processes exist or will be established to manage the lifecycle of both internal and external collaboration accounts. Network bandwidth and reliability are sufficient to support real-time audio, video, and document collaboration without degradation that drives users to unmanaged alternatives.",
    "typicalChallenges": "The primary challenge is balancing security with the frictionless experience that drives adoption. Overly restrictive controls -- requiring hardware tokens for every external guest, blocking all file sharing, or disabling screen sharing -- push users to consumer alternatives (WhatsApp, personal Dropbox, unapproved Zoom accounts) that offer zero security visibility. Guest account lifecycle management is persistently difficult: collaboration spaces accumulate external participants over months or years, and without automated review and expiry, stale accounts with access to sensitive content proliferate. Data loss prevention is complicated by the real-time nature of the tools -- once a screen is shared or a document displayed in a meeting, the content has effectively been transmitted to all participants' endpoints regardless of download restrictions. Platform sprawl is another challenge: organisations often run multiple overlapping collaboration tools (Teams for internal, Zoom for external, Slack for development teams) creating inconsistent security policies and audit gaps. Regulatory compliance adds complexity when collaboration involves participants across jurisdictions with different data sovereignty requirements, and meeting recordings or chat logs become subject to retention and e-discovery obligations.",
    "indications": "Use this pattern when internal and external partners must collaborate synchronously on shared documents, conduct video or voice conferences, share screens for presentations or demonstrations, or communicate via persistent chat channels. Applicable when the collaboration involves confidential or commercially sensitive information that requires encryption, access control, and audit trails. Appropriate for organisations adopting cloud-based collaboration suites (Microsoft 365, Google Workspace, Slack, Zoom) and needing a security architecture to govern their use. Also applicable when regulatory or contractual obligations require demonstrable controls over collaborative data sharing with external parties.",
    "contraIndications": "This pattern is not appropriate for ad-hoc, one-time file transfers where the Secure Ad-Hoc File Exchange pattern (SP-019) is more suitable. Not applicable where all collaboration is purely internal with no external participant requirement and the organisation already has adequate internal communication controls. The pattern assumes the ability to distribute authentication credentials or tokens to external participants; where this is not feasible (very large public audiences, anonymous participants), a different model such as webinar or broadcast architecture is more appropriate. Not suitable for air-gapped or highly classified environments where real-time collaboration with external parties is prohibited by policy.",
    "threatResistance": "This pattern addresses data leakage through unmanaged external participant endpoints, which remains a residual risk that can be mitigated but not eliminated. It defends against unauthorised access to collaboration spaces through strong authentication, account lifecycle management, and session controls. The pattern mitigates man-in-the-middle attacks on collaboration streams through mandatory end-to-end or transport encryption. It addresses malicious file upload through content scanning of files shared in collaboration spaces. Unauthorised recording or screen capture is partially mitigated through platform controls and watermarking, though it cannot be fully prevented on unmanaged endpoints. The pattern defends against account takeover through MFA and anomalous access detection. It addresses the risk of shadow IT collaboration tools by providing a secure, usable sanctioned alternative. Compliance risks from uncontrolled data retention or missing audit trails are mitigated through logging, retention policies, and regular security assessments."
  },
  "examples": {
    "Enterprise collaboration platforms": [
      "Microsoft Teams with Azure AD Conditional Access, sensitivity labels, and DLP policies",
      "Cisco Webex with end-to-end encryption, FedRAMP authorisation for government use",
      "Zoom with waiting rooms, passcodes, authenticated-user-only meetings, and E2EE",
      "Google Workspace with context-aware access, Drive sharing restrictions, and Vault for retention"
    ],
    "Document collaboration security": [
      "Microsoft 365 co-authoring with sensitivity labels preventing external sharing of classified documents",
      "Box with watermarking, download restrictions, and granular folder-level access for external collaborators",
      "Confluence Cloud with space-level permissions, IP allowlisting, and audit logs for regulated content",
      "SharePoint Online with conditional access policies limiting unmanaged device access to browser-only"
    ],
    "Messaging and chat security": [
      "Slack Enterprise Grid with Enterprise Key Management (EKM) for customer-managed encryption keys",
      "Microsoft Teams with information barriers preventing communication between conflicted business units",
      "Signal or Wire for high-security messaging where end-to-end encryption is a hard requirement",
      "Mattermost self-hosted deployment for organisations requiring full data sovereignty"
    ],
    "Meeting and video security": [
      "Zoom Meetings with end-to-end encryption enabled for sensitive board or M&A discussions",
      "Microsoft Teams Live Events with attendee-only mode for large broadcast presentations",
      "Cisco Webex with lobby controls, co-host permissions, and meeting lock after all participants join",
      "Recording management with automatic transcription, retention policies, and access-controlled playback"
    ]
  },
  "references": [
    {
      "title": "NIST SP 800-46 Rev 2: Guide to Enterprise Telework, Remote Access, and BYOD Security",
      "url": "https://csrc.nist.gov/publications/detail/sp/800-46/rev-2/final",
      "note": "NIST guidance on securing remote access technologies including collaboration tools, VPN, and remote desktop. Covers policy, architecture, and endpoint security for telework scenarios."
    },
    {
      "title": "CISA Guidance on Securing Video Conferencing",
      "url": "https://www.cisa.gov/news-events/alerts/2020/04/02/fbi-releases-guidance-defending-against-vtc-hijacking",
      "note": "CISA and FBI guidance on securing video teleconferencing against hijacking (Zoom-bombing), unauthorised access, and eavesdropping. Includes practical configuration recommendations."
    },
    {
      "title": "Microsoft 365 Security Best Practices for Collaboration",
      "url": "https://learn.microsoft.com/en-us/microsoft-365/security/",
      "note": "Microsoft's comprehensive guidance on securing Teams, SharePoint, and OneDrive collaboration including guest access policies, sensitivity labels, DLP, and conditional access."
    },
    {
      "title": "CIS Benchmark for Microsoft Teams",
      "url": "https://www.cisecurity.org/benchmark/microsoft_365",
      "note": "Center for Internet Security benchmark providing prescriptive security configuration guidance for Microsoft 365 including Teams, SharePoint, and Exchange Online."
    },
    {
      "title": "ENISA Secure Use of Online Collaboration Tools",
      "url": "https://www.enisa.europa.eu/publications/tips-for-selecting-and-using-online-communication-tools",
      "note": "European guidance on selecting and securely configuring online collaboration tools, with emphasis on data protection, encryption, and privacy considerations under GDPR."
    },
    {
      "title": "OWASP Testing Guide - Web Application Security",
      "url": "https://owasp.org/www-project-web-security-testing-guide/",
      "note": "Relevant for browser-based collaboration platforms. Covers authentication testing, session management, input validation, and other web application security concerns applicable to collaboration tools."
    }
  ],
  "relatedPatterns": ["SP-001", "SP-002", "SP-013", "SP-019", "SP-020", "SP-022", "SP-025"],
  "relatedPatternNames": ["Client Module", "Server Module", "Data Security", "Secure Ad-Hoc File Exchange", "Email Transport Layer Security (TLS)", "Board of Directors Room", "Advanced Monitoring and Detection"],
  "threats": [
    {
      "id": "T-RC-001",
      "name": "Data Leakage via Unmanaged External Endpoints",
      "mitigatedBy": ["AC-20", "AT-02", "AU-02"]
    },
    {
      "id": "T-RC-002",
      "name": "Unauthorised Access to Collaboration Spaces",
      "mitigatedBy": ["AC-02", "IA-02", "IA-04"]
    },
    {
      "id": "T-RC-003",
      "name": "Malicious File Upload to Shared Workspaces",
      "mitigatedBy": ["SI-11", "RA-05", "AU-06"]
    },
    {
      "id": "T-RC-004",
      "name": "Session Hijacking or Meeting Bombing",
      "mitigatedBy": ["IA-02", "AC-17", "AU-02"]
    },
    {
      "id": "T-RC-005",
      "name": "Stale Guest Accounts with Persistent Access",
      "mitigatedBy": ["AC-02", "IA-04", "CA-02"]
    },
    {
      "id": "T-RC-006",
      "name": "Man-in-the-Middle on Collaboration Streams",
      "mitigatedBy": ["AC-17", "CA-03", "IA-02"]
    },
    {
      "id": "T-RC-007",
      "name": "Shadow IT Collaboration Tool Usage",
      "mitigatedBy": ["AT-02", "AT-03", "CM-03"]
    },
    {
      "id": "T-RC-008",
      "name": "Uncontrolled Meeting Recording and Transcription",
      "mitigatedBy": ["AU-02", "AU-09", "CP-09"]
    },
    {
      "id": "T-RC-009",
      "name": "Privilege Escalation in Collaboration Platform",
      "mitigatedBy": ["AC-02", "AU-06", "RA-05"]
    },
    {
      "id": "T-RC-010",
      "name": "Compliance Failure from Missing Audit Trails",
      "mitigatedBy": ["AU-02", "AU-06", "AU-09", "IR-04"]
    }
  ],
  "controls": [
    {
      "id": "AC-02",
      "name": "Account Management",
      "family": "AC",
      "emphasis": "critical"
    },
    {
      "id": "AC-17",
      "name": "Remote Access",
      "family": "AC",
      "emphasis": "critical"
    },
    {
      "id": "AC-20",
      "name": "Use Of External Information Systems",
      "family": "AC",
      "emphasis": "important"
    },
    {
      "id": "AT-02",
      "name": "Security Awareness",
      "family": "AT",
      "emphasis": "standard"
    },
    {
      "id": "AT-03",
      "name": "Security Training",
      "family": "AT",
      "emphasis": "standard"
    },
    {
      "id": "AU-02",
      "name": "Auditable Events",
      "family": "AU",
      "emphasis": "important"
    },
    {
      "id": "AU-06",
      "name": "Audit Monitoring, Analysis, And Reporting",
      "family": "AU",
      "emphasis": "important"
    },
    {
      "id": "AU-09",
      "name": "Protection Of Audit Information",
      "family": "AU",
      "emphasis": "standard"
    },
    {
      "id": "CA-02",
      "name": "Security Assessments",
      "family": "CA",
      "emphasis": "standard"
    },
    {
      "id": "CA-03",
      "name": "Information System Connections",
      "family": "CA",
      "emphasis": "important"
    },
    {
      "id": "CM-03",
      "name": "Configuration Change Control",
      "family": "CM",
      "emphasis": "standard"
    },
    {
      "id": "CP-09",
      "name": "Information System Backup",
      "family": "CP",
      "emphasis": "standard"
    },
    {
      "id": "IA-02",
      "name": "User Identification And Authentication",
      "family": "IA",
      "emphasis": "critical"
    },
    {
      "id": "IA-04",
      "name": "Identifier Management",
      "family": "IA",
      "emphasis": "important"
    },
    {
      "id": "IR-04",
      "name": "Incident Handling",
      "family": "IR",
      "emphasis": "important"
    },
    {
      "id": "IR-07",
      "name": "Incident Response Assistance",
      "family": "IR",
      "emphasis": "standard"
    },
    {
      "id": "RA-03",
      "name": "Risk Assessment",
      "family": "RA",
      "emphasis": "important"
    },
    {
      "id": "RA-05",
      "name": "Vulnerability Scanning",
      "family": "RA",
      "emphasis": "standard"
    },
    {
      "id": "SI-11",
      "name": "Error Handling",
      "family": "SI",
      "emphasis": "standard"
    }
  ],
  "controlFamilySummary": {
    "AC": 3,
    "AT": 2,
    "AU": 3,
    "CA": 2,
    "CM": 1,
    "CP": 1,
    "IA": 2,
    "IR": 2,
    "RA": 2,
    "SI": 1
  },
  "$schema": "../schema/pattern.schema.json"
}