{
  "id": "SP-018",
  "slug": "module-information-security-management-system-isms",
  "joomla_id": 279,
  "title": "Information Security Management System (ISMS) Module",
  "description": "Security architecture for establishing, operating, and continuously improving an Information Security Management System aligned with ISO 27001. Covers policy frameworks, risk assessment, security assessment and certification, incident management, continuous monitoring, and the Plan-Do-Check-Act lifecycle.",
  "url": "https://www.opensecurityarchitecture.org/patterns/sp-018",
  "metadata": {
    "release": "26.02",
    "classification": "Governance & People",
    "status": "published",
    "type": "module",
    "datePublished": "2010-05-09",
    "dateModified": "2026-02-06",
    "authors": [
      "Aurelius",
      "Vitruvius"
    ],
    "reviewers": []
  },
  "diagram": {
    "svg": "/images/OSA_images/patterns/08_02_Pattern_018_01_ISMS.svg",
    "png": "/images/OSA_images/patterns/08_02_Pattern_018_01_ISMS.png"
  },
  "content": {
    "description": "An Information Security Management System (ISMS) is not a product or a technology -- it is a structured management framework for establishing, implementing, operating, monitoring, reviewing, maintaining, and improving an organisation's information security posture. The ISMS Module provides the governance architecture that all other security patterns operate within. Without an ISMS, individual security controls are isolated implementations without coordinated management, consistent risk assessment, or measurable improvement.\n\nThe ISMS is built on the Plan-Do-Check-Act (PDCA) lifecycle. In the Plan phase, the organisation defines its security policy framework, identifies its information assets, conducts risk assessments, and selects controls proportionate to the identified risks. In the Do phase, those controls are implemented and operated. In the Check phase, the organisation monitors, reviews, and audits the effectiveness of its controls through internal assessments, continuous monitoring, vulnerability scanning, and incident analysis. In the Act phase, corrective and preventive actions are taken based on findings, and the cycle begins again. This iterative approach ensures that security is not a static state but a continuously improving capability.\n\nThe pattern aggregates the policy-level controls from across all NIST 800-53 control families. Each family has a policy and procedures control (XX-01) that establishes the governance foundation for that family's technical and operational controls. These policies collectively form the ISMS documentation framework -- the equivalent of the ISO 27001 mandatory documented information requirements. Policies must be approved by management, communicated to all relevant personnel, and reviewed at planned intervals or when significant changes occur.\n\nBeyond policy, the ISMS requires active security assessment and certification activities. Regular security assessments evaluate whether controls are implemented correctly and operating as intended. Security certification provides formal assurance that system security posture meets requirements. Plans of action and milestones track identified weaknesses through to remediation. Continuous monitoring provides ongoing awareness of the security posture rather than relying solely on periodic assessments.\n\nIncident management is a critical ISMS function. The ability to detect, respond to, contain, and recover from security incidents -- and to learn from them -- is what separates mature security programs from those that simply implement controls and hope for the best. The ISMS integrates incident response policy, incident handling procedures, incident monitoring, incident reporting, and incident response assistance into a coordinated capability that feeds back into risk assessment and control improvement.",
    "keyControlAreas": [
      "Security Policy Framework (AC-01, AT-01, AU-01, CA-01, CM-01, CP-01, IA-01, IR-01, MA-01, MP-01, PE-01, PL-01, PS-01, RA-01, SA-01, SC-01, SI-01): The policy controls form the backbone of the ISMS. Each XX-01 control establishes the policy and procedures for its respective control family. Together, they constitute the organisation's information security policy framework -- the documented management commitment to security that ISO 27001 Clause 5.2 requires. Policies must define scope, objectives, roles, and responsibilities. Procedures must provide actionable implementation guidance that practitioners can follow. The policy framework should be hierarchical: a top-level information security policy approved by senior management, supported by topic-specific policies (access control, cryptography, physical security, etc.), with detailed procedures and standards beneath. All policies require periodic review, version control, and formal approval. Critically, policies without enforcement are decoration -- the framework must include mechanisms for compliance monitoring and consequences for violations.",
      "Security Assessment and Certification (CA-01, CA-02, CA-04, CA-05, CA-07): These controls provide the assurance function of the ISMS -- the Check phase of PDCA. Security assessment policy (CA-01) establishes the framework for evaluating control effectiveness. Security assessments (CA-02) are the operational evaluations themselves, covering internal audits, control testing, and third-party assessments. They should be conducted at planned intervals and after significant changes. Security certification (CA-04) provides formal validation that a system or environment meets its security requirements -- relevant for systems requiring authorisation to operate. Plan of action and milestones (CA-05) is the remediation tracking mechanism: every assessment finding must be captured, assigned an owner, given a target remediation date, and tracked to closure. Continuous monitoring (CA-07) complements periodic assessments with ongoing technical monitoring of security posture, including automated configuration checks, vulnerability detection, and security metrics dashboards.",
      "Incident Management Lifecycle (IR-01, IR-04, IR-05, IR-06, IR-07): Incident management is where the ISMS meets operational reality. Incident response policy (IR-01) establishes the organisational commitment to detecting and responding to security events. Incident handling (IR-04) provides the operational procedures for triage, analysis, containment, eradication, and recovery. This must include defined severity levels, escalation paths, communication templates, and decision authorities. Incident monitoring (IR-05) tracks incidents over time, enabling trend analysis and pattern detection that informs risk assessment updates. Incident reporting (IR-06) ensures incidents are reported to appropriate internal stakeholders, management, regulators, and law enforcement where required. Incident response assistance (IR-07) provides support resources for personnel involved in incident handling -- help desks, security operations centres, and external incident response retainer arrangements. Post-incident reviews must feed lessons learned back into policy updates, training programs, and control improvements.",
      "Risk and Vulnerability Management (RA-01, RA-05): Risk assessment is the engine that drives ISMS decision-making. Risk assessment policy (RA-01) establishes the methodology, criteria, and frequency for evaluating information security risks. The methodology should define how threats and vulnerabilities are identified, how likelihood and impact are assessed, how risk appetite is determined, and how treatment options (accept, mitigate, transfer, avoid) are selected. Vulnerability scanning (RA-05) provides technical evidence of exploitable weaknesses that feed into the risk assessment process. Scan results should be correlated with threat intelligence to prioritise remediation based on actual exploitation risk rather than raw severity scores. The risk register is the central ISMS artefact -- a living document that captures identified risks, their current treatment status, residual risk levels, and risk ownership assignments.",
      "Access Control and Personnel Governance (AC-01, AC-13, PS-01, AT-01, AT-05): The ISMS must govern how people interact with information systems. Access control policy (AC-01) establishes the principles for granting, reviewing, and revoking access. Supervision and review of access control (AC-13) ensures that access rights remain appropriate over time -- regular access reviews are a fundamental ISMS control and a common audit finding when absent. Personnel security policy (PS-01) covers the human lifecycle from screening through employment to termination. Awareness and training policy (AT-01) ensures all personnel understand their security obligations. Contacts with security groups and associations (AT-05) keeps the organisation connected to the broader security community for threat intelligence, best practice sharing, and professional development.",
      "Operational and Technical Governance (CM-01, CP-01, MA-01, MP-01, SA-01, SI-01, SI-05): These policy controls ensure that the technical and operational dimensions of security are governed consistently. Configuration management policy (CM-01) establishes how systems are baselined, how changes are controlled, and how configurations are documented. Contingency planning policy (CP-01) governs business continuity and disaster recovery. System maintenance policy (MA-01) ensures systems are maintained securely with appropriate controls over maintenance activities and tools. Media protection policy (MP-01) governs the handling of physical and digital media. System and services acquisition policy (SA-01) ensures security is considered throughout the procurement and development lifecycle. System and information integrity policy (SI-01) governs how system integrity is maintained. Security alerts and advisories (SI-05) ensure the organisation receives and acts on vulnerability disclosures and threat advisories relevant to its technology environment."
    ],
    "assumptions": "The Plan-Do-Check-Act model is the basis for the ISMS lifecycle. Senior management commitment exists to fund, support, and actively participate in the ISMS -- ISO 27001 Clause 5.1 explicitly requires leadership commitment and this is not optional for a functioning ISMS. The scope of the ISMS has been defined, identifying which business processes, systems, locations, and data are covered. The organisation is willing to allocate dedicated resources to ISMS operation -- typically a minimum of an information security manager and supporting roles. A risk assessment methodology has been selected or will be established. The organisation has or will establish a document management capability for ISMS documentation. Internal audit competence is available or will be developed.",
    "typicalChallenges": "A structured planning approach can be extremely difficult to embed into an organisation and requires visible, sustained commitment from senior management over extended periods. Initial enthusiasm for ISMS implementation frequently wanes once the ongoing operational effort becomes apparent -- the Plan phase generates excitement, but the Check and Act phases require disciplined, repetitive work that is less visible. Policy fatigue is real: creating comprehensive policies is straightforward, but ensuring they are read, understood, followed, and kept current is a persistent challenge. Bridging the gap between governance documentation and operational reality is the central ISMS challenge -- organisations that treat the ISMS as a documentation exercise for certification purposes derive minimal security value. Internal audit independence can be difficult to achieve in smaller organisations where the security team may be auditing its own work. Measuring ISMS effectiveness beyond compliance metrics (number of policies, audit findings closed) requires security metrics that demonstrate genuine risk reduction. Integration of the ISMS with other management systems (quality, IT service management, privacy) adds complexity but also efficiency opportunities. Maintaining ISMS relevance as technology and threats evolve requires continuous scope review and control updates.",
    "indications": "Any organisation with a computing environment that must be secured in a structured manner to meet business, legal, regulatory, or industry requirements. Organisations pursuing or maintaining ISO 27001 certification. Organisations in regulated industries (financial services, healthcare, government, critical infrastructure) where structured security management is mandated. Organisations that have outgrown ad-hoc security management and need repeatable, auditable processes. Organisations preparing for SOC 2 Type II examinations, where the trust services criteria map closely to ISMS processes. Any organisation where security is a board-level concern and structured governance is expected.",
    "contraIndications": "There are no legitimate contra-indications for this pattern at any meaningful organisational scale. Even very small organisations benefit from a lightweight ISMS, though the formality and documentation depth should be proportionate to the organisation's size, risk profile, and regulatory obligations. The full ISO 27001-aligned ISMS with formal certification may not be cost-effective for very small organisations, but the underlying principles of risk-based security management, policy documentation, and continuous improvement are universally applicable.",
    "threatResistance": "The ISMS does not directly mitigate specific technical threats -- it provides the management framework that ensures technical controls are selected based on risk, implemented correctly, operated consistently, monitored for effectiveness, and improved over time. It addresses organisational threats including: governance failures where security decisions are made without structured risk assessment; compliance failures where regulatory obligations are not systematically identified and met; operational drift where controls degrade over time without monitoring and review; incident management failures where security events are not detected, reported, or handled effectively; knowledge loss when security expertise leaves the organisation without documented processes; and audit failures where the organisation cannot demonstrate due diligence in security management to regulators, auditors, customers, or insurers."
  },
  "examples": {
    "ISMS platforms and GRC tools": [
      "Vanta for automated evidence collection and continuous compliance monitoring",
      "Drata for SOC 2 and ISO 27001 compliance automation",
      "OneTrust GRC for integrated risk, compliance, and policy management",
      "ServiceNow GRC for enterprise governance, risk, and compliance workflows"
    ],
    "Risk assessment methodologies": [
      "ISO 27005 information security risk management framework",
      "NIST SP 800-30 Guide for Conducting Risk Assessments",
      "FAIR (Factor Analysis of Information Risk) for quantitative risk analysis",
      "OCTAVE Allegro for rapid security risk assessment"
    ],
    "Audit and assessment": [
      "ISO 27001 certification audit by accredited certification body (BSI, DNV, SGS)",
      "SOC 2 Type II examination by licensed CPA firm",
      "Internal audit programs using ISO 19011 audit management principles",
      "Penetration testing and red team exercises as technical assessment components"
    ],
    "Incident management platforms": [
      "PagerDuty for incident alerting, escalation, and response coordination",
      "Jira Service Management for incident workflow and tracking",
      "TheHive open-source security incident response platform",
      "Splunk SOAR (formerly Phantom) for incident response automation"
    ]
  },
  "references": [
    {
      "title": "ISO/IEC 27001:2022 Information Security Management Systems - Requirements",
      "url": "https://www.iso.org/standard/27001",
      "note": "The definitive international standard for ISMS requirements. Specifies the management system structure, leadership requirements, planning, support, operation, performance evaluation, and improvement clauses that this pattern implements."
    },
    {
      "title": "ISO/IEC 27002:2022 Information Security Controls",
      "url": "https://www.iso.org/standard/75652.html",
      "note": "Companion to ISO 27001 providing detailed implementation guidance for the Annex A controls. Reorganised in 2022 into four themes: organisational, people, physical, and technological controls."
    },
    {
      "title": "NIST SP 800-53 Rev 5: Security and Privacy Controls for Information Systems",
      "url": "https://csrc.nist.gov/publications/detail/sp/800-53/rev-5/final",
      "note": "The control catalog from which this pattern's controls are drawn. The XX-01 policy controls across all families map to the ISMS documentation and governance requirements."
    },
    {
      "title": "NIST Cybersecurity Framework (CSF) 2.0",
      "url": "https://www.nist.gov/cyberframework",
      "note": "The NIST CSF Govern function aligns closely with ISMS governance requirements. CSF 2.0 explicitly added Govern as a core function, recognising that cybersecurity risk management requires organisational governance."
    },
    {
      "title": "NIST SP 800-39: Managing Information Security Risk",
      "url": "https://csrc.nist.gov/publications/detail/sp/800-39/final",
      "note": "Framework for organisation-wide risk management across three tiers: organisation, mission/business process, and information system. Provides the risk management context within which the ISMS operates."
    },
    {
      "title": "ISO 19011:2018 Guidelines for Auditing Management Systems",
      "url": "https://www.iso.org/standard/70017.html",
      "note": "Guidance on audit program management, audit planning and execution, and auditor competence. Essential reference for the internal audit function required by ISO 27001 Clause 9.2."
    },
    {
      "title": "ISACA COBIT 2019 Framework",
      "url": "https://www.isaca.org/resources/cobit",
      "note": "IT governance framework that complements the ISMS by providing governance and management objectives for enterprise IT. COBIT's APO13 process specifically addresses information security management."
    }
  ],
  "relatedPatterns": ["SP-014", "SP-013", "SP-010", "SP-025", "SP-027"],
  "relatedPatternNames": ["Awareness and Training", "Data Security", "Identity Management", "Advanced Monitoring and Detection", "Secure AI Integration"],
  "threats": [
    {
      "id": "T-IS-001",
      "name": "Governance Failure (Security Decisions Without Risk Assessment)",
      "mitigatedBy": ["RA-01", "CA-01", "PL-01"]
    },
    {
      "id": "T-IS-002",
      "name": "Regulatory Non-Compliance and Audit Failure",
      "mitigatedBy": ["CA-02", "CA-04", "CA-07", "CA-05"]
    },
    {
      "id": "T-IS-003",
      "name": "Undetected Security Incidents",
      "mitigatedBy": ["IR-01", "IR-04", "IR-05", "IR-06"]
    },
    {
      "id": "T-IS-004",
      "name": "Control Degradation and Operational Drift",
      "mitigatedBy": ["CA-07", "CA-02", "RA-05", "CM-01"]
    },
    {
      "id": "T-IS-005",
      "name": "Inadequate Incident Response Leading to Escalated Impact",
      "mitigatedBy": ["IR-04", "IR-07", "IR-06", "IR-01"]
    },
    {
      "id": "T-IS-006",
      "name": "Unmanaged Vulnerabilities in Production Systems",
      "mitigatedBy": ["RA-05", "SI-05", "CA-05", "CM-01"]
    },
    {
      "id": "T-IS-007",
      "name": "Policy Non-Compliance by Personnel",
      "mitigatedBy": ["AT-01", "AC-01", "PS-01", "AC-13"]
    },
    {
      "id": "T-IS-008",
      "name": "Knowledge Loss and Undocumented Security Processes",
      "mitigatedBy": ["PL-01", "IR-01", "CP-01", "AT-05"]
    },
    {
      "id": "T-IS-009",
      "name": "Third-Party and Supply Chain Security Gaps",
      "mitigatedBy": ["SA-01", "CA-02", "RA-01"]
    },
    {
      "id": "T-IS-010",
      "name": "Inadequate Physical and Environmental Protection",
      "mitigatedBy": ["PE-01", "MA-01", "MP-01"]
    }
  ],
  "controls": [
    {"id": "AC-01", "name": "Access Control Policies and Procedures", "family": "AC", "emphasis": "critical"},
    {"id": "AC-13", "name": "Supervision And Review -- Access Control", "family": "AC", "emphasis": "important"},
    {"id": "AT-01", "name": "Security Awareness And Training Policy And Procedures", "family": "AT", "emphasis": "important"},
    {"id": "AT-05", "name": "Contacts With Security Groups And Associations", "family": "AT", "emphasis": "standard"},
    {"id": "AU-01", "name": "Audit And Accountability Policy And Procedures", "family": "AU", "emphasis": "important"},
    {"id": "CA-01", "name": "Certification, Accreditation, And Security Assessment Policies And Procedures", "family": "CA", "emphasis": "critical"},
    {"id": "CA-02", "name": "Security Assessments", "family": "CA", "emphasis": "critical"},
    {"id": "CA-04", "name": "Security Certification", "family": "CA", "emphasis": "important"},
    {"id": "CA-05", "name": "Plan Of Action And Milestones", "family": "CA", "emphasis": "important"},
    {"id": "CA-07", "name": "Continuous Monitoring", "family": "CA", "emphasis": "critical"},
    {"id": "CM-01", "name": "Configuration Management Policy And Procedures", "family": "CM", "emphasis": "important"},
    {"id": "CP-01", "name": "Contingency Planning Policy And Procedures", "family": "CP", "emphasis": "important"},
    {"id": "IA-01", "name": "Identification And Authentication Policy And Procedures", "family": "IA", "emphasis": "important"},
    {"id": "IR-01", "name": "Incident Response Policy And Procedures", "family": "IR", "emphasis": "critical"},
    {"id": "IR-04", "name": "Incident Handling", "family": "IR", "emphasis": "important"},
    {"id": "IR-05", "name": "Incident Monitoring", "family": "IR", "emphasis": "important"},
    {"id": "IR-06", "name": "Incident Reporting", "family": "IR", "emphasis": "important"},
    {"id": "IR-07", "name": "Incident Response Assistance", "family": "IR", "emphasis": "standard"},
    {"id": "MA-01", "name": "System Maintenance Policy And Procedures", "family": "MA", "emphasis": "standard"},
    {"id": "MP-01", "name": "Media Protection Policy And Procedures", "family": "MP", "emphasis": "standard"},
    {"id": "PE-01", "name": "Physical And Environmental Protection Policy And Procedures", "family": "PE", "emphasis": "standard"},
    {"id": "PL-01", "name": "Security Planning Policy And Procedures", "family": "PL", "emphasis": "important"},
    {"id": "PS-01", "name": "Personnel Security Policy And Procedures", "family": "PS", "emphasis": "important"},
    {"id": "RA-01", "name": "Risk Assessment Policy And Procedures", "family": "RA", "emphasis": "critical"},
    {"id": "RA-05", "name": "Vulnerability Scanning", "family": "RA", "emphasis": "important"},
    {"id": "SA-01", "name": "System And Services Acquisition Policy And Procedures", "family": "SA", "emphasis": "standard"},
    {"id": "SC-01", "name": "System And Communications Protection Policy And Procedures", "family": "SC", "emphasis": "standard"},
    {"id": "SI-01", "name": "System And Information Integrity Policy And Procedures", "family": "SI", "emphasis": "important"},
    {"id": "SI-05", "name": "Security Alerts And Advisories", "family": "SI", "emphasis": "important"}
  ],
  "controlFamilySummary": {
    "AC": 2,
    "AT": 2,
    "AU": 1,
    "CA": 5,
    "CM": 1,
    "CP": 1,
    "IA": 1,
    "IR": 5,
    "MA": 1,
    "MP": 1,
    "PE": 1,
    "PL": 1,
    "PS": 1,
    "RA": 2,
    "SA": 1,
    "SC": 1,
    "SI": 2
  },
  "$schema": "../schema/pattern.schema.json"
}